CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>AMPCOMPCTL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPARE31</name>
              <description>[31:31] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPCOMP_REQ_MODE</name>
              <description>[30:30] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPCOMP_FSM_UPDATE_RATE</name>
              <description>[29:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>250KHZ</name>
                  <value>3</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHZ</name>
                  <value>2</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHZ</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MHZ</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMPCOMP_SW_CTRL</name>
              <description>[27:27] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPCOMP_SW_EN</name>
              <description>[26:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[25:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS_OFFSET</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS_INIT</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_STEP</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIASCAP_HPTOLP_OL_CNT</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AMPCOMPTH1</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Threshold 1
This register contains threshold values for amplitude compensation algorithm</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPARE24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HPMRAMP3_LTH</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE16</name>
              <description>[17:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HPMRAMP3_HTH</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIASCAP_LPTOHP_OL_CNT</name>
              <description>[9:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HPMRAMP1_TH</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AMPCOMPTH2</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Threshold 2
This register contains threshold values for amplitude compensation algorithm.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPMUPDATE_LTH</name>
              <description>[31:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE24</name>
              <description>[25:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>LPMUPDATE_HTH</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE16</name>
              <description>[17:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_LPM</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE8</name>
              <description>[9:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_HPM</name>
              <description>[7:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE0</name>
              <description>[1:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ANABYPASSVAL1</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Analog Bypass Values 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSC_HF_ROW_Q12</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSC_HF_COLUMN_Q12</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ANABYPASSVAL2</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSC_HF_IBIASTHERM</name>
              <description>[13:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ATESTCTL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Analog Test Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCLK_LF_AUX_EN</name>
              <description>[31:31] Enable 32 kHz clock to AUX_COMPB.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED16</name>
              <description>[30:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_RCOSCMF</name>
              <description>[15:14] Test mode control for RCOSC_MF

0x0:  test modes disabled
0x1:  boosted bias current into self biased inverter
0x2:  clock qualification disabled
0x3:  boosted bias current into self biased inverter + clock qualification disabled</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ATEST_RCOSCMF</name>
              <description>[13:12] ATEST control for RCOSC_MF

0x0:  ATEST disabled
0x1:  ATEST enabled, VDD_LOCAL connected,  ATEST internal to **RCOSC_MF* enabled to send out 2MHz clock.
0x2:  ATEST disabled
0x3:  ATEST enabled, bias current connected, ATEST internal to **RCOSC_MF* enabled to send out 2MHz clock.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[11:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCDOUBLERNANOAMPCTL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>ADC Doubler Nanoamp Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>NANOAMP_BIAS_ENABLE</name>
              <description>[24:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE23</name>
              <description>[23:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[22:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SH_MODE_EN</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SH_VBUF_EN</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[3:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IREF_CTRL</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>XOSCHFCTL</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>XOSCHF Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPARE14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TCXO_MODE_XOSC_HF_EN</name>
              <description>[13:13] If this register  is 1 when TCXO_MODE  is 1, then the XOSC_HF is enabled, turning on the XOSC_HF bias current allowing a DC bias point to be provided to the clipped-sine wave clock signal on external input.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TCXO_MODE</name>
              <description>[12:12] If this register  is 1  when BYPASS is  1, this will enable clock qualification on the TCXO clock on external input.  This register has no effect when BYPASS is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[11:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAK_DET_ITRIM</name>
              <description>[9:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>[6:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[5:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_BUF_ITRIM</name>
              <description>[4:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_BUF_ITRIM</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
