CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>LFOSCCTL</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Low Frequency Oscillator Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSCLF_REGULATOR_TRIM</name>
              <description>[23:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSCLF_CMIRRWR_RATIO</name>
              <description>[21:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[17:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSCLF_RTUNE_TRIM</name>
              <description>[9:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>6P0MEG</name>
                  <value>3</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6P5MEG</name>
                  <value>2</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7P0MEG</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7P5MEG</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCOSCLF_CTUNE_TRIM</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RCOSCHFCTL</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>RCOSCHF Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSCHF_CTRIM</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RCOSCMFCTL</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>RCOSC_MF Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPARE16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSC_MF_CAP_ARRAY</name>
              <description>[15:9] Adjust RCOSC_MF capacitor array.

0x0:  nominal frequency, 0.625pF
0x40:  highest frequency, 0.125pF
0x3F:  lowest frequency, 1.125pF</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSC_MF_REG_SEL</name>
              <description>[8:8] Choose regulator type.

0:  default
1:  alternate</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSC_MF_RES_COARSE</name>
              <description>[7:6] Select coarse resistor for frequency adjustment.

0x0:  400kohms, default
0x1:  300kohms, min
0x2:  600kohms, max
0x3:  500kohms</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSC_MF_RES_FINE</name>
              <description>[5:4] Select fine resistor for frequency adjustment.

