CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI0</name>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Serial Peripheral Interface (SPI) with master and slave capabilities</description>
      <registers>
        <register>
          <name>IIDX</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>This register provides the highest priority enabled interrupt index. Value 0x00 means no event pending. Interrupt 1 is the highest priority, and 31 is the least priority. That is, the least bit position that is set to 1 denotes the highest priority pending interrupt. The priority order is fixed. However, users can implement their own prioritization schemes using other registers that expose the full set of interrupts that have occurred.
On each read, only one interrupt is indicated. On a read, the current interrupt (highest priority) is automatically cleared by the hardware and the corresponding interrupt flag in RIS and MIS are cleared as well. After a read from the CPU (not from the debug interface), the register is updated with the next highest priority interrupt, if none are pending, then it would display 0x0.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[7:0] Interrupt index status</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_DONE_TX_EVT</name>
                  <value>9</value>
                  <description>DMA Done for Transmit Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DONE_RX_EVT</name>
                  <value>8</value>
                  <description>DMA Done for Receive Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_EVT</name>
                  <value>7</value>
                  <description>End of Transmit Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_EMPTY</name>
                  <value>6</value>
                  <description>Transmit Buffer Empty Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_EVT</name>
                  <value>5</value>
                  <description>Transmit Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_EVT</name>
                  <value>4</value>
                  <description>Receive Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTOUT_EVT</name>
                  <value>3</value>
                  <description>SPI Receive Time-Out Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EVT</name>
                  <value>2</value>
                  <description>Transmit Parity Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFO_OFV_EVT</name>
                  <value>1</value>
                  <description>RX FIFO Overflow Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_INTR</name>
                  <value>0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IMASK</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Interrupt Mask. If a bit is set, then corresponding interrupt is un-masked. Un-masking the interrupt causes the raw interrupt to be visible in IIDX, as well as MIS.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] DMA Done event for TX event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] DMA Done event for RX event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] SPI Idle event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Transmit FIFO Empty event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Transmit FIFO event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Receive FIFO event. This interrupt is set if the selected Receive FIFO level has been reached</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] SPI Receive Time-Out event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Parity error event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] RXFIFO overflow event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Raw interrupt status. Reflects all pending interrupts, regardless of masking. The RIS register allows the user to implement a poll scheme. A flag set in this register can be cleared by writing 1 to the ICLR register bit even if the corresponding IMASK bit is not enabled.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] DMA Done event for TX. This interrupt is set if the TX DMA channel sends the DONE signal. This allows the handling of the DMA event inside the mapped peripheral.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] DMA Done event for RX. This interrupt is set if the RX DMA channel sends the DONE signal. This allows the handling of the DMA event inside the mapped peripheral.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] SPI has completed transfers and changed into IDLE mode. This bit is set when STAT.BUSY goes low.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been move to the shift register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Transmit FIFO event. This interrupt is set if the selected Transmit FIFO level has been reached.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Receive FIFO event. This interrupt is set if the selected Receive FIFO level has been reached</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] SPI Receive Time-Out event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Parity error event: this bit is set if a parity error has been detected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
