CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>MIS</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Masked interrupt status. This is an AND of the IMASK and RIS registers.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] Masked DMA Done event for TX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] Masked DMA Done event for RX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] Masked SPI IDLE mode event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Masked Transmit FIFO Empty event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Masked Transmit FIFO event. This interrupt is set if the selected Transmit FIFO level has been reached.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Masked receive FIFO event. This interrupt is set if the selected Receive FIFO level has been reached</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] Masked SPI Receive Time-Out Interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Masked Parity error event: this bit if a parity error has been detected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] Masked RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ISET</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Interrupt set. Allows interrupts to be set by software (useful in diagnostics and safety checks). Writing a 1 to a bit in ISET will set the event and therefore the related RIS bit also gets set. If the interrupt is enabled through the mask, then the corresponding MIS bit is also set.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] Set DMA Done event for TX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] Set DMA Done event for RX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] Set SPI IDLE mode event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Set Transmit FIFO Empty event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Set Transmit FIFO event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Set Receive FIFO event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] Set SPI Receive Time-Out event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Set Parity error event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] Set RXFIFO overflow event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICLR</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Interrupt clear. Write a 1 to clear the corresponding Interrupt.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] Clear DMA Done event for TX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] Clear DMA Done event for RX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] Clear SPI IDLE mode event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Clear Transmit FIFO Empty event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Clear Transmit FIFO event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Clear Receive FIFO event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] Clear SPI Receive Time-Out event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Clear Parity error event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] Clear RXFIFO overflow event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVT_MODE</name>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <description>Event mode register. It is used to select whether each line is disabled, in software mode (software clears the RIS) or in hardware mode (hardware clears the RIS)
Note: The recommendation is to use SPI in the software mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INT0_CFG</name>
              <description>[1:0] Event line mode select for event corresponding to IPSTANDARD.INT_EVENT0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <value>2</value>
                  <description>The interrupt or event line is in hardware mode. The hardware  automatically clears the RIS flag.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE</name>
                  <value>1</value>
                  <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>The interrupt or event line is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
