CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>DESC</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>This register identifies the peripheral and its exact version.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODULEID</name>
              <description>[31:16] Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>FEATUREVER</name>
              <description>[15:12] Feature set version for this module instance.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>[11:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJREV</name>
              <description>[7:4] Major revision of the IP</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MINREV</name>
              <description>[3:0] Minor revision of the IP</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x14110010</resetValue>
        </register>
        <register>
          <name>CTL0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>SPI Control Register 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED15</name>
              <description>[31:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CSCLR</name>
              <description>[14:14] Clear shift register counter when CS gets inactive. This bit is relevant only in the slave mode, CTL1.MS = 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable automatic clear of shift register when CS gets inactive.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable automatic clear of shift register when CS gets inactive.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[13:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[11:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SPH</name>
              <description>[9:9] CLKOUT phase (Motorola SPI frame format only)
This bit selects the clock edge that captures data and enables it to change state. It has the most impact on the first bit transmitted by either permitting or not permitting a clock transition before the first data capture edge.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECOND</name>
                  <value>1</value>
                  <description>Data is captured on the second clock edge transition.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST</name>
                  <value>0</value>
                  <description>Data is captured on the first clock edge transition.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPO</name>
              <description>[8:8] CLKOUT polarity (Motorola SPI frame format only)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>1</value>
                  <description>SPI produces a steady state HIGH value on the CLKOUT when data is not being transferred.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0</value>
                  <description>SPI produces a steady state LOW value on the CLKOUT when data is not being transferred.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FRF</name>
              <description>[6:5] Frame format Select</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIRCOWIRE</name>
                  <value>3</value>
                  <description>National MICROWIRE frame format</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TI_SYNC</name>
                  <value>2</value>
                  <description>TI synchronous serial frame format</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOTOROLA_4WIRE</name>
                  <value>1</value>
                  <description>Motorola SPI frame format (4 wire mode)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOTOROLA_3WIRE</name>
                  <value>0</value>
                  <description>Motorola SPI frame format (3 wire mode)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSS</name>
              <description>[4:0] Data Size Select.
Note:
Master mode: Values 0 - 2 are reserved and shall not be used. This will map to 4 bit mode. A value of 3h corresponds to 4-bit data (and so on).
Slave mode: DSS should be no less than 6 which means the minimum frame length is 7 bits.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSS_32</name>
                  <value>31</value>
                  <description>Data Size Select bits: 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_31</name>
                  <value>30</value>
                  <description>Data Size Select bits: 31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_30</name>
                  <value>29</value>
                  <description>Data Size Select bits: 30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_29</name>
                  <value>28</value>
                  <description>Data Size Select bits: 29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_28</name>
                  <value>27</value>
                  <description>Data Size Select bits: 28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_27</name>
                  <value>26</value>
                  <description>Data Size Select bits: 27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_26</name>
                  <value>25</value>
                  <description>Data Size Select bits: 26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_25</name>
                  <value>24</value>
                  <description>Data Size Select bits: 25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_24</name>
                  <value>23</value>
                  <description>Data Size Select bits: 24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_23</name>
                  <value>22</value>
                  <description>Data Size Select bits: 23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_22</name>
                  <value>21</value>
                  <description>Data Size Select bits: 22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_21</name>
                  <value>20</value>
                  <description>Data Size Select bits: 21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_20</name>
                  <value>19</value>
                  <description>Data Size Select bits: 20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_19</name>
                  <value>18</value>
                  <description>Data Size Select bits: 19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_18</name>
                  <value>17</value>
                  <description>Data Size Select bits: 18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_17</name>
                  <value>16</value>
                  <description>Data Size Select bits: 17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_16</name>
                  <value>15</value>
                  <description>Data Size Select bits: 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_15</name>
                  <value>14</value>
                  <description>Data Size Select bits: 15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_14</name>
                  <value>13</value>
                  <description>Data Size Select bits: 14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_13</name>
                  <value>12</value>
                  <description>Data Size Select bits: 13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_12</name>
                  <value>11</value>
                  <description>Data Size Select bits: 12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_11</name>
                  <value>10</value>
                  <description>Data Size Select bits: 11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_10</name>
                  <value>9</value>
                  <description>Data Size Select bits: 10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_9</name>
                  <value>8</value>
                  <description>Data Size Select bits: 9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_8</name>
                  <value>7</value>
                  <description>Data Size Select bits: 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_7</name>
                  <value>6</value>
                  <description>Data Size Select bits: 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_6</name>
                  <value>5</value>
                  <description>Data Size Select bits: 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_5</name>
                  <value>4</value>
                  <description>Data Size Select bits: 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSS_4</name>
                  <value>3</value>
                  <description>Data Size Select bits: 4</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
