CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>FBRD</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Fractional Baud-Rate Divisor
If this register is modified while trasmission or reception is on-going, the baudrate will not be updated until transmission or reception of the current character is complete.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVFRAC</name>
              <description>[5:0] Fractional Baud-Rate Divisor:
The baud rate divisor is calculated using the formula below:
Baud rate divisor = (UART reference clock frequency) / (16 * Baud rate)
Baud rate divisor must be minimum 1 and maximum 65535.
That is, IBRD.DIVINT=0 does not give a valid baud rate.
Similarly, if IBRD.DIVINT=0xFFFF, any non-zero values in DIVFRAC will be illegal.
A valid value must be written to this field before the UART can be used for RX or TX operations.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LCRH</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Line Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPS</name>
              <description>[7:7] UART Stick Parity Select:

0: Stick parity is disabled
1: The parity bit is transmitted and checked as invert of EPS field (i.e. the parity bit is transmitted and checked as 1 when EPS = 0).

This bit has no effect when PEN disables parity checking and generation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WLEN</name>
              <description>[6:5] UART Word Length:
These bits indicate the number of data bits transmitted or received in a frame.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8</name>
                  <value>3</value>
                  <description>Word Length 8 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>2</value>
                  <description>Word Length 7 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>1</value>
                  <description>Word Length 6 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>0</value>
                  <description>Word Length 5 bits</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FEN</name>
              <description>[4:4] UART Enable FIFOs</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Transmit and receive FIFO buffers are enabled (FIFO mode)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>FIFOs are disabled (character mode) that is, the FIFOs become 1-byte-deep holding registers.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STP2</name>
              <description>[3:3] UART Two Stop Bits Select:
If this bit is set to 1, two stop bits are transmitted at the end of the frame. The receive logic does not check for two stop bits being received.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EPS</name>
              <description>[2:2] UART Even Parity Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVEN</name>
                  <value>1</value>
                  <description>Even parity: The UART generates or checks for an even number of 1s in the data and parity bits.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODD</name>
                  <value>0</value>
                  <description>Odd parity: The UART generates or checks for an odd number of 1s in the data and parity bits.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEN</name>
              <description>[1:1] UART Parity Enable
This bit controls generation and checking of parity bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Parity checking and generation is enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Parity is disabled and no parity bit is added to the data frame</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRK</name>
              <description>[0:0] UART Send Break
If this bit is set to 1, a low-level is continually output on the UARTTXD output pin, after completing transmission of the current character. For the proper execution of the break command, the
software must set this bit for at least two complete frames. For normal use, this bit must be cleared to 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CTSEN</name>
              <description>[15:15] CTS hardware flow control enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>CTS hardware flow control enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>CTS hardware flow control disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTSEN</name>
              <description>[14:14] RTS hardware flow control enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>RTS hardware flow control enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>RTS hardware flow control disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[13:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS</name>
              <description>[11:11] Request to Send
This bit is the complement of the active-low UART RTS output. That is, when the bit is programmed to a 1 then RTS output on the pins is LOW.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[10:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RXE</name>
              <description>[9:9] UART Receive Enable
If the UART is disabled in the middle of reception, it completes the current character before stopping.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>UART Receive enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>UART Receive disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXE</name>
              <description>[8:8] UART Transmit Enable
If the UART is disabled in the middle of transmission, it completes the current character before stopping.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>UART Transmit enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>UART Transmit disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBE</name>
              <description>[7:7] UART Loop Back Enable:
Enabling the loop-back mode connects the UARTTXD output from the UART to UARTRXD input of the UART.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Loop Back enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Loop Back disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[6:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>UARTEN</name>
              <description>[0:0] UART Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>UART enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>UART disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x300</resetValue>
        </register>
        <register>
          <name>IFLS</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Interrupt FIFO Level Select</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSEL</name>
              <description>[5:3] Receive interrupt FIFO level select:
This field sets the trigger points for the receive interrupt. Values 0b101-0b111 are reserved.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>7_8</name>
                  <value>4</value>
                  <description>Receive FIFO becomes &gt;= 7/8 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_8</name>
                  <value>3</value>
                  <description>Receive FIFO becomes &gt;= 3/4 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_8</name>
                  <value>2</value>
                  <description>Receive FIFO becomes &gt;= 1/2 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_8</name>
                  <value>1</value>
                  <description>Receive FIFO becomes &gt;= 1/4 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_8</name>
                  <value>0</value>
                  <description>Receive FIFO becomes &gt;= 1/8 full</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSEL</name>
              <description>[2:0] Transmit interrupt FIFO level select:
This field sets the trigger points for the transmit interrupt. Values 0b101-0b111 are reserved.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>7_8</name>
                  <value>4</value>
                  <description>Transmit FIFO becomes &lt;= 7/8 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_8</name>
                  <value>3</value>
                  <description>Transmit FIFO becomes &lt;= 3/4 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_8</name>
                  <value>2</value>
                  <description>Transmit FIFO becomes &lt;= 1/2 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_8</name>
                  <value>1</value>
                  <description>Transmit FIFO becomes &lt;= 1/4 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_8</name>
                  <value>0</value>
                  <description>Transmit FIFO becomes &lt;= 1/8 full</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x12</resetValue>
        </register>
