CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>RIS</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Raw interrupt status. Reflects all pending interrupts, regardless of masking. The RIS register allows the user to implement a poll scheme. A flag set in this register can be cleared by writing 1 to the ICLR register bit even if the corresponding IMASK bit is not enabled.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] DMA Done event for TX. This interrupt is set if the TX DMA channel sends the DONE signal. This allows the handling of the DMA event inside the mapped peripheral.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] DMA Done event for RX. This interrupt is set if the RX DMA channel sends the DONE signal. This allows the handling of the DMA event inside the mapped peripheral.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] SPI has completed transfers and changed into IDLE mode. This bit is set when STAT.BUSY goes low.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been move to the shift register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Transmit FIFO event. This interrupt is set if the selected Transmit FIFO level has been reached.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Receive FIFO event. This interrupt is set if the selected Receive FIFO level has been reached</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] SPI Receive Time-Out event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Parity error event: this bit is set if a parity error has been detected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Masked interrupt status. This is an AND of the IMASK and RIS registers.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] Masked DMA Done event for TX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] Masked DMA Done event for RX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] Masked SPI IDLE mode event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Masked Transmit FIFO Empty event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Masked Transmit FIFO event. This interrupt is set if the selected Transmit FIFO level has been reached.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Masked receive FIFO event. This interrupt is set if the selected Receive FIFO level has been reached</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] Masked SPI Receive Time-Out Interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Masked Parity error event: this bit if a parity error has been detected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] Masked RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ISET</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Interrupt set. Allows interrupts to be set by software (useful in diagnostics and safety checks). Writing a 1 to a bit in ISET will set the event and therefore the related RIS bit also gets set. If the interrupt is enabled through the mask, then the corresponding MIS bit is also set.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] Set DMA Done event for TX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] Set DMA Done event for RX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] Set SPI IDLE mode event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Set Transmit FIFO Empty event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Set Transmit FIFO event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Set Receive FIFO event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] Set SPI Receive Time-Out event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Set Parity error event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] Set RXFIFO overflow event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
