CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>CLKDIV2</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>This register is used to specify a divide ratio of the SPI functional clock.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RATIO</name>
              <description>[2:0] Selects divide ratio of module clock</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <value>7</value>
                  <description>Divide clock source by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_7</name>
                  <value>6</value>
                  <description>Divide clock source by 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_6</name>
                  <value>5</value>
                  <description>Divide clock source by 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_5</name>
                  <value>4</value>
                  <description>Divide clock source by 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <value>3</value>
                  <description>Divide clock source by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_3</name>
                  <value>2</value>
                  <description>Divide clock source by 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <value>1</value>
                  <description>Divide clock source by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_1</name>
                  <value>0</value>
                  <description>Do not divide clock source</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACR</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>DMA Control Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>[1:1] Transmit FIFO DMA enable when set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAE</name>
              <description>[0:0] Receive FIFO DMA enable when set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RXDATA</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>RXDATA Register. Reading this register returns value in the RX FIFO pointed by the current FIFO read pointer. If the RX FIFO is empty, the last read value is returned. Writing has not effect and is ignored.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>[31:0] Received Data</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TXDATA</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>TXDATA Register. Writing into this register puts the data into the TX FIFO. Reading this register returns the last written value, pointed by the current FIFO write pointer.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>[31:0] Transmit Data</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI2</name>
      <baseAddress>0x40009000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Serial Peripheral Interface (SPI) with master and slave capabilities</description>
      <registers>
        <register>
          <name>IIDX</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>This register provides the highest priority enabled interrupt index. Value 0x00 means no event pending. Interrupt 1 is the highest priority, and 31 is the least priority. That is, the least bit position that is set to 1 denotes the highest priority pending interrupt. The priority order is fixed. However, users can implement their own prioritization schemes using other registers that expose the full set of interrupts that have occurred.
On each read, only one interrupt is indicated. On a read, the current interrupt (highest priority) is automatically cleared by the hardware and the corresponding interrupt flag in RIS and MIS are cleared as well. After a read from the CPU (not from the debug interface), the register is updated with the next highest priority interrupt, if none are pending, then it would display 0x0.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[7:0] Interrupt index status</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_DONE_TX_EVT</name>
                  <value>9</value>
                  <description>DMA Done for Transmit Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DONE_RX_EVT</name>
                  <value>8</value>
                  <description>DMA Done for Receive Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_EVT</name>
                  <value>7</value>
                  <description>End of Transmit Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_EMPTY</name>
                  <value>6</value>
                  <description>Transmit Buffer Empty Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_EVT</name>
                  <value>5</value>
                  <description>Transmit Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_EVT</name>
                  <value>4</value>
                  <description>Receive Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTOUT_EVT</name>
                  <value>3</value>
                  <description>SPI Receive Time-Out Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EVT</name>
                  <value>2</value>
                  <description>Transmit Parity Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFO_OFV_EVT</name>
                  <value>1</value>
                  <description>RX FIFO Overflow Event/interrupt pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_INTR</name>
                  <value>0</value>
                  <description>No interrupt pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IMASK</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Interrupt Mask. If a bit is set, then corresponding interrupt is un-masked. Un-masking the interrupt causes the raw interrupt to be visible in IIDX, as well as MIS.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_DONE_TX</name>
              <description>[8:8] DMA Done event for TX event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DONE_RX</name>
              <description>[7:7] DMA Done event for RX event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>[6:6] SPI Idle event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>[5:5] Transmit FIFO Empty event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>[4:4] Transmit FIFO event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>[3:3] Receive FIFO event. This interrupt is set if the selected Receive FIFO level has been reached</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOUT</name>
              <description>[2:2] SPI Receive Time-Out event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>[1:1] Parity error event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFIFO_OVF</name>
              <description>[0:0] RXFIFO overflow event mask.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set Interrupt Mask</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear Interrupt Mask</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
