CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>CTL1</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>SPI Control Register 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED30</name>
              <description>[31:30] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RXTIMEOUT</name>
              <description>[29:24] Receive Timeout (only for Slave mode). This register defines the number of clock cycles after which the Receive Timeout interrupt is set.
A value of 0 disables this function.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>63</value>
                  <description>Highest possible value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Smallest value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPEATTX</name>
              <description>[23:16] Counter to repeat last transfer. A value of 0 disables this feature. After a non-zero value (X) is written to this register, SPI transfer can be started with writing a data into the TX Buffer. The data will be transferred X+1 times in total. The behavior is identical as if the data were be written into the TX Buffer that many times as defined by the value here additionally.
It can be used to clean a transfer or to pull a certain amount of data by a slave. This feature can be used only in the master mode.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>REPEATTX disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[15:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFORST</name>
              <description>[10:10] This bit is used to reset transmit and receive FIFO pointers. The pointers are held at a reset value until this bit is cleared to zero.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set FIFO pointers reset trigger</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Clear FIFO pointers reset trigger</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>[9:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PBS</name>
              <description>[7:7] Parity Bit Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Bit 1 is used for Parity, Bit 0 is ignored</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Bit 0 is used for Parity</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PES</name>
              <description>[6:6] Even Parity Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Even Parity mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Odd Parity mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEN</name>
              <description>[5:5] Parity enable
if enabled the last bit will be used as parity to evaluate the right transmission of the previous bits.
In case of a parity mismatch the parity error flag RIS.PER will be set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable Parity function</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable Parity function</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSB</name>
              <description>[4:4] MSB first select. Controls the direction of the receive and transmit shift register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>MSB first</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>LSB first</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOD</name>
              <description>[3:3] Slave-mode: Data output disabled
This bit is relevant only in the slave mode, MS=0. In multiple-slave systems, it is possible for an SPI master to broadcast a message to all slaves in the system while ensuring that only one slave drives data onto its serial output line. In such systems the RX lines from multiple slaves could be tied together. To operate in such systems, this bitfield can be set if the SPI slave is not supposed to drive the TX line.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>SPI cannot drive the MISO output via TX in slave mode.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>SPI can drive the MISO output via TX in slave mode.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MS</name>
              <description>[2:2] Master or slave mode select. This bit can be modified only when SPI is disabled, CTL1.ENABLE = 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Select Master Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Select Slave Mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBM</name>
              <description>[1:1] Loop back mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable loopback mode.Output of transmit serial shifter is connected to input of receive serial shifter internally.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable loopback mode. Normal serial port operation enabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] SPI enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable module function</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable module function</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x4</resetValue>
        </register>
        <register>
          <name>CLKCTL</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>Clock prescaler and divider register. This register contains the settings for the Clock prescaler and divider settings.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSAMPLE</name>
              <description>[31:28] Delayed sampling. In master mode the data on the input pin will be sampled after the defined clock cycles. Note: As an example, if the SPI transmit frequency is set to 12 MHz in the master mode, DSAMPLE should be set to a value of 2</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[27:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SCR</name>
              <description>[9:0] Serial clock divider:
This is used to generate the transmit and receive bit rate of the SPI.
The SPI bit rate is
(SPI's functional clock frequency)/((SCR+1)*2).
SCR is a value from 0-1023.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>1023</value>
                  <description>Highest possible value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Smallest value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IFLS</name>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <description>The IFLS register is the interrupt FIFO level select register. This register can be used to define the levels at which the TX, RX FIFO interrupt flags are triggered. Out of reset, the TXIFLSEL and RXIFLSEL bits are configured so that the FIFOs trigger an interrupt at the half-way mark.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RXIFLSEL</name>
              <description>[5:3] SPI Receive Interrupt FIFO Level Select  The trigger points for the receive interrupt are as follows:</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL_1</name>
                  <value>7</value>
                  <description>Trigger when RX FIFO contains &gt;= 1 byte</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_RES6</name>
                  <value>6</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_FULL</name>
                  <value>5</value>
                  <description>RX FIFO is full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_RES4</name>
                  <value>4</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3_4</name>
                  <value>3</value>
                  <description>RX FIFO &gt;= 3/4 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1_2</name>
                  <value>2</value>
                  <description>RX FIFO &gt;= 1/2 full (default)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1_4</name>
                  <value>1</value>
                  <description>RX FIFO &gt;= 1/4 full</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_OFF</name>
                  <value>0</value>
                  <description>Reserved</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXIFLSEL</name>
              <description>[2:0] SPI Transmit Interrupt FIFO Level Select  The trigger points for the transmit interrupt are as follows:</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL_1</name>
                  <value>7</value>
                  <description>Trigger when TX FIFO has &gt;= 1 byte free</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_RES6</name>
                  <value>6</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_EMPTY</name>
                  <value>5</value>
                  <description>TX FIFO is empty</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_RES4</name>
                  <value>4</value>
                  <description>Reserved</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1_4</name>
                  <value>3</value>
                  <description>TX FIFO &lt;= 1/4 empty</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1_2</name>
                  <value>2</value>
                  <description>TX FIFO &lt;= 1/2 empty (default)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3_4</name>
                  <value>1</value>
                  <description>TX FIFO &lt;= 3/4 empty</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_OFF</name>
                  <value>0</value>
                  <description>Reserved</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x12</resetValue>
        </register>
        <register>
          <name>STAT</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>Status Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>[4:4] Busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>SPI is currently transmitting and/or receiving data, or transmit FIFO is not empty.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>0</value>
                  <description>SPI is in idle mode.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNF</name>
              <description>[3:3] Receive FIFO not full</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FULL</name>
                  <value>1</value>
                  <description>Receive FIFO is not full.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <value>0</value>
                  <description>Receive FIFO is full.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFE</name>
              <description>[2:2] Receive FIFO empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <value>1</value>
                  <description>Receive FIFO is empty.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_EMPTY</name>
                  <value>0</value>
                  <description>Receive FIFO is not empty.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNF</name>
              <description>[1:1] Transmit FIFO not full</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FULL</name>
                  <value>1</value>
                  <description>Transmit FIFO is not full.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <value>0</value>
                  <description>Transmit FIFO is full.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFE</name>
              <description>[0:0] Transmit FIFO empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <value>1</value>
                  <description>Transmit FIFO is empty.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_EMPTY</name>
                  <value>0</value>
                  <description>Transmit FIFO is not empty.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
