CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPT2</name>
      <baseAddress>0x40012000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>General Purpose Timer.</description>
      <registers>
        <register>
          <name>CFG</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Configuration</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>[2:0] GPT Configuration
0x2- 0x3 - Reserved
0x5- 0x7 - Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16BIT_TIMER</name>
                  <value>4</value>
                  <description>16-bit timer configuration.
Configure for two 16-bit timers.
Also see TAMR.TAMR and TBMR.TBMR.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT_TIMER</name>
                  <value>0</value>
                  <description>32-bit timer configuration</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TAMR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Timer A Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TCACT</name>
              <description>[15:13] Timer Compare Action Select</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRSET_ON_TO</name>
                  <value>7</value>
                  <description>Clear CCP output pin immediately and set on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETCLR_ON_TO</name>
                  <value>6</value>
                  <description>Set CCP output pin immediately and clear on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRTOG_ON_TO</name>
                  <value>5</value>
                  <description>Clear CCP output pin immediately and toggle on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETTOG_ON_TO</name>
                  <value>4</value>
                  <description>Set CCP output pin immediately and toggle on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_TO</name>
                  <value>3</value>
                  <description>Set CCP output pin on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_TO</name>
                  <value>2</value>
                  <description>Clear CCP output pin on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOG_ON_TO</name>
                  <value>1</value>
                  <description>Toggle State on Time-Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_CMP</name>
                  <value>0</value>
                  <description>Disable compare operations</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACINTD</name>
              <description>[12:12] One-Shot/Periodic Interrupt Disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_TO_INTR</name>
                  <value>1</value>
                  <description>Time-out interrupt are disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_TO_INTR</name>
                  <value>0</value>
                  <description>Time-out interrupt function as normal</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAPLO</name>
              <description>[11:11] GPTM Timer A PWM Legacy Operation

0  Legacy operation with CCP pin driven Low when the TAILR
register is reloaded after the timer reaches 0.

1 CCP is driven High when the TAILR  register is reloaded after the timer reaches 0.

This bit is only valid in PWM mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCP_ON_TO</name>
                  <value>1</value>
                  <description>CCP output pin is set to 1 on time-out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <value>0</value>
                  <description>Legacy operation</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMRSU</name>
              <description>[10:10] Timer A Match Register Update mode

