CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: Not inverted
1: Inverted</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WCLK_SRC</name>
              <description>[1:0] Selects WCLK source for AIF (should be the same as the BCLK source). The BCLK source is defined in the PRCM:I2SBCLKSEL.SRC</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <value>3</value>
                  <description>Not supported. Will give same WCLK as 'NONE' ('00')</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <value>2</value>
                  <description>Internal WCLK generator, from module PRCM</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <value>1</value>
                  <description>External WCLK generator, from pad</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>None ('0')</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AIFDMACFG</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>DMA Buffer Size Configuration</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>END_FRAME_IDX</name>
              <description>[7:0] Defines the length of the DMA buffer. Writing a non-zero value to this register field enables and initializes AIF. Note that before doing so, all other configuration must have been done, and AIFINPTRNEXT/AIFOUTPTRNEXT must have been loaded.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AIFDIRCFG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Pin Direction</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AD1</name>
              <description>[5:4] Configures the AD1 audio data pin usage:

0x3: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>2</value>
                  <description>Output mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Not in use (disabled)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[3:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AD0</name>
              <description>[1:0] Configures the AD0 audio data pin usage:

0x3: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>2</value>
                  <description>Output mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Not in use (disabled)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AIFFMTCFG</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Serial Interface Format Configuration</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA_DELAY</name>
              <description>[15:8] The number of BCLK periods between a WCLK edge and MSB of the first word in a phase:

0x00: LJF and DSP format
0x01: I2S and DSP format
0x02: RJF format
...
0xFF: RJF format

Note: When 0, MSB of the next word will be output in the idle period between LSB of the previous word and the start of the next word. Otherwise logical 0 will be output until the data delay has expired.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_LEN_24</name>
              <description>[7:7] The size of each word stored to or loaded from memory:</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24BIT</name>
                  <value>1</value>
                  <description>24-bit (one 8 bit and one 16 bit locked access per sample)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BIT</name>
                  <value>0</value>
                  <description>16-bit (one 16 bit access per sample)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPL_EDGE</name>
              <description>[6:6] On the serial audio interface, data (and wclk) is sampled and clocked out on opposite edges of BCLK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POS</name>
                  <value>1</value>
                  <description>Data is sampled on the positive edge and clocked out on the negative edge.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <value>0</value>
                  <description>Data is sampled on the negative edge and clocked out on the positive edge.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUAL_PHASE</name>
              <description>[5:5] Selects dual- or single-phase format.

