CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Writing 1 to a bit position sets the corresponding bit in the DOUT47_0 register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO47</name>
              <description>[15:15] Set bit 47</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO46</name>
              <description>[14:14] Set bit 46</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO45</name>
              <description>[13:13] Set bit 45</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO44</name>
              <description>[12:12] Set bit 44</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO43</name>
              <description>[11:11] Set bit 43</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO42</name>
              <description>[10:10] Set bit 42</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO41</name>
              <description>[9:9] Set bit 41</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO40</name>
              <description>[8:8] Set bit 40</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO39</name>
              <description>[7:7] Set bit 39</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO38</name>
              <description>[6:6] Set bit 38</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO37</name>
              <description>[5:5] Set bit 37</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO36</name>
              <description>[4:4] Set bit 36</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO35</name>
              <description>[3:3] Set bit 35</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO34</name>
              <description>[2:2] Set bit 34</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO33</name>
              <description>[1:1] Set bit 33</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO32</name>
              <description>[0:0] Set bit 32</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUTCLR31_0</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>Data Out Clear

Writing 1 to a bit position clears the corresponding bit in the DOUT47_0 register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIO31</name>
              <description>[31:31] Clears bit 31</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO30</name>
              <description>[30:30] Clears bit 30</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO29</name>
              <description>[29:29] Clears bit 29</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO28</name>
              <description>[28:28] Clears bit 28</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO27</name>
              <description>[27:27] Clears bit 27</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO26</name>
              <description>[26:26] Clears bit 26</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO25</name>
              <description>[25:25] Clears bit 25</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO24</name>
              <description>[24:24] Clears bit 24</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO23</name>
              <description>[23:23] Clears bit 23</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO22</name>
              <description>[22:22] Clears bit 22</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO21</name>
              <description>[21:21] Clears bit 21</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO20</name>
              <description>[20:20] Clears bit 20</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO19</name>
              <description>[19:19] Clears bit 19</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO18</name>
              <description>[18:18] Clears bit 18</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO17</name>
              <description>[17:17] Clears bit 17</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO16</name>
              <description>[16:16] Clears bit 16</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO15</name>
              <description>[15:15] Clears bit 15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO14</name>
              <description>[14:14] Clears bit 14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO13</name>
              <description>[13:13] Clears bit 13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO12</name>
              <description>[12:12] Clears bit 12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO11</name>
              <description>[11:11] Clears bit 11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO10</name>
              <description>[10:10] Clears bit 10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO9</name>
              <description>[9:9] Clears bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO8</name>
              <description>[8:8] Clears bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO7</name>
              <description>[7:7] Clears bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO6</name>
              <description>[6:6] Clears bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO5</name>
              <description>[5:5] Clears bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO4</name>
              <description>[4:4] Clears bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO3</name>
              <description>[3:3] Clears bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO2</name>
              <description>[2:2] Clears bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO1</name>
              <description>[1:1] Clears bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO0</name>
              <description>[0:0] Clears bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUTCLR47_32</name>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <description>Data Out Clear

Writing 1 to a bit position clears the corresponding bit in the DOUT47_0 register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO47</name>
              <description>[15:15] Clears bit 47</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO46</name>
              <description>[14:14] Clears bit 46</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO45</name>
              <description>[13:13] Clears bit 45</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO44</name>
              <description>[12:12] Clears bit 44</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO43</name>
              <description>[11:11] Clears bit 43</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO42</name>
              <description>[10:10] Clears bit 42</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO41</name>
              <description>[9:9] Clears bit 41</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO40</name>
              <description>[8:8] Clears bit 40</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO39</name>
              <description>[7:7] Clears bit 39</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO38</name>
              <description>[6:6] Clears bit 38</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO37</name>
              <description>[5:5] Clears bit 37</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO36</name>
              <description>[4:4] Clears bit 36</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO35</name>
              <description>[3:3] Clears bit 35</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO34</name>
              <description>[2:2] Clears bit 34</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO33</name>
              <description>[1:1] Clears bit 33</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO32</name>
              <description>[0:0] Clears bit 32</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUTTGL31_0</name>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <description>Data Out Toggle

