CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: An interrupt has not occurred or is masked.
1: A master interrupt is pending.

This bit is cleared by writing 1 to the MICR.IC bit .</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MICR</name>
          <addressOffset>0x81c</addressOffset>
          <size>32</size>
          <description>Master Interrupt Clear
This register clears the raw and masked interrupt.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>IC</name>
              <description>[0:0] Interrupt clear
Writing 1 to this bit clears MRIS.RIS and  MMIS.MIS .

Reading this register returns no meaningful data.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MCR</name>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <description>Master Configuration
This register configures the mode (Master or Slave) and sets the interface for test mode loopback.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SFE</name>
              <description>[5:5] I2C slave function enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Slave mode is enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Slave mode is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFE</name>
              <description>[4:4] I2C master function enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Master mode is enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Master mode is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBK</name>
              <description>[0:0] I2C loopback

0: Normal operation
1: Loopback operation (test mode)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Test Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Test Mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VIMS</name>
      <baseAddress>0x40034000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Versatile Instruction Memory System
Controls memory access to the Flash and encapsulates the following instruction memories:
- Boot ROM
- Cache / GPRAM</description>
      <registers>
        <register>
          <name>STAT</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Status
Displays current VIMS mode and line buffer status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IDCODE_LB_DIS</name>
              <description>[5:5] Icode/Dcode flash line buffer status

0: Enabled or in transition to disabled
1: Disabled and flushed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSBUS_LB_DIS</name>
              <description>[4:4] Sysbus flash line buffer control

0: Enabled or in transition to disabled
1: Disabled and flushed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE_CHANGING</name>
              <description>[3:3] VIMS mode change status

0: VIMS is in the mode defined by MODE
1: VIMS is in the process of changing to the mode given in CTL.MODE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INV</name>
              <description>[2:2] This bit is set when invalidation of the cache memory is active / ongoing</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:0] Current VIMS mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>3</value>
                  <description>VIMS Off mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE</name>
                  <value>1</value>
                  <description>VIMS Cache mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPRAM</name>
                  <value>0</value>
                  <description>VIMS GPRAM mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Control
Configure VIMS mode and line buffer settings</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATS_CLR</name>
              <description>[31:31] Set this bit to clear statistic counters.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STATS_EN</name>
              <description>[30:30] Set this bit to enable statistic counters.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DYN_CG_EN</name>
              <description>[29:29] 0: The in-built clock gate functionality is bypassed.
1: The in-built clock gate functionality is enabled, automatically gating the clock when not needed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[28:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IDCODE_LB_DIS</name>
              <description>[5:5] Icode/Dcode flash line buffer control

0: Enable
1: Disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBUS_LB_DIS</name>
              <description>[4:4] Sysbus flash line buffer control

0: Enable
1: Disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_CFG</name>
              <description>[3:3] Icode/Dcode and sysbus arbitation scheme

