CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: Static arbitration  (icode/docde &gt; sysbus)
1: Round-robin arbitration</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PREF_EN</name>
              <description>[2:2] Tag prefetch control

0: Disabled
1: Enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:0] VIMS mode request.
Write accesses to this field will be blocked while STAT.MODE_CHANGING is set to 1.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>3</value>
                  <description>VIMS Off mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE</name>
                  <value>1</value>
                  <description>VIMS Cache mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPRAM</name>
                  <value>0</value>
                  <description>VIMS GPRAM mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_PWR</name>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RF core power management

This module contains clock control for all RF core sub-modules.</description>
      <registers>
        <register>
          <name>PWMCLKEN</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>RF Core Power Management and Clock Enable</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DEMOD</name>
              <description>[13:13] Enable clock to the Demodulator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD</name>
              <description>[12:12] Enable clock to the Modulator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IQRAM</name>
              <description>[11:11] Enable clock to IQ RAM in coherent demodulator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCTRC</name>
              <description>[10:10] Enable clock to the RF Core Tracer (RFCTRC) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>FSCA</name>
              <description>[9:9] Enable clock to the Frequency Synthesizer Calibration Accelerator (FSCA) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PHA</name>
              <description>[8:8] Enable clock to the Packet Handling Accelerator (PHA) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RAT</name>
              <description>[7:7] Enable clock to the Radio Timer (RAT) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RFERAM</name>
              <description>[6:6] Enable clock to the RF Engine RAM module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RFE</name>
              <description>[5:5] Enable clock to the RF Engine (RFE) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MDMRAM</name>
              <description>[4:4] Enable clock to the Modem RAM module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MDM</name>
              <description>[3:3] Enable clock to the Modem (MDM) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CPERAM</name>
              <description>[2:2] Enable clock to the Command and Packet Engine (CPE) RAM module. As part of RF Core initialization, set this bit together with CPE bit to enable CPE to boot.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CPE</name>
              <description>[1:1] Enable processor clock (hclk) to the Command and Packet Engine (CPE). As part of RF Core initialization, set this bit together with CPERAM bit to enable CPE to boot.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RFC</name>
              <description>[0:0] Enable essential clocks for the RF Core interface. This includes the interconnect, the radio doorbell DBELL command interface, the power management (PWR) clock control module, and bus clock (sclk) for the CPE. To remove possibility of locking yourself out from the RF Core, this bit can not be cleared. If you need to disable all clocks to the RF Core, see the PRCM:RFCCLKG.CLK_EN register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
