CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_RAT</name>
      <baseAddress>0x40043000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RF core radio timer</description>
      <registers>
        <register>
          <name>RATCNT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Radio Timer Counter Value</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNT</name>
              <description>[31:0] Counter value. This is not writable while radio timer counter is enabled.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH0VAL</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Timer Channel 0 Capture/Compare Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH1VAL</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Timer Channel 1 Capture/Compare Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH2VAL</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>Timer Channel 2 Capture/Compare Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH3VAL</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>Timer Channel 3 Capture/Compare Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH4VAL</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Timer Channel 4 Capture/Compare Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH5VAL</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>Timer Channel 5 Capture/Compare Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH6VAL</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>Timer Channel 6 Capture/Compare Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RATCH7VAL</name>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <description>Timer Channel 7 Capture/Compare Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Capture/compare value. Only writable when the channel is configured for compare mode. In compare mode, a write to this register will auto-arm the channel.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
