CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: Input edge detection does not assert AON_PROG2 event
1: Input edge detection asserts AON_PROG2 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>[22:22] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert AON_PROG1 event
1: Input edge detection asserts AON_PROG1 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>[21:21] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert AON_PROG0 event
1: Input edge detection asserts AON_PROG0 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED19</name>
              <description>[20:19] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>[18:18] 0: No interrupt generation
1: Enable interrupt generation for this IO (Only effective if EDGE_DET is enabled)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>[17:16] Enable generation of edge detection events on this IO</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>Positive and negative edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS</name>
                  <value>2</value>
                  <description>Positive edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <value>1</value>
                  <description>Negative edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>No edge detection</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>[15:14] Pull control</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>3</value>
                  <description>No pull</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <value>2</value>
                  <description>Pull up</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWN</name>
                  <value>1</value>
                  <description>Pull down</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>[13:13] 0: Normal slew rate
1: Enables reduced slew rate in output driver.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IOCURR</name>
              <description>[12:11] Selects IO current mode of this IO.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4_8MA</name>
                  <value>2</value>
                  <description>Extended-Current (EC) mode: Min 8 mA for double drive strength IOs (min 4 mA for normal IOs) when IOSTR is set to AUTO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MA</name>
                  <value>1</value>
                  <description>High-Current (HC) mode: Min 4 mA when IOSTR is set to AUTO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MA</name>
                  <value>0</value>
                  <description>Low-Current (LC) mode: Min 2 mA when IOSTR is set to AUTO</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOSTR</name>
              <description>[10:9] Select source for drive strength control of this IO.
This setting controls the drive strength of the Low-Current (LC) mode. Higher drive strength can be selected in IOCURR</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <value>3</value>
                  <description>Maximum drive strength, controlled by AON_IOC:IOSTRMAX (min 2 mA @1.8V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <value>2</value>
                  <description>Medium drive strength, controlled by AON_IOC:IOSTRMED (min 2 mA @2.5V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <value>1</value>
                  <description>Minimum drive strength, controlled by AON_IOC:IOSTRMIN (min 2 mA @3.3V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <value>0</value>
                  <description>Automatic drive strength, controlled by AON BATMON based on battery voltage. (min 2 mA @VDDS)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>[8:8] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert RTC event
1: Input edge detection asserts RTC event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>[6:0] Selects usage for DIO15
Note: This field should not be written other than the times when PORT_ID value is specifically required to change.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C1_MSSCL</name>
                  <value>74</value>
                  <description>I2C1 Clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_MSSDA</name>
                  <value>73</value>
                  <description>I2C1 Data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_RTS</name>
                  <value>72</value>
                  <description>UART3 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_CTS</name>
                  <value>71</value>
                  <description>UART3 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_TX</name>
                  <value>70</value>
                  <description>UART3 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_RX</name>
                  <value>69</value>
                  <description>UART3 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_RTS</name>
                  <value>68</value>
                  <description>UART2 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_CTS</name>
                  <value>67</value>
                  <description>UART2 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_TX</name>
                  <value>66</value>
                  <description>UART2 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_RX</name>
                  <value>65</value>
                  <description>UART2 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_CLK</name>
                  <value>64</value>
                  <description>SPI3 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_CS</name>
                  <value>63</value>
                  <description>SPI3 CS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_TX</name>
                  <value>62</value>
                  <description>SPI3 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_RX</name>
                  <value>61</value>
                  <description>SPI3 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_CLK</name>
                  <value>60</value>
                  <description>SPI2 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_CS</name>
                  <value>59</value>
                  <description>SPI2 CS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_TX</name>
                  <value>58</value>
                  <description>SPI2 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_RX</name>
                  <value>57</value>
                  <description>SPI2 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_CL_IN</name>
                  <value>56</value>
                  <description>RF Core SMI Command Link In</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_CL_OUT</name>
                  <value>55</value>
                  <description>RF Core SMI Command Link Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_DL_IN</name>
                  <value>54</value>
                  <description>RF Core SMI Data Link In</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_DL_OUT</name>
                  <value>53</value>
                  <description>RF Core SMI Data Link Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPI1</name>
                  <value>52</value>
                  <description>RF Core Data In 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPI0</name>
                  <value>51</value>
                  <description>RF Core Data In 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO3</name>
                  <value>50</value>
                  <description>RF Core Data Out 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO2</name>
                  <value>49</value>
                  <description>RF Core Data Out 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO1</name>
                  <value>48</value>
                  <description>RF Core Data Out 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO0</name>
                  <value>47</value>
                  <description>RF Core Data Out 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_TRC</name>
                  <value>46</value>
                  <description>RF Core Trace</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_MCLK</name>
                  <value>41</value>
                  <description>I2S MCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_BCLK</name>
                  <value>40</value>
                  <description>I2S BCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_WCLK</name>
                  <value>39</value>
                  <description>I2S WCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_AD1</name>
                  <value>38</value>
                  <description>I2S Data 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_AD0</name>
                  <value>37</value>
                  <description>I2S Data 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_CLK</name>
                  <value>36</value>
                  <description>SPI1 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_CS</name>
                  <value>35</value>
                  <description>SPI1 CS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_TX</name>
                  <value>34</value>
                  <description>SPI1 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_RX</name>
                  <value>33</value>
                  <description>SPI1 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_SWV</name>
                  <value>32</value>
                  <description>CPU SWV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT7</name>
                  <value>30</value>
                  <description>PORT EVENT 7
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT6</name>
                  <value>29</value>
                  <description>PORT EVENT 6
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT5</name>
                  <value>28</value>
                  <description>PORT EVENT 5
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT4</name>
                  <value>27</value>
                  <description>PORT EVENT 4
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT3</name>
                  <value>26</value>
                  <description>PORT EVENT 3
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT2</name>
                  <value>25</value>
                  <description>PORT EVENT 2
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT1</name>
                  <value>24</value>
                  <description>PORT EVENT 1
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT0</name>
                  <value>23</value>
                  <description>PORT EVENT 0
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <value>22</value>
                  <description>UART1 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <value>21</value>
                  <description>UART1 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TX</name>
                  <value>20</value>
                  <description>UART1 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX</name>
                  <value>19</value>
                  <description>UART1 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <value>18</value>
                  <description>UART0 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <value>17</value>
                  <description>UART0 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX</name>
                  <value>16</value>
                  <description>UART0 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX</name>
                  <value>15</value>
                  <description>UART0 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_MSSCL</name>
                  <value>14</value>
                  <description>I2C0 Clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_MSSDA</name>
                  <value>13</value>
                  <description>I2C0 Data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_CLK</name>
                  <value>12</value>
                  <description>SPI0 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_CS</name>
                  <value>11</value>
                  <description>SPI0 CS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_TX</name>
                  <value>10</value>
                  <description>SPI0 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_RX</name>
                  <value>9</value>
                  <description>SPI0 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_IO</name>
                  <value>8</value>
                  <description>AUX IO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_CLK32K</name>
                  <value>7</value>
                  <description>AON 32 KHz clock (SCLK_LF)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <value>0</value>
                  <description>General Purpose IO</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xC000</resetValue>
        </register>
        <register>
          <name>IOCFG16</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Configuration of DIO16</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>[31:31] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert MCU_WU event
1: Input edge detection asserts MCU_WU event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HYST_EN</name>
              <description>[30:30] 0: Input hysteresis disable
1: Input hysteresis enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>[29:29] 0: Input disabled
1: Input enabled

