CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: Input edge detection does not assert RTC event
1: Input edge detection asserts RTC event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>[6:0] Selects usage for DIO22
Note: This field should not be written other than the times when PORT_ID value is specifically required to change.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C1_MSSCL</name>
                  <value>74</value>
                  <description>I2C1 Clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_MSSDA</name>
                  <value>73</value>
                  <description>I2C1 Data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_RTS</name>
                  <value>72</value>
                  <description>UART3 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_CTS</name>
                  <value>71</value>
                  <description>UART3 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_TX</name>
                  <value>70</value>
                  <description>UART3 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_RX</name>
                  <value>69</value>
                  <description>UART3 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_RTS</name>
                  <value>68</value>
                  <description>UART2 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_CTS</name>
                  <value>67</value>
                  <description>UART2 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_TX</name>
                  <value>66</value>
                  <description>UART2 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_RX</name>
                  <value>65</value>
                  <description>UART2 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_CLK</name>
                  <value>64</value>
                  <description>SPI3 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_CS</name>
                  <value>63</value>
                  <description>SPI3 CS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_TX</name>
                  <value>62</value>
                  <description>SPI3 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_RX</name>
                  <value>61</value>
                  <description>SPI3 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_CLK</name>
                  <value>60</value>
                  <description>SPI2 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_CS</name>
                  <value>59</value>
                  <description>SPI2 CS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_TX</name>
                  <value>58</value>
                  <description>SPI2 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_RX</name>
                  <value>57</value>
                  <description>SPI2 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_CL_IN</name>
                  <value>56</value>
                  <description>RF Core SMI Command Link In</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_CL_OUT</name>
                  <value>55</value>
                  <description>RF Core SMI Command Link Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_DL_IN</name>
                  <value>54</value>
                  <description>RF Core SMI Data Link In</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_DL_OUT</name>
                  <value>53</value>
                  <description>RF Core SMI Data Link Out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPI1</name>
                  <value>52</value>
                  <description>RF Core Data In 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPI0</name>
                  <value>51</value>
                  <description>RF Core Data In 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO3</name>
                  <value>50</value>
                  <description>RF Core Data Out 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO2</name>
                  <value>49</value>
                  <description>RF Core Data Out 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO1</name>
                  <value>48</value>
                  <description>RF Core Data Out 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO0</name>
                  <value>47</value>
                  <description>RF Core Data Out 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_TRC</name>
                  <value>46</value>
                  <description>RF Core Trace</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_MCLK</name>
                  <value>41</value>
                  <description>I2S MCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_BCLK</name>
                  <value>40</value>
                  <description>I2S BCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_WCLK</name>
                  <value>39</value>
                  <description>I2S WCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_AD1</name>
                  <value>38</value>
                  <description>I2S Data 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_AD0</name>
                  <value>37</value>
                  <description>I2S Data 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_CLK</name>
                  <value>36</value>
                  <description>SPI1 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_CS</name>
                  <value>35</value>
                  <description>SPI1 CS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_TX</name>
                  <value>34</value>
                  <description>SPI1 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_RX</name>
                  <value>33</value>
                  <description>SPI1 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_SWV</name>
                  <value>32</value>
                  <description>CPU SWV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT7</name>
                  <value>30</value>
                  <description>PORT EVENT 7
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT6</name>
                  <value>29</value>
                  <description>PORT EVENT 6
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT5</name>
                  <value>28</value>
                  <description>PORT EVENT 5
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT4</name>
                  <value>27</value>
                  <description>PORT EVENT 4
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT3</name>
                  <value>26</value>
                  <description>PORT EVENT 3
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT2</name>
                  <value>25</value>
                  <description>PORT EVENT 2
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT1</name>
                  <value>24</value>
                  <description>PORT EVENT 1
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT0</name>
                  <value>23</value>
                  <description>PORT EVENT 0
Can be used as a general purpose IO event by selecting it through registers in the EVENT module, for example EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, and so on</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <value>22</value>
                  <description>UART1 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <value>21</value>
                  <description>UART1 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TX</name>
                  <value>20</value>
                  <description>UART1 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX</name>
                  <value>19</value>
                  <description>UART1 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <value>18</value>
                  <description>UART0 RTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <value>17</value>
                  <description>UART0 CTS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX</name>
                  <value>16</value>
                  <description>UART0 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX</name>
                  <value>15</value>
                  <description>UART0 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_MSSCL</name>
                  <value>14</value>
                  <description>I2C0 Clock</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_MSSDA</name>
                  <value>13</value>
                  <description>I2C0 Data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_CLK</name>
                  <value>12</value>
                  <description>SPI0 CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_CS</name>
                  <value>11</value>
                  <description>SPI0 CS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_TX</name>
                  <value>10</value>
                  <description>SPI0 TX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_RX</name>
                  <value>9</value>
                  <description>SPI0 RX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_IO</name>
                  <value>8</value>
                  <description>AUX IO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_CLK32K</name>
                  <value>7</value>
                  <description>AON 32 KHz clock (SCLK_LF)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <value>0</value>
                  <description>General Purpose IO</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xC000</resetValue>
        </register>
        <register>
          <name>IOCFG23</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Configuration of DIO23</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>[31:31] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert MCU_WU event
1: Input edge detection asserts MCU_WU event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HYST_EN</name>
              <description>[30:30] 0: Input hysteresis disable
1: Input hysteresis enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>[29:29] 0: Input disabled
1: Input enabled

Note: If IO is configured for AUX   PORT_ID = 0x08, the enable will be ignored.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>[28:27] If DIO is configured GPIO or non-AON peripheral signals,  PORT_ID 0x00 or &gt;0x08:

00: No wake-up
01: No wake-up
10: Wakes up from shutdown if this pad is going low.
11: Wakes up from shutdown if this pad is going high.

If IO is configured for AON peripheral signals or AUX   PORT_ID 0x01-0x08, this register only sets wakeup enable or not.

00, 01: Wakeup disabled
10, 11: Wakeup enabled

Polarity is controlled from AON registers.

Note:When the MSB is set, the IOC will deactivate the output enable for the DIO.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMODE</name>
              <description>[26:24] IO Mode
Not applicable for IO configured for AON periph. signals and AUX   PORT_ID 0x01-0x08
AUX has its own open_source/drain configuration.

0x2: Reserved. Undefined behavior.
0x3: Reserved. Undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPENSRC_INV</name>
                  <value>7</value>
                  <description>Open Source
Inverted input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENSRC</name>
                  <value>6</value>
                  <description>Open Source
Normal input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDR_INV</name>
                  <value>5</value>
                  <description>Open Drain
Inverted input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDR</name>
                  <value>4</value>
                  <description>Open Drain,
Normal input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <value>1</value>
                  <description>Inverted input / ouput</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <value>0</value>
                  <description>Normal input / output</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>[23:23] Event asserted by this IO when edge detection is enabled

