CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Note:When the MSB is set, the IOC will deactivate the output enable for the DIO.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMODE</name>
              <description>[26:24] IO Mode
Not applicable for IO configured for AON periph. signals and AUX   PORT_ID 0x01-0x08
AUX has its own open_source/drain configuration.

0x2: Reserved. Undefined behavior.
0x3: Reserved. Undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPENSRC_INV</name>
                  <value>7</value>
                  <description>Open Source
Inverted input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENSRC</name>
                  <value>6</value>
                  <description>Open Source
Normal input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDR_INV</name>
                  <value>5</value>
                  <description>Open Drain
Inverted input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDR</name>
                  <value>4</value>
                  <description>Open Drain,
Normal input / output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <value>1</value>
                  <description>Inverted input / ouput</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <value>0</value>
                  <description>Normal input / output</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>[23:23] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert AON_PROG2 event
1: Input edge detection asserts AON_PROG2 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>[22:22] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert AON_PROG1 event
1: Input edge detection asserts AON_PROG1 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>[21:21] Event asserted by this IO when edge detection is enabled

0: Input edge detection does not assert AON_PROG0 event
1: Input edge detection asserts AON_PROG0 event</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED19</name>
              <description>[20:19] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>[18:18] 0: No interrupt generation
1: Enable interrupt generation for this IO (Only effective if EDGE_DET is enabled)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>[17:16] Enable generation of edge detection events on this IO</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>Positive and negative edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS</name>
                  <value>2</value>
                  <description>Positive edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <value>1</value>
                  <description>Negative edge detection</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>No edge detection</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>[15:14] Pull control</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>3</value>
                  <description>No pull</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <value>2</value>
                  <description>Pull up</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWN</name>
                  <value>1</value>
                  <description>Pull down</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>[13:13] 0: Normal slew rate
1: Enables reduced slew rate in output driver.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>IOCURR</name>
              <description>[12:11] Selects IO current mode of this IO.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4_8MA</name>
                  <value>2</value>
                  <description>Extended-Current (EC) mode: Min 8 mA for double drive strength IOs (min 4 mA for normal IOs) when IOSTR is set to AUTO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MA</name>
                  <value>1</value>
                  <description>High-Current (HC) mode: Min 4 mA when IOSTR is set to AUTO</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MA</name>
                  <value>0</value>
                  <description>Low-Current (LC) mode: Min 2 mA when IOSTR is set to AUTO</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOSTR</name>
              <description>[10:9] Select source for drive strength control of this IO.
This setting controls the drive strength of the Low-Current (LC) mode. Higher drive strength can be selected in IOCURR</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <value>3</value>
                  <description>Maximum drive strength, controlled by AON_IOC:IOSTRMAX (min 2 mA @1.8V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <value>2</value>
                  <description>Medium drive strength, controlled by AON_IOC:IOSTRMED (min 2 mA @2.5V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <value>1</value>
                  <description>Minimum drive strength, controlled by AON_IOC:IOSTRMIN (min 2 mA @3.3V with default values)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <value>0</value>
                  <description>Automatic drive strength, controlled by AON BATMON based on battery voltage. (min 2 mA @VDDS)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>[8:8] Event asserted by this IO when edge detection is enabled

