CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>CPUIRQSEL31</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 31</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>106</value>
                  <description>AUX Compare A event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x6A</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL32</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 32</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <value>115</value>
                  <description>AUX ADC interrupt event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_IRQ. Status flags are found here AUX_EVCTL:EVTOMCUFLAGS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x73</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL33</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 33</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRNG_IRQ</name>
                  <value>104</value>
                  <description>TRNG Interrupt event, controlled by TRNG:IRQEN.EN</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x68</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL34</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 34</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_COMB</name>
                  <value>6</value>
                  <description>Combined event from Oscillator control</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x6</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL35</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 35</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>56</value>
                  <description>AUX Timer2 event 0, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x38</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL36</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 36</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1_COMB</name>
                  <value>37</value>
                  <description>UART1 combined interrupt, interrupt flags are found here UART1:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x25</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL37</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 37</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BATMON_COMB</name>
                  <value>5</value>
                  <description>Combined event from battery monitor</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x5</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL38</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 38</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI2_COMB</name>
                  <value>122</value>
                  <description>SPI2 combined interrupt, interrupt flags are found here SPI2:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7A</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL39</name>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 39</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3_COMB</name>
                  <value>123</value>
                  <description>SPI3 combined interrupt, interrupt flags are found here SPI3:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7B</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL40</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 40</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART2_COMB</name>
                  <value>124</value>
                  <description>UART2 combined interrupt, interrupt flags are found here UART2:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7C</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL41</name>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 41</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART3_COMB</name>
                  <value>125</value>
                  <description>UART3 combined interrupt, interrupt flags are found here UART3:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7D</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL42</name>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 42</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C1_IRQ</name>
                  <value>126</value>
                  <description>Interrupt event from I2C1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7E</resetValue>
        </register>
        <register>
          <name>RFCSEL0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT0A_CMP</name>
                  <value>61</value>
                  <description>GPT0A compare event. Configured by GPT0:TAMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3D</resetValue>
        </register>
        <register>
          <name>RFCSEL1</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT0B_CMP</name>
                  <value>62</value>
                  <description>GPT0B compare event. Configured by GPT0:TBMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3E</resetValue>
        </register>
        <register>
          <name>RFCSEL2</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 2</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT1A_CMP</name>
                  <value>63</value>
                  <description>GPT1A compare event. Configured by GPT1:TAMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3F</resetValue>
        </register>
        <register>
          <name>RFCSEL3</name>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 3</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT1B_CMP</name>
                  <value>64</value>
                  <description>GPT1B compare event. Configured by GPT1:TBMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x40</resetValue>
        </register>
        <register>
          <name>RFCSEL4</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 4</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT2A_CMP</name>
                  <value>65</value>
                  <description>GPT2A compare event. Configured by GPT2:TAMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x41</resetValue>
        </register>
        <register>
          <name>RFCSEL5</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 5</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT2B_CMP</name>
                  <value>66</value>
                  <description>GPT2B compare event. Configured by GPT2:TBMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x42</resetValue>
        </register>
