CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>UDMACH4SSEL</name>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 4 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI0_TX_DMASREQ</name>
                  <value>43</value>
                  <description>SPI0 TX DMA single request, controlled by SPI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2B</resetValue>
        </register>
        <register>
          <name>UDMACH4BSEL</name>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 4 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI0_TX_DMABREQ</name>
                  <value>42</value>
                  <description>SPI0 TX DMA burst request , controlled by SPI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2A</resetValue>
        </register>
        <register>
          <name>UDMACH5SSEL</name>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 5 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1_RX_DMASREQ</name>
                  <value>53</value>
                  <description>UART1 RX DMA single request, controlled by UART1:DMACTL.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x35</resetValue>
        </register>
        <register>
          <name>UDMACH5BSEL</name>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 5 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1_RX_DMABREQ</name>
                  <value>52</value>
                  <description>UART1 RX DMA burst request, controlled by UART1:DMACTL.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x34</resetValue>
        </register>
        <register>
          <name>UDMACH6SSEL</name>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 6 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1_TX_DMASREQ</name>
                  <value>55</value>
                  <description>UART1 TX DMA single request, controlled by UART1:DMACTL.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x37</resetValue>
        </register>
        <register>
          <name>UDMACH6BSEL</name>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 6 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1_TX_DMABREQ</name>
                  <value>54</value>
                  <description>UART1 TX DMA burst request, controlled by UART1:DMACTL.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x36</resetValue>
        </register>
        <register>
          <name>UDMACH7SSEL</name>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 7 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_DMASREQ</name>
                  <value>117</value>
                  <description>DMA single request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x75</resetValue>
        </register>
        <register>
          <name>UDMACH7BSEL</name>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 7 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_DMABREQ</name>
                  <value>118</value>
                  <description>DMA burst request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x76</resetValue>
        </register>
        <register>
          <name>UDMACH8SSEL</name>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 8 SREQ

Single request is ignored for this channel</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <value>116</value>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x74</resetValue>
        </register>
        <register>
          <name>UDMACH8BSEL</name>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 8 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <value>116</value>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x74</resetValue>
        </register>
        <register>
          <name>UDMACH9SSEL</name>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 9 SREQ

