CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART3_TX_DMASREQ</name>
                  <value>142</value>
                  <description>UART3 TX DMA single request, controlled by UART3:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_TX_DMABREQ</name>
                  <value>141</value>
                  <description>UART3 TX DMA burst request, controlled by UART3:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_RX_DMASREQ</name>
                  <value>140</value>
                  <description>UART3 RX DMA single request, controlled by UART3:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_RX_DMABREQ</name>
                  <value>139</value>
                  <description>UART3 RX DMA burst request, controlled by UART3:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_TX_DMASREQ</name>
                  <value>138</value>
                  <description>UART2 TX DMA single request, controlled by UART2:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_TX_DMABREQ</name>
                  <value>137</value>
                  <description>UART2 TX DMA burst request, controlled by UART2:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_RX_DMASREQ</name>
                  <value>136</value>
                  <description>UART2 RX DMA single request, controlled by UART2:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_RX_DMABREQ</name>
                  <value>135</value>
                  <description>UART2 RX DMA burst request, controlled by UART2:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_TX_DMASREQ</name>
                  <value>134</value>
                  <description>SPI3 TX DMA single request, controlled by SPI2:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_TX_DMABREQ</name>
                  <value>133</value>
                  <description>SPI3 TX DMA burst request , controlled by SPI2:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_RX_DMASREQ</name>
                  <value>132</value>
                  <description>SPI3 RX DMA single request, controlled by SPI2:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_RX_DMABREQ</name>
                  <value>131</value>
                  <description>SPI3 RX DMA burst request , controlled by SPI2:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_TX_DMASREQ</name>
                  <value>130</value>
                  <description>SPI2 TX DMA single request, controlled by SPI2:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_TX_DMABREQ</name>
                  <value>129</value>
                  <description>SPI2 TX DMA burst request , controlled by SPI2:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_RX_DMASREQ</name>
                  <value>128</value>
                  <description>SPI2 RX DMA single request, controlled by SPI2:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_RX_DMABREQ</name>
                  <value>127</value>
                  <description>SPI2 RX DMA burst request , controlled by SPI2:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_IRQ</name>
                  <value>126</value>
                  <description>Interrupt event from I2C1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3_COMB</name>
                  <value>125</value>
                  <description>UART3 combined interrupt, interrupt flags are found here UART3:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_COMB</name>
                  <value>124</value>
                  <description>UART2 combined interrupt, interrupt flags are found here UART2:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI3_COMB</name>
                  <value>123</value>
                  <description>SPI3 combined interrupt, interrupt flags are found here SPI3:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_COMB</name>
                  <value>122</value>
                  <description>SPI2 combined interrupt, interrupt flags are found here SPI2:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_HALTED</name>
                  <value>120</value>
                  <description>CPU halted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_UPD</name>
                  <value>119</value>
                  <description>RTC periodic event controlled by AON_RTC:CTL.RTC_UPD_EN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_DMABREQ</name>
                  <value>118</value>
                  <description>DMA burst request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_DMASREQ</name>
                  <value>117</value>
                  <description>DMA single request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <value>116</value>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <value>115</value>
                  <description>AUX ADC interrupt event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_IRQ. Status flags are found here AUX_EVCTL:EVTOMCUFLAGS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_OBSMUX0</name>
                  <value>114</value>
                  <description>Loopback of OBSMUX0 through AUX, corresponds to AUX_EVCTL:EVTOMCUFLAGS.MCU_OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <value>113</value>
                  <description>AUX ADC FIFO watermark event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>112</value>
                  <description>AUX ADC done, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <value>111</value>
                  <description>Autotake event from AUX semaphore, configured by AUX_SMPH:AUTOTAKE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>110</value>
                  <description>AUX timer 1 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>109</value>
                  <description>AUX timer 0 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>108</value>
                  <description>AUX TDC measurement done event, corresponds to the flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>107</value>
                  <description>AUX Compare B event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>106</value>
                  <description>AUX Compare A event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_AON_WU_EV</name>
                  <value>105</value>
                  <description>AON wakeup event, the corresponding flag is here AUX_EVCTL:EVTOMCUFLAGS.AUX_WU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG_IRQ</name>
                  <value>104</value>
                  <description>TRNG Interrupt event, controlled by TRNG:IRQEN.EN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV3</name>
                  <value>103</value>
                  <description>Software event 3, triggered by SWEV.SWEV3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV2</name>
                  <value>102</value>
                  <description>Software event 2, triggered by SWEV.SWEV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <value>101</value>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <value>100</value>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_NMI</name>
                  <value>99</value>
                  <description>Watchdog non maskable interrupt event, controlled by WDT:CTL.INTTYPE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO_DMA_DONE_IRQ</name>
                  <value>94</value>
                  <description>CRYPTO DMA input done event, the correspondingg flag is CRYPTO:IRQSTAT.DMA_IN_DONE. Controlled by CRYPTO:IRQEN.DMA_IN_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO_RESULT_AVAIL_IRQ</name>
                  <value>93</value>
                  <description>CRYPTO result available interupt event, the corresponding flag is found here CRYPTO:IRQSTAT.RESULT_AVAIL. Controlled by CRYPTO:IRQSTAT.RESULT_AVAIL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT7</name>
                  <value>92</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT7 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT6</name>
                  <value>91</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT6 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT5</name>
                  <value>90</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT4 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT4</name>
                  <value>89</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT4 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT3</name>
                  <value>88</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT3 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT2</name>
                  <value>87</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT2 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT1</name>
                  <value>86</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT1 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT0</name>
                  <value>85</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT0 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_CMP</name>
                  <value>68</value>
                  <description>GPT3B compare event. Configured by GPT3:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_CMP</name>
                  <value>67</value>
                  <description>GPT3A compare event. Configured by GPT3:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_CMP</name>
                  <value>66</value>
                  <description>GPT2B compare event. Configured by GPT2:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_CMP</name>
                  <value>65</value>
                  <description>GPT2A compare event. Configured by GPT2:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_CMP</name>
                  <value>64</value>
                  <description>GPT1B compare event. Configured by GPT1:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_CMP</name>
                  <value>63</value>
                  <description>GPT1A compare event. Configured by GPT1:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_CMP</name>
                  <value>62</value>
                  <description>GPT0B compare event. Configured by GPT0:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_CMP</name>
                  <value>61</value>
                  <description>GPT0A compare event. Configured by GPT0:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>60</value>
                  <description>AUX Timer2 pulse, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_PULSE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>59</value>
                  <description>AUX Timer2 event 3, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>58</value>
                  <description>AUX Timer2 event 2, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>57</value>
                  <description>AUX Timer2 event 1, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>56</value>
                  <description>AUX Timer2 event 0, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TX_DMASREQ</name>
                  <value>55</value>
                  <description>UART1 TX DMA single request, controlled by UART1:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TX_DMABREQ</name>
                  <value>54</value>
                  <description>UART1 TX DMA burst request, controlled by UART1:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX_DMASREQ</name>
                  <value>53</value>
                  <description>UART1 RX DMA single request, controlled by UART1:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX_DMABREQ</name>
                  <value>52</value>
                  <description>UART1 RX DMA burst request, controlled by UART1:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX_DMASREQ</name>
                  <value>51</value>
                  <description>UART0 TX DMA single request, controlled by UART0:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX_DMABREQ</name>
                  <value>50</value>
                  <description>UART0 TX DMA burst request, controlled by UART0:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX_DMASREQ</name>
                  <value>49</value>
                  <description>UART0 RX DMA single request, controlled by UART0:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX_DMABREQ</name>
                  <value>48</value>
                  <description>UART0 RX DMA burst request, controlled by UART0:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_TX_DMASREQ</name>
                  <value>47</value>
                  <description>SPI1 TX DMA single request, controlled by SPI0:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_TX_DMABREQ</name>
                  <value>46</value>
                  <description>SPI1 TX DMA burst request , controlled by SPI0:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_RX_DMASREQ</name>
                  <value>45</value>
                  <description>SPI1 RX DMA single request, controlled by SPI0:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_RX_DMABREQ</name>
                  <value>44</value>
                  <description>SPI1 RX DMA burst request , controlled by SPI0:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_TX_DMASREQ</name>
                  <value>43</value>
                  <description>SPI0 TX DMA single request, controlled by SPI0:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_TX_DMABREQ</name>
                  <value>42</value>
                  <description>SPI0 TX DMA burst request , controlled by SPI0:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_RX_DMASREQ</name>
                  <value>41</value>
