CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
                  <description>SPI0 RX DMA single request, controlled by SPI0:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_RX_DMABREQ</name>
                  <value>40</value>
                  <description>SPI0 RX DMA burst request , controlled by SPI0:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DONE_COMB</name>
                  <value>39</value>
                  <description>Combined DMA done, corresponding flags are here UDMA0:REQDONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_ERR</name>
                  <value>38</value>
                  <description>DMA bus error, corresponds to UDMA0:ERROR.STATUS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_COMB</name>
                  <value>37</value>
                  <description>UART1 combined interrupt, interrupt flags are found here UART1:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_COMB</name>
                  <value>36</value>
                  <description>UART0 combined interrupt, interrupt flags are found here UART0:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_COMB</name>
                  <value>35</value>
                  <description>SPI1 combined interrupt, interrupt flags are found here SPI1:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_COMB</name>
                  <value>34</value>
                  <description>SPI0 combined interrupt, interrupt flags are found here SPI0:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKA_IRQ</name>
                  <value>31</value>
                  <description>PKA Interrupt event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CPE_1</name>
                  <value>30</value>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV1</name>
                  <value>29</value>
                  <description>AUX software event 1, triggered by AUX_EVCTL:SWEVSET.SWEV1, also available as AUX_EVENT2 AON wake up event.
MCU domain wakeup control AON_EVENT:MCUWUSEL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CPE_0</name>
                  <value>27</value>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_HW_COMB</name>
                  <value>26</value>
                  <description>Combined RFC hardware interrupt, corresponding flag is here RFC_DBELL:RFHWIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CMD_ACK</name>
                  <value>25</value>
                  <description>RFC Doorbell Command Acknowledgement Interrupt, equvialent to RFC_DBELL:RFACKIFG.ACKFLAG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_IRQ</name>
                  <value>24</value>
                  <description>Watchdog interrupt event, controlled by WDT:CTL.INTEN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_CH18_DONE</name>
                  <value>22</value>
                  <description>DMA done for software tiggered UDMA channel 18, see UDMA0:SOFTREQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH</name>
                  <value>21</value>
                  <description>FLASH controller error event,  the status flags are FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_CH0_DONE</name>
                  <value>20</value>
                  <description>DMA done for software tiggered UDMA channel 0, see UDMA0:SOFTREQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B</name>
                  <value>19</value>
                  <description>GPT1B interrupt event, controlled by GPT1:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A</name>
                  <value>18</value>
                  <description>GPT1A interrupt event, controlled by GPT1:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B</name>
                  <value>17</value>
                  <description>GPT0B interrupt event, controlled by GPT0:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A</name>
                  <value>16</value>
                  <description>GPT0A interrupt event, controlled by GPT0:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B</name>
                  <value>15</value>
                  <description>GPT3B interrupt event, controlled by GPT3:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A</name>
                  <value>14</value>
                  <description>GPT3A interrupt event, controlled by GPT3:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B</name>
                  <value>13</value>
                  <description>GPT2B interrupt event, controlled by GPT2:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A</name>
                  <value>12</value>
                  <description>GPT2A interrupt event, controlled by GPT2:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMB</name>
                  <value>11</value>
                  <description>AUX combined event, the corresponding flag register is here AUX_EVCTL:EVTOMCUFLAGS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_AUX_SWEV0</name>
                  <value>10</value>
                  <description>AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_IRQ</name>
                  <value>9</value>
                  <description>Interrupt event from I2C</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_IRQ</name>
                  <value>8</value>
                  <description>Interrupt event from I2S</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_COMB</name>
                  <value>6</value>
                  <description>Combined event from Oscillator control</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_COMB</name>
                  <value>5</value>
                  <description>Combined event from battery monitor</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_GPIO_EDGE</name>
                  <value>4</value>
                  <description>Edge detect event from IOC. Configureded by the IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET settings</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG2</name>
                  <value>3</value>
                  <description>AON programmable event 2. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG2_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG1</name>
                  <value>2</value>
                  <description>AON programmable event 1. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG0</name>
                  <value>1</value>
                  <description>AON programmable event 0. Event selected by AON_EVENT  MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>UDMACH15SSEL</name>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7</resetValue>
        </register>
        <register>
          <name>UDMACH15BSEL</name>
          <addressOffset>0x57c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 15 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7</resetValue>
        </register>
        <register>
          <name>UDMACH16SSEL</name>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 16 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI1_RX_DMASREQ</name>
                  <value>45</value>
                  <description>SPI1 RX DMA single request, controlled by SPI0:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2D</resetValue>
        </register>
        <register>
          <name>UDMACH16BSEL</name>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 16 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI1_RX_DMABREQ</name>
                  <value>44</value>
                  <description>SPI1 RX DMA burst request , controlled by SPI0:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2C</resetValue>
        </register>
        <register>
          <name>UDMACH17SSEL</name>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 17 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI1_TX_DMASREQ</name>
                  <value>47</value>
                  <description>SPI1 TX DMA single request, controlled by SPI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2F</resetValue>
        </register>
        <register>
          <name>UDMACH17BSEL</name>
          <addressOffset>0x58c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 17 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI1_TX_DMABREQ</name>
                  <value>46</value>
                  <description>SPI1 TX DMA burst request , controlled by SPI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2E</resetValue>
        </register>
        <register>
          <name>UDMACH18SSEL</name>
          <addressOffset>0x590</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH18BSEL</name>
          <addressOffset>0x594</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH19SSEL</name>
          <addressOffset>0x598</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 19 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI2_RX_DMASREQ</name>
                  <value>128</value>
                  <description>SPI2 RX DMA single request, controlled by SPI2:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x80</resetValue>
        </register>
        <register>
          <name>UDMACH19BSEL</name>
          <addressOffset>0x59c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 19 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI2_RX_DMABREQ</name>
                  <value>127</value>
                  <description>SPI2 RX DMA burst request , controlled by SPI2:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7F</resetValue>
        </register>
        <register>
          <name>UDMACH20SSEL</name>
          <addressOffset>0x5a0</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 20 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI2_TX_DMASREQ</name>
                  <value>130</value>
                  <description>SPI2 TX DMA single request, controlled by SPI2:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x82</resetValue>
        </register>
