CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>UDMACH20BSEL</name>
          <addressOffset>0x5a4</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 20 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI2_TX_DMABREQ</name>
                  <value>129</value>
                  <description>SPI2 TX DMA burst request , controlled by SPI2:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x81</resetValue>
        </register>
        <register>
          <name>UDMACH21SSEL</name>
          <addressOffset>0x5a8</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 21 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <value>100</value>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x64</resetValue>
        </register>
        <register>
          <name>UDMACH21BSEL</name>
          <addressOffset>0x5ac</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 21 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <value>100</value>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x64</resetValue>
        </register>
        <register>
          <name>UDMACH22SSEL</name>
          <addressOffset>0x5b0</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 22 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <value>101</value>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x65</resetValue>
        </register>
        <register>
          <name>UDMACH22BSEL</name>
          <addressOffset>0x5b4</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 22 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <value>101</value>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x65</resetValue>
        </register>
        <register>
          <name>UDMACH23SSEL</name>
          <addressOffset>0x5b8</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 23 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV2</name>
                  <value>102</value>
                  <description>Software event 2, triggered by SWEV.SWEV2</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x66</resetValue>
        </register>
        <register>
          <name>UDMACH23BSEL</name>
          <addressOffset>0x5bc</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 23 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV2</name>
                  <value>102</value>
                  <description>Software event 2, triggered by SWEV.SWEV2</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x66</resetValue>
        </register>
        <register>
          <name>UDMACH24SSEL</name>
          <addressOffset>0x5c0</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 24 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV3</name>
                  <value>103</value>
                  <description>Software event 3, triggered by SWEV.SWEV3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x67</resetValue>
        </register>
        <register>
          <name>UDMACH24BSEL</name>
          <addressOffset>0x5c4</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 24 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV3</name>
                  <value>103</value>
                  <description>Software event 3, triggered by SWEV.SWEV3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x67</resetValue>
        </register>
        <register>
          <name>UDMACH25SSEL</name>
          <addressOffset>0x5c8</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 25 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3_RX_DMASREQ</name>
                  <value>132</value>
                  <description>SPI3 RX DMA single request, controlled by SPI2:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x84</resetValue>
        </register>
        <register>
          <name>UDMACH25BSEL</name>
          <addressOffset>0x5cc</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 25 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3_RX_DMABREQ</name>
                  <value>131</value>
                  <description>SPI3 RX DMA burst request , controlled by SPI2:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x83</resetValue>
        </register>
        <register>
          <name>UDMACH26SSEL</name>
          <addressOffset>0x5d0</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 26 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3_TX_DMASREQ</name>
                  <value>134</value>
                  <description>SPI3 TX DMA single request, controlled by SPI2:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x86</resetValue>
        </register>
        <register>
          <name>UDMACH26BSEL</name>
          <addressOffset>0x5d4</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 26 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3_TX_DMABREQ</name>
                  <value>133</value>
                  <description>SPI3 TX DMA burst request , controlled by SPI2:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x85</resetValue>
        </register>
        <register>
          <name>UDMACH27SSEL</name>
          <addressOffset>0x5d8</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH27BSEL</name>
          <addressOffset>0x5dc</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH28SSEL</name>
          <addressOffset>0x5e0</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 28 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART2_RX_DMASREQ</name>
                  <value>136</value>
                  <description>UART2 RX DMA single request, controlled by UART2:DMACTL.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x88</resetValue>
        </register>
        <register>
          <name>UDMACH28BSEL</name>
          <addressOffset>0x5e4</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 28 REQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART2_RX_DMABREQ</name>
                  <value>135</value>
                  <description>UART2 RX DMA burst request, controlled by UART2:DMACTL.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x87</resetValue>
        </register>
        <register>
          <name>UDMACH29SSEL</name>
          <addressOffset>0x5e8</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 29 SREQ</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>[7:0] Read only selection value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART2_TX_DMASREQ</name>
                  <value>138</value>
                  <description>UART2 TX DMA single request, controlled by UART2:DMACTL.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x8A</resetValue>
        </register>
