CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>SWEV</name>
          <addressOffset>0xf00</addressOffset>
          <size>32</size>
          <description>Set or Clear Software Events</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SWEV3</name>
              <description>[24:24] Writing "1" to this bit when the value is "0" triggers the Software 3 event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SWEV2</name>
              <description>[16:16] Writing "1" to this bit when the value is "0" triggers the Software 2 event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SWEV1</name>
              <description>[8:8] Writing "1" to this bit when the value is "0" triggers the Software 1 event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SWEV0</name>
              <description>[0:0] Writing "1" to this bit when the value is "0" triggers the Software 0 event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SMPH</name>
      <baseAddress>0x40084000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>MCU Semaphore Module

This module provides 32 binary semaphores. The state of a binary semaphore is either taken or available.

A semaphore does not implement any ownership attribute. Still, a semaphore can be used to handle mutual exclusion scenarios.</description>
      <registers>
        <register>
          <name>SMPH0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH2</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 2</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH3</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 3</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH4</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 4</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH5</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 5</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH6</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 6</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH7</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 7</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH8</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 8</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH9</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 9</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH10</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 10</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH11</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 11</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH12</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 12</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH13</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 13</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH14</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 14</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH15</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 15</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH16</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 16</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH17</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 17</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
