CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK8</name>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 8 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK9</name>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 9 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK10</name>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 10 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK11</name>
          <addressOffset>0x82c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 11 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK12</name>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 12 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK13</name>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 13 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK14</name>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 14 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK15</name>
          <addressOffset>0x83c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 15 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK16</name>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 16 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK17</name>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 17 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK18</name>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 18 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK19</name>
          <addressOffset>0x84c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 19 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK20</name>
          <addressOffset>0x850</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 20 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK21</name>
          <addressOffset>0x854</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 21 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK22</name>
          <addressOffset>0x858</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 22 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK23</name>
          <addressOffset>0x85c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 23 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK24</name>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 24 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK25</name>
          <addressOffset>0x864</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 25 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK26</name>
          <addressOffset>0x868</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 26 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK27</name>
          <addressOffset>0x86c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 27 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PEEK28</name>
          <addressOffset>0x870</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 28 ALIAS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
