CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Write DATA to start transfer, MSB first. When transfer completes, MOSI stays at the value of LSB.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TX16</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Transmit 16 Bit

Write operation stalls until current transfer completes.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>[15:0] 16 bit data transfer.

Write DATA to start transfer, MSB first. When transfer completes, MOSI stays at the value of LSB.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RX8</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Receive 8 Bit

Read operation stalls until current transfer completes.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>[7:0] Latest 8 bits received on MISO.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RX16</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Receive 16 Bit

Read operation stalls until current transfer completes.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>[15:0] Latest 16 bits received on MISO.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SCLKIDLE</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>SCLK Idle

Read operation stalls until SCLK is idle with no remaining clock edges.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Wait for SCLK idle.

Read operation stalls until SCLK is idle with no remaining clock edges. Read then returns 1.

AUX_SCE can use this to control CS deassertion.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>DATAIDLE</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Data Idle

Read operation stalls until current transfer completes.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Wait for data idle.

Read operation stalls until the SCLK period associated with LSB transmission completes. Read then returns 1.

AUX_SCE can use this to control CS deassertion.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_MAC</name>
      <baseAddress>0x400C2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>The AUX Multiply-Accumulate (AUX_MAC) peripheral enables AUX_SCE with power-efficient and flexible mathematical operations:
- 2's complement signed and unsigned sequential multiplication (MUL) with optional accumulation of the result (MAC).
- 16 or 32-bit 2's complement signed and unsigned addition of configurable term and accumulator (ADD).
- Results of ADD, MUL and MAC operations are always stored in the accumulator (ACC).

