CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Software can easily:
- Access arbitrary 16-bit slice of the 40-bit accumulator.
- Find the number of leading zero or sign bits.
- Perform shift operations on the accumulator.

AUX_SCE must set AUX_SYSIF:PEROPRATE.MAC_OP_RATE to SCE_RATE to access and use AUX_MAC. System CPU must set AUX_SYSIF:PEROPRATE.MAC_OP_RATE to BUS_RATE to access and use AUX_MAC. This guarantees constant execution times for ADD, MUL, and MAC operations.

The ADD operation requires a single peripheral clock cycle to finish. MUL and MAC operations require four peripheral clock periods to finish. An unfinished ADD, MUL, or MAC operation stalls register access to this peripheral. AUX_SCE becomes clock gated if it encounters a bus stall. Software can use this to reduce power consumption during back to back accesses.

Only full word access is supported by the peripheral. An attempt to write a single byte will have no effect.</description>
      <registers>
        <register>
          <name>OP0S</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Signed Operand 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP0_VALUE</name>
              <description>[15:0] Signed operand 0.

Operand for multiply, multiply-and-accumulate, or 32-bit add operations.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP0U</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Unsigned Operand 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP0_VALUE</name>
              <description>[15:0] Unsigned operand 0.

Operand for multiply, multiply-and-accumulate, or 32-bit add operations.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP1SMUL</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Signed Operand 1 and Multiply</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP1_VALUE</name>
              <description>[15:0] Signed operand 1 and multiplication trigger.

Write OP1_VALUE to set signed operand 1 and trigger the following operation:

When operand 0 was written to OP0S.OP0_VALUE: ACC = OP1_VALUE * OP0S.OP0_VALUE.
When operand 0 was written to OP0U.OP0_VALUE: ACC = OP1_VALUE * OP0U.OP0_VALUE.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP1UMUL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Unsigned Operand 1 and Multiply</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP1_VALUE</name>
              <description>[15:0] Unsigned operand 1 and multiplication trigger.

Write OP1_VALUE to set unsigned operand 1 and trigger the following operation:

When operand 0 was written to OP0S.OP0_VALUE: ACC = OP1_VALUE * OP0S.OP0_VALUE.
When operand 0 was written to OP0U.OP0_VALUE: ACC = OP1_VALUE * OP0U.OP0_VALUE.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP1SMAC</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Signed Operand 1 and Multiply-Accumulate</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP1_VALUE</name>
              <description>[15:0] Signed operand 1 and multiply-accumulation trigger.

Write OP1_VALUE to set signed operand 1 and trigger the following operation:

When operand 0 was written to OP0S.OP0_VALUE:  ACC = ACC + ( OP1_VALUE * OP0S.OP0_VALUE ).
When operand 0 was written to OP0U.OP0_VALUE:  ACC = ACC + ( OP1_VALUE * OP0U.OP0_VALUE ).</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP1UMAC</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Unsigned Operand 1 and Multiply-Accumulate</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP1_VALUE</name>
              <description>[15:0] Unsigned operand 1 and multiply-accumulation trigger.

Write OP1_VALUE to set unsigned operand 1 and trigger the following operation:

When operand 0 was written to OP0S.OP0_VALUE:  ACC = ACC + ( OP1_VALUE * OP0S.OP0_VALUE ).
When operand 0 was written to OP0U.OP0_VALUE:  ACC = ACC + ( OP1_VALUE * OP0U.OP0_VALUE ).</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP1SADD16</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Signed Operand 1 and 16-bit Addition</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP1_VALUE</name>
              <description>[15:0] Signed operand 1 and 16-bit addition trigger.

Write OP1_VALUE to set signed operand 1 and trigger the following operation:

ACC = ACC + OP1_VALUE.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP1UADD16</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Unsigned Operand 1 and 16-bit Addition</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP1_VALUE</name>
              <description>[15:0] Unsigned operand 1 and 16-bit addition trigger.

Write OP1_VALUE to set unsigned operand 1 and trigger the following operation:

ACC = ACC + OP1_VALUE.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP1SADD32</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Signed Operand 1 and 32-bit Addition</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OP1_VALUE</name>
              <description>[15:0] Upper half of signed 32-bit operand and addition trigger.

