CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Write VALUE to initialize bits 39:32 of accumulator.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_TIMER2</name>
      <baseAddress>0x400C3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Timer2 (AUX_TIMER2) offers flexible:
- generation of waveforms and events.
- capture of signal period and duty cycle.
- generation of single clock pulse.

It consists of a:
- 16-bit counter.
- 4 capture compare channels.
- 4 event outputs, which are mapped to AUX event bus, see EVCTL.

Each channel subscribes to the asynchronous AUX event bus. They can control one or more event outputs in both capture and compare modes.  AUX_SYSIF:TIMER2CLKCTL.SRC selects clock source for the timer.</description>
      <registers>
        <register>
          <name>CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Timer Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_RESET</name>
              <description>[6:6] Channel 3 reset.

0: No effect.
1: Reset CH3CC, CH3PCC, CH3EVCFG, and CH3CCFG.

Read returns 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_RESET</name>
              <description>[5:5] Channel 2 reset.

0: No effect.
1: Reset CH2CC, CH2PCC, CH2EVCFG, and CH2CCFG.

Read returns 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_RESET</name>
              <description>[4:4] Channel 1 reset.

0: No effect.
1: Reset CH1CC, CH1PCC, CH1EVCFG, and CH1CCFG.

Read returns 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_RESET</name>
              <description>[3:3] Channel 0 reset.

0: No effect.
1: Reset CH0CC, CH0PCC, CH0EVCFG, and CH0CCFG.

Read returns 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET_EN</name>
              <description>[2:2] Select counter target value.

You must select TARGET to use shadow target functionality.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TARGET</name>
                  <value>1</value>
                  <description>TARGET.VALUE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTR_MAX</name>
                  <value>0</value>
                  <description>65535</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:0] Timer mode control.

The timer restarts from 0 when you set MODE to UP_ONCE, UP_PER, or UPDWN_PER.

When you write MODE all internally queued updates to [CHnCC.*] and TARGET clear.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UPDWN_PER</name>
                  <value>3</value>
                  <description>Count up and down periodically. The timer counts from 0 to target value and back to 0, repeatedly.

Period =  (target value * 2) * timer clock period</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP_PER</name>
                  <value>2</value>
                  <description>Count up periodically. The timer increments from 0 to target value, repeatedly.

Period = (target value + 1) * timer clock period</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP_ONCE</name>
                  <value>1</value>
                  <description>Count up once. The timer increments from 0 to target value,  then stops and sets MODE to DIS.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable timer. Updates to counter, channels, and events stop.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TARGET</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Target

User defined counter target.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] 16 bit user defined counter target value, which is used when selected by CTL.TARGET_EN.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SHDWTARGET</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Shadow Target</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Target value for next counter period.

