CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
The timer copies VALUE to TARGET.VALUE when CNTR.VALUE becomes 0. The copy does not happen when you restart the timer.

This is useful to avoid period jitter in PWM applications with time-varying period, sometimes referenced as phase corrected PWM.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CNTR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Counter</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] 16 bit current counter value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PRECFG</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Clock Prescaler Configuration</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>[7:0] Clock division.

CLKDIV determines the timer clock frequency for counter, synchronization, and timer event updates. The timer clock frequency is the clock selected by AUX_SYSIF:TIMER2CLKCTL.SRC divided by (CLKDIV + 1). This inverse is the timer clock period.

0x00: Divide by 1.
0x01: Divide by 2.
...
0xFF: Divide by 256.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVCTL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Event Control

Set and clear individual events manually. Manual update of an event takes priority over automatic channel updates to the same event. You cannot set and clear an event at the same time, such requests will be neglected.

An event can be automatically cleared, set, toggled, or pulsed by each channel, listed in decreasing order of priority. The action with highest priority happens when multiple channels want to update an event at the same time.

The four events connect to the asynchronous AUX event bus:
- Event 0 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0.
- Event 1 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1.
- Event 2 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2.
- Event 3 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>EV3_SET</name>
              <description>[7:7] Set event 3.

Write 1 to set event 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>EV3_CLR</name>
              <description>[6:6] Clear event 3.

Write 1 to clear event 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>EV2_SET</name>
              <description>[5:5] Set event 2.

Write 1 to set event 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>EV2_CLR</name>
              <description>[4:4] Clear event 2.

Write 1 to clear event 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>EV1_SET</name>
              <description>[3:3] Set event 1.

Write 1 to set event 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>EV1_CLR</name>
              <description>[2:2] Clear event 1.

Write 1 to clear event 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>EV0_SET</name>
              <description>[1:1] Set event 0.

Write 1 to set event 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>EV0_CLR</name>
              <description>[0:0] Clear event 0.

Write 1 to clear event 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PULSETRIG</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Pulse Trigger</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIG</name>
              <description>[0:0] Pulse trigger.

Write 1 to generate a pulse to AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE. Pulse width equals the duty cycle of AUX_SYSIF:TIMER2CLKCTL.SRC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH0EVCFG</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Channel 0 Event Configuration

This register configures channel function and enables event outputs.

Each channel has an edge-detection circuit with memory. The circuit is:
 - enabled while CCACT selects a capture function and CTL.MODE is different from DIS.
 - flushed while CCACT selects a capture function and you change CTL.MODE from DIS to another mode.

The flush action uses two AUX_SYSIF:TIMER2CLKCTL.SRC clock periods. It prevents capture events caused by expired signal values stored in the edge-detection circuit.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV3_GEN</name>
              <description>[7:7] Event 3 enable.

