CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: Channel 3 does not control event 0.
1: Channel 3 controls event 0.

 When 0 &lt; CCACT &lt; 8, EV0_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CCACT</name>
              <description>[3:0] Capture-Compare action.

Capture-Compare action defines 15 different channel functions that utilize capture, compare, and zero events.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULSE_ON_CMP</name>
                  <value>15</value>
                  <description>Pulse on compare repeatedly.

Channel function sequence:
- Pulse enabled events when CH3CC.VALUE = CNTR.VALUE.

 The event is high for two timer clock periods.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TGL_ON_CMP</name>
                  <value>14</value>
                  <description>Toggle on compare repeatedly.

Channel function sequence:
- Toggle enabled events  when CH3CC.VALUE = CNTR.VALUE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_CMP</name>
                  <value>13</value>
                  <description>Set on compare repeatedly.

Channel function sequence:
- Set enabled events  when CH3CC.VALUE = CNTR.VALUE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_CMP</name>
                  <value>12</value>
                  <description>Clear on compare repeatedly.

Channel function sequence:
- Clear enabled events  when CH3CC.VALUE = CNTR.VALUE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_0_TGL_ON_CMP</name>
                  <value>11</value>
                  <description>Set on zero, toggle on compare repeatedly.

Channel function sequence:
- Set enabled events when CNTR.VALUE = 0.
- Toggle enabled events when CH3CC.VALUE = CNTR.VALUE.

Set CTL.MODE to UP_PER for edge-aligned PWM generation. Duty cycle is given by:

When CH3CC.VALUE &lt;= TARGET.VALUE:
   Duty cycle = CH3CC.VALUE / ( TARGET.VALUE + 1 ).

When CH3CC.VALUE &gt; TARGET.VALUE:
   Duty cycle = 1.

Enabled events are cleared when CH3CC.VALUE = 0 and CNTR.VALUE = 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_0_TGL_ON_CMP</name>
                  <value>10</value>
                  <description>Clear on zero, toggle on compare repeatedly.

Channel function sequence:
- Clear enabled events when CNTR.VALUE = 0.
- Toggle enabled events when CH3CC.VALUE = CNTR.VALUE.

Set CTL.MODE to UPDWN_PER for center-aligned PWM generation. Duty cycle is given by:

When CH3CC.VALUE &lt;= TARGET.VALUE:
   Duty cycle = 1 - ( CH3CC.VALUE / TARGET.VALUE ).

When CH3CC.VALUE &gt; TARGET.VALUE:
   Duty cycle = 0.

Enabled events are set when CH3CC.VALUE = 0 and CNTR.VALUE = 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_CAPT</name>
                  <value>9</value>
                  <description>Set on capture repeatedly.

Channel function sequence:
- Set enabled events on capture event and copy CNTR.VALUE to CH3CC.VALUE.

Primary use scenario is to select this function before you start the timer.
Follow these steps if you need to select this function while CTL.MODE is different from DIS:
 - Select this function with no event enable.
 - Configure CH3CCFG (optional).
 - Wait for three timer clock periods as defined in PRECFG before you enable events.

These steps prevent capture events caused by expired signal values in edge-detection circuit.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_PULSE_WIDTH_MEAS</name>
                  <value>8</value>
                  <description>Period and pulse width measurement.

Continuously capture period and pulse width of the signal selected by CH3CCFG.CAPT_SRC relative to the signal edge given by CH3CCFG.EDGE.

Set enabled events when CH3CC.VALUE contains signal period and CH3PCC.VALUE contains signal pulse width.

Notes:
- Make sure that you configure CH3CCFG.CAPT_SRC and CCACT when CTL.MODE equals DIS, then set CTL.MODE to UP_ONCE or UP_PER.
- The counter restarts in the selected timer mode when CH3CC.VALUE contains the signal period.
- If more than one channel uses this function, the channels will perform this function one at a time. The channel with lowest number has priority and performs the function first. Next measurement starts when current measurement completes successfully or times out. A timeout occurs when counter equals target.
- If you want to observe a timeout event configure another channel to SET_ON_CAPT.

Signal property requirements:
- Signal Period &gt;= 2 * ( 1 + PRECFG.CLKDIV ) * timer clock period.
- Signal Period &lt;= 65535 * (1 + PRECFG.CLKDIV ) * timer clock period.
- Signal low and high phase &gt;= (1 + PRECFG.CLKDIV ) * timer clock period.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_ON_CMP_DIS</name>
                  <value>7</value>
                  <description>Pulse on compare, and then disable channel.

Channel function sequence:
- Pulse enabled events when CH3CC.VALUE = CNTR.VALUE.
- Disable channel.

 The event is high for two timer clock periods.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TGL_ON_CMP_DIS</name>
                  <value>6</value>
                  <description>Toggle on compare, and then disable channel.

Channel function sequence:
- Toggle enabled events when CH3CC.VALUE = CNTR.VALUE.
- Disable channel.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_CMP_DIS</name>
                  <value>5</value>
                  <description>Set on compare, and then disable channel.

