CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Channel function sequence:
- Set enabled events when CH3CC.VALUE = CNTR.VALUE.
- Disable channel.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_CMP_DIS</name>
                  <value>4</value>
                  <description>Clear on compare, and then disable channel.

Channel function sequence:
- Clear enabled events when CH3CC.VALUE = CNTR.VALUE.
- Disable channel.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_0_TGL_ON_CMP_DIS</name>
                  <value>3</value>
                  <description>Set on zero, toggle on compare, and then disable channel.

Channel function sequence:
- Set enabled events when CNTR.VALUE = 0.
- Toggle enabled events when CH3CC.VALUE = CNTR.VALUE.
- Disable channel.

Enabled events are cleared when CH3CC.VALUE = 0 and CNTR.VALUE = 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_0_TGL_ON_CMP_DIS</name>
                  <value>2</value>
                  <description>Clear on zero, toggle on compare, and then disable channel.

Channel function sequence:
- Clear enabled events when CNTR.VALUE = 0.
- Toggle enabled events when CH3CC.VALUE = CNTR.VALUE.
- Disable channel.

Enabled events are set when CH3CC.VALUE = 0 and CNTR.VALUE = 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_CAPT_DIS</name>
                  <value>1</value>
                  <description>Set on capture, and then disable channel.

Channel function sequence:
- Set enabled events on capture event and copy CNTR.VALUE to CH3CC.VALUE.
- Disable channel.

Primary use scenario is to select this function before you start the timer.
Follow these steps if you need to select this function while CTL.MODE is different from DIS:
 - Set CCACT to SET_ON_CAPT with no event enable.
 - Configure CH3CCFG (optional).
 - Wait for three timer clock periods as defined in PRECFG before you set CCACT to SET_ON_CAPT_DIS.  Event enable is optional.

These steps prevent capture events caused by expired signal values in edge-detection circuit.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable channel.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH3CCFG</name>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <description>Channel 3 Capture Configuration</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CAPT_SRC</name>
              <description>[6:1] Select capture signal source from the asynchronous AUX event bus.

The selected signal enters the edge-detection circuit. False capture events can occur when:
- the edge-detection circuit contains expired signal samples and the circuit is enabled without flush as described in CH3EVCFG
- this register is reconfigured while CTL.MODE is different from DIS.

You can avoid false capture events. When wanted channel function:
- SET_ON_CAPT_DIS, see description for SET_ON_CAPT_DIS in CH3EVCFG.CCACT.
- SET_ON_CAPT, see description for SET_ON_CAPT in CH3EVCFG.CCACT.
- PER_PULSE_WIDTH_MEAS, see description for PER_PULSE_WIDTH_MEAS in CH3EVCFG.CCACT.

If you write a non-enumerated value the behavior is identical to NO_EVENT. The written value is returned when read.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EVENT</name>
                  <value>63</value>
                  <description>No event.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <value>61</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_NOT_EMPTY</name>
                  <value>60</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <value>59</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <value>58</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_IRQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>57</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ISRC_RESET_N</name>
                  <value>56</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ISRC_RESET_N</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>55</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TDC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>54</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>53</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>51</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>50</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>49</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>48</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>47</value>
                  <description>AUX_EVCTL:EVSTAT2.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>46</value>
                  <description>AUX_EVCTL:EVSTAT2.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_OBSMUX1</name>
                  <value>45</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_OBSMUX1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_OBSMUX0</name>
                  <value>44</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <value>43</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <value>42</value>
                  <description>AUX_EVCTL:EVSTAT2.ACLK_REF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDR_RECHARGE</name>
                  <value>41</value>
                  <description>AUX_EVCTL:EVSTAT2.VDDR_RECHARGE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_ACTIVE</name>
                  <value>40</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_ACTIVE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_DWN</name>
                  <value>39</value>
                  <description>AUX_EVCTL:EVSTAT2.PWR_DWN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>38</value>
                  <description>AUX_EVCTL:EVSTAT2.SCLK_LF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_BATMON_TEMP_UPD</name>
                  <value>37</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_BATMON_TEMP_UPD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_BATMON_BAT_UPD</name>
                  <value>36</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_BATMON_BAT_UPD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_4KHZ</name>
                  <value>35</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_4KHZ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>34</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2</name>
                  <value>33</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANUAL_EV</name>
                  <value>32</value>
                  <description>AUX_EVCTL:EVSTAT2.MANUAL_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO31</name>
                  <value>31</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO30</name>
                  <value>30</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO29</name>
                  <value>29</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO28</name>
                  <value>28</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO27</name>
                  <value>27</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO26</name>
                  <value>26</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO25</name>
                  <value>25</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO24</name>
                  <value>24</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO23</name>
                  <value>23</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO22</name>
                  <value>22</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO21</name>
                  <value>21</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO20</name>
                  <value>20</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO19</name>
                  <value>19</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO18</name>
                  <value>18</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO17</name>
                  <value>17</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO16</name>
                  <value>16</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <value>15</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <value>14</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <value>13</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <value>12</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <value>11</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <value>10</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <value>8</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>7</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>6</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>5</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>4</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>3</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>2</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>1</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>0</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>[0:0] Edge configuration.

Channel captures counter value at selected edge on signal source selected by CAPT_SRC. See CH3EVCFG.CCACT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <value>1</value>
                  <description>Capture CNTR.VALUE at rising edge of CAPT_SRC.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <value>0</value>
                  <description>Capture CNTR.VALUE at falling edge of CAPT_SRC.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH3PCC</name>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <description>Channel 3 Pipeline Capture Compare</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Pipeline Capture Compare value.

