CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>[3:3] Write 1 to clear EVTOMCUFLAGS.AUX_TDC_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[2:2] Write 1 to clear EVTOMCUFLAGS.AUX_COMPB.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[1:1] Write 1 to clear EVTOMCUFLAGS.AUX_COMPA.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_WU_EV</name>
              <description>[0:0] Write 1 to clear EVTOMCUFLAGS.AUX_WU_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMBEVTOMCUMASK</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Combined Event To MCU Mask

Select event flags in EVTOMCUFLAGS that contribute to the AUX_COMB event to EVENT and system CPU.

The AUX_COMB event is high as long as one or more of the included event flags are set.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>[15:15] EVTOMCUFLAGS.AUX_TIMER2_PULSE contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>[14:14] EVTOMCUFLAGS.AUX_TIMER2_EV3 contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>[13:13] EVTOMCUFLAGS.AUX_TIMER2_EV2 contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>[12:12] EVTOMCUFLAGS.AUX_TIMER2_EV1 contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>[11:11] EVTOMCUFLAGS.AUX_TIMER2_EV0 contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>[10:10] EVTOMCUFLAGS.AUX_ADC_IRQ contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>[9:9] EVTOMCUFLAGS.MCU_OBSMUX0 contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>[8:8] EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>[7:7] EVTOMCUFLAGS.AUX_ADC_DONE contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>[6:6] EVTOMCUFLAGS.AUX_SMPH_AUTOTAKE_DONE contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>[5:5] EVTOMCUFLAGS.AUX_TIMER1_EV contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>[4:4] EVTOMCUFLAGS.AUX_TIMER0_EV contribution to the AUX_COMB event.

