CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Timer 1 stops and T1CTL.EN becomes 0 when the counter value becomes equal to or greater than T1TARGET.VALUE.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1CTL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Timer 1 Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Timer 1 enable.

0: Disable Timer 1.
1: Enable Timer 1.

The counter restarts from 0 when you enable Timer 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1TARGET</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Timer 1 Target

Timer 1 counter target value</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Timer 1 target value.

Manual Reload Mode:
- Timer 1 increments until the counter value becomes equal to or greater than VALUE.
- AUX_TIMER1_EV pulses high for 1 peripheral clock period when the counter value is equal to or greater than VALUE.

Note: When VALUE is 0, Timer 1 counts to 1. AUX_TIMER1_EV pulses high for 1 peripheral clock period.

Continuous Reload Mode:
- Timer 1 increments until the counter value becomes equal to or greater than ( VALUE - 1), then restarts from 0.
- AUX_TIMER1_EV pulses high for 1 peripheral clock period when the counter value is 0, except for when you enable the timer.

Note: When VALUE is less than 2, Timer 1 counter value remains 0. AUX_TIMER1_EV goes high and remains high 1 peripheral clock period after you enable the timer.


It is allowed to update the VALUE while the timer runs.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1CNTR</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Timer 1 Counter</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Timer 1 counter value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_SMPH</name>
      <baseAddress>0x400C8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Semaphore (AUX_SMPH) provides hardware means to share modules in AUX safely between CPUs based on resource ownership.

AUX_SMPH operates at AUX bus rate.</description>
      <registers>
        <register>
          <name>SMPH0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Semaphore 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Semaphore 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH2</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Semaphore 2</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH3</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Semaphore 3</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH4</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Semaphore 4</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH5</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Semaphore 5</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH6</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Semaphore 6</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH7</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Semaphore 7</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>AUTOTAKE</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Auto Take

