CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
If AUX_SYSIF:OPMODEREQ.REQ equals PDLP, you must set:
- H_PER = L_PER = HOLD_INTERVAL = 0.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED15</name>
              <description>[31:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>H_PER</name>
              <description>[14:14] High time.

The sample clock period is high for this many base periods.

0: 2 periods
1: 4 periods</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>L_PER</name>
              <description>[13:12] Low time.

The sample clock period is low for this many base periods.

0: 1 period
1: 2 periods
2: 3 periods
3: 4 periods</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUP_CNT</name>
              <description>[11:8] Setup count.

Number of active sample clock periods during the setup phase.

0: 1 sample clock period
1: 2 sample clock periods
...
15 : 16 sample clock periods</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HOLD_INTERVAL</name>
              <description>[7:0] Hold interval.

Number of inactive sample clock periods between each active sample clock period during hold phase. The sample clock is low when inactive.

The range is 0 to 255.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DACVALUE</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>DAC Value</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[7:0] DAC value.

Digital data word for the DAC.

Only change VALUE when DACCTL.DAC_EN is 0. Then wait 1 us before you enable the DAC.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DACSTAT</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>DAC Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SETUP_ACTIVE</name>
              <description>[1:1] DAC setup phase status.

0: Sample clock is disabled or setup phase is complete.
1: Setup phase in progress.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HOLD_ACTIVE</name>
              <description>[0:0] DAC hold phase status.

0: Sample clock is disabled or DAC is not in hold phase.
1: Hold phase in progress.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_AIODIO0</name>
      <baseAddress>0x400CC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Analog Digital Input Output Controller (AUX_AIODIO) controls the general purpose input output pins of the AUX domain. These pins are referenced as AUXIO and can:
- be connected to analog AUX modules, such as comparators and ADC.
- be used by AUX_SCE.
- connect to AUX_SPIM SCLK, MISO and MOSI signals.
- connect to the asynchronous AUX event bus.

Enabled digital inputs are synchronized at SCE clock rate.

Note that the IO mapping in the AUX domain is different from the IO mapping in the MCU domain. This means that AUXIO[n] does not map to DIO[n]. AUXIO-DIO remapping is handled by Sensor Controller Studio.</description>
      <registers>
        <register>
          <name>IOMODE</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Input Output Mode

This register controls pull-up, pull-down, and output mode for AUXIO that are controlled by instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IO7</name>
              <description>[15:14] Selects mode for AUXIO[8i+7].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

