CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
When IOPOE bit 4 is 1:
- If signal selected by IO4PSEL.SRC is 0: AUXIO[8i+4] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO4PSEL.SRC is 1: AUXIO[8i+4] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 4 is 0:
- If GPIODOUT bit 4 is 0: AUXIO[8i+4] is driven low.
- If GPIODOUT bit 4 is 1: AUXIO[8i+4] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 4 is 1:
- If signal selected by IO4PSEL.SRC is 0: AUXIO[8i+4] is driven low.
- If signal selected by IO4PSEL.SRC is 1: AUXIO[8i+4] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 4 is 0: AUXIO[8i+4] is enabled for analog signal transfer.

When GPIODIE bit 4 is 1: AUXIO[8i+4] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 4 is 0: GPIODOUT bit 4 drives AUXIO[8i+4].

When IOPOE bit 4 is 1: The signal selected by IO4PSEL.SRC drives AUXIO[8i+4].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO3</name>
              <description>[7:6] Selects mode for AUXIO[8i+3].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 3 is 0:
- If GPIODOUT bit 3 is 0: AUXIO[8i+3] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 3 is 1: AUXIO[8i+3] is driven high.

When IOPOE bit 3 is 1:
- If signal selected by IO3PSEL.SRC is 0: AUXIO[8i+3] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO3PSEL.SRC is 1: AUXIO[8i+3] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 3 is 0:
- If GPIODOUT bit 3 is 0: AUXIO[8i+3] is driven low.
- If GPIODOUT bit 3 is 1: AUXIO[8i+3] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 3 is 1:
- If signal selected by IO3PSEL.SRC is 0: AUXIO[8i+3] is driven low.
- If signal selected by IO3PSEL.SRC is 1: AUXIO[8i+3] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 3 is 0: AUXIO[8i+3] is enabled for analog signal transfer.

When GPIODIE bit 3 is 1: AUXIO[8i+3] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 3 is 0: GPIODOUT bit 3 drives AUXIO[8i+3].

When IOPOE bit 3 is 1: The signal selected by IO3PSEL.SRC drives AUXIO[8i+3].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO2</name>
              <description>[5:4] Select mode for AUXIO[8i+2].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 2 is 0:
- If GPIODOUT bit 2 is 0: AUXIO[8i+2] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 2 is 1: AUXIO[8i+2] is driven high.

When IOPOE bit 2 is 1:
- If signal selected by IO2PSEL.SRC is 0: AUXIO[8i+2] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO2PSEL.SRC is 1: AUXIO[8i+2] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 2 is 0:
- If GPIODOUT bit 2 is 0: AUXIO[8i+2] is driven low.
- If GPIODOUT bit 2 is 1: AUXIO[8i+2] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 2 is 1:
- If signal selected by IO2PSEL.SRC is 0: AUXIO[8i+2] is driven low.
- If signal selected by IO2PSEL.SRC is 1: AUXIO[8i+2] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 2 is 0: AUXIO[8i+2] is enabled for analog signal transfer.

When GPIODIE bit 2 is 1: AUXIO[8i+2] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 2 is 0: GPIODOUT bit 2 drives AUXIO[8i+2].

When IOPOE bit 2 is 1: The signal selected by IO2PSEL.SRC drives AUXIO[8i+2].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO1</name>
              <description>[3:2] Select mode for AUXIO[8i+1].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 1 is 0:
- If GPIODOUT bit 1 is 0: AUXIO[8i+1] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 1 is 1: AUXIO[8i+1] is driven high.

When IOPOE bit 1 is 1:
- If signal selected by IO1PSEL.SRC is 0: AUXIO[8i+1] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO1PSEL.SRC is 1: AUXIO[8i+1] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 1 is 0:
- If GPIODOUT bit 1 is 0: AUXIO[8i+1] is driven low.
- If GPIODOUT bit 1 is 1: AUXIO[8i+1] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 1 is 1:
- If signal selected by IO1PSEL.SRC is 0: AUXIO[8i+1] is driven low.
- If signal selected by IO1PSEL.SRC is 1: AUXIO[8i+1] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 1 is 0: AUXIO[8i+1] is enabled for analog signal transfer.

When GPIODIE bit 1 is 1: AUXIO[8i+1] is enabled for digital input.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>0</value>
                  <description>Output Mode:

When IOPOE bit 1 is 0: GPIODOUT bit 1 drives AUXIO[8i+1].

When IOPOE bit 1 is 1: The signal selected by IO1PSEL.SRC drives AUXIO[8i+1].</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO0</name>
              <description>[1:0] Select mode for AUXIO[8i+0].</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPEN_SOURCE</name>
                  <value>3</value>
                  <description>Open-Source Mode:

When IOPOE bit 0 is 0:
- If GPIODOUT bit 0 is 0: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If GPIODOUT bit 0 is 1: AUXIO[8i+0] is driven high.

When IOPOE bit 0 is 1:
- If signal selected by IO0PSEL.SRC is 0: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.
- If signal selected by IO0PSEL.SRC is 1: AUXIO[8i+0] is driven high.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <value>2</value>
                  <description>Open-Drain Mode:

When IOPOE bit 0 is 0:
- If GPIODOUT bit 0 is 0: AUXIO[8i+0] is driven low.
- If GPIODOUT bit 0 is 1: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.

When IOPOE bit 0 is 1:
- If signal selected by IO0PSEL.SRC is 0: AUXIO[8i+0] is driven low.
- If signal selected by IO0PSEL.SRC is 1: AUXIO[8i+0] is tri-stated or pulled. This depends on IOC:IOCFGn.PULL_CTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input Mode:

When GPIODIE bit 0 is 0: AUXIO[8i+0] is enabled for analog signal transfer.

