CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>RESERVED_140</name>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>USER_ID</name>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <description>User Identification.
Reading this register and the FCFG1:ICEPICK_DEVICE_ID register is the only supported way of identifying a device.
The value of this register will be written to AON_PMCTL:JTAGUSERCODE by boot FW while in safezone.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PG_REV</name>
              <description>[31:28] Field used to distinguish revisions of the device</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VER</name>
              <description>[27:26] Version number.

0x0: Bits [25:12] of this register has the stated meaning.

Any other setting indicate a different encoding of these bits.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PA</name>
              <description>[25:25] 0: Does not support 20dBm PA
1: Supports 20dBM PA</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[24:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CC13</name>
              <description>[23:23] 0: CC26x4x10 device type
1: CC13x4x10 device type</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQUENCE</name>
              <description>[22:19] Sequence.

Used to differentiate between marketing/orderable product where other fields of this register are the same (temp range, flash size, voltage range etc)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PKG</name>
              <description>[18:16] Package type.

0x2: 7x7mm QFN (RGZ) package
0x7: 8x8mm QFN (RSK) package

Other values are reserved for future use.
Packages available for a specific device are shown in the device datasheet.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>[15:12] Protocols supported.

0x1: BLE
0x2: RF4CE
0x4: Zigbee/6lowpan
0x8: Proprietary

More than one protocol can be supported on same device - values above are then combined.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[11:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x10000000</resetValue>
        </register>
        <register>
          <name>FLASH_OTP_DATA3</name>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_SIZE</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFFFFFFF8</resetValue>
        </register>
        <register>
          <name>ANA2_TRIM</name>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RCOSCHFCTRIMFRACT_EN</name>
              <description>[31:31] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT</name>
              <description>[30:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[25:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SET_RCOSC_HF_FINE_RESISTOR</name>
              <description>[24:23] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ATESTLF_UDIGLDO_IBIAS_TRIM</name>
              <description>[22:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>NANOAMP_RES_TRIM</name>
              <description>[21:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_DRV_DS</name>
              <description>[14:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DITHER_EN</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_IPEAK</name>
              <description>[10:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DEAD_TIME_TRIM</name>
              <description>[7:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_LOW_EN_SEL</name>
              <description>[5:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_HIGH_EN_SEL</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x8240087F</resetValue>
        </register>
        <register>
          <name>LDO_TRIM</name>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP</name>
              <description>[28:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>GLDO_CURSRC</name>
              <description>[18:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[15:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ITRIM_DIGLDO_LOAD</name>
              <description>[12:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ITRIM_UDIGLDO</name>
              <description>[10:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VTRIM_DELTA</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xE0F8E0FB</resetValue>
        </register>
        <register>
          <name>MAC_BLE_0</name>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <description>MAC BLE Address 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_0_31</name>
              <description>[31:0] The first 32-bits of the 64-bit MAC BLE address</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MAC_BLE_1</name>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <description>MAC BLE Address 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_32_63</name>
              <description>[31:0] The last 32-bits of the 64-bit MAC BLE address</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MAC_15_4_0</name>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <description>MAC IEEE 802.15.4 Address 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_0_31</name>
              <description>[31:0] The first 32-bits of the 64-bit MAC 15.4 address</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MAC_15_4_1</name>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <description>MAC IEEE 802.15.4 Address 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_32_63</name>
              <description>[31:0] The last 32-bits of the 64-bit MAC 15.4 address</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MISC_TRIM</name>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <description>Miscellaneous Trim  Parameters</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_RECHARGE_COMP_OFFSET</name>
              <description>[16:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_RECHARGE_COMP_REFLEVEL</name>
              <description>[11:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPVSLOPE</name>
              <description>[7:0] Signed byte value representing the TEMP slope with battery voltage, in degrees C / V, with four fractional bits.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFFFE003B</resetValue>
        </register>
        <register>
          <name>RCOSC_HF_TEMPCOMP</name>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FINE_RESISTOR</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRIM</name>
              <description>[23:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRIMFRACT_QUAD</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRIMFRACT_SLOPE</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
        <register>
          <name>ICEPICK_DEVICE_ID</name>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <description>IcePick Device Identification
Reading this register and the FCFG1:USER_ID register is the only supported way of identifying a device.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PG_REV</name>
              <description>[31:28] Field used to distinguish revisions of the device.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WAFER_ID</name>
              <description>[27:12] Field used to identify silicon die.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MANUFACTURER_ID</name>
              <description>[11:0] Manufacturer code.

0x02F: Texas Instruments</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1BB7802F</resetValue>
        </register>
        <register>
          <name>FCFG1_REVISION</name>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <description>Factory Configuration (FCFG1) Revision</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>REV</name>
              <description>[31:0] The revision number of the FCFG1 layout. This value will be read by application SW in order to determine which FCFG1 parameters that have valid values. This revision number must be incremented by 1 before any devices are to be produced if the FCFG1 layout has changed since the previous production of devices.
Value migth change without warning.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x2A</resetValue>
        </register>
        <register>
          <name>MISC_OTP_DATA</name>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <description>Misc OTP Data</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RCOSC_HF_ITUNE</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSC_HF_CRIM</name>
              <description>[27:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_M</name>
              <description>[19:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_E</name>
              <description>[14:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[11:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xCFFF</resetValue>
        </register>
        <register>
          <name>RESERVED_324</name>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
