CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>CONFIG_IF_ADC</name>
          <addressOffset>0x34c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FF2ADJ</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FF3ADJ</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INT3ADJ</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FF1ADJ</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AAFCAP</name>
              <description>[15:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INT2ADJ</name>
              <description>[13:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IFDIGLDO_TRIM_OUTPUT</name>
              <description>[9:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IFANALDO_TRIM_OUTPUT</name>
              <description>[4:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x3460F400</resetValue>
        </register>
        <register>
          <name>CONFIG_OSC_TOP</name>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:30] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_HF_ROW_Q12</name>
              <description>[29:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_HF_COLUMN_Q12</name>
              <description>[25:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSCLF_CTUNE_TRIM</name>
              <description>[9:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSCLF_RTUNE_TRIM</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xDC07FC00</resetValue>
        </register>
        <register>
          <name>SOC_ADC_ABS_GAIN</name>
          <addressOffset>0x35c</addressOffset>
          <size>32</size>
          <description>AUX_ADC Gain in Absolute Reference Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_ABS_GAIN_TEMP1</name>
              <description>[15:0] SOC_ADC gain in absolute reference mode at temperature 1 (30C). Calculated in production test..</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SOC_ADC_REL_GAIN</name>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <description>AUX_ADC Gain in Relative Reference Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_REL_GAIN_TEMP1</name>
              <description>[15:0] SOC_ADC gain in relative reference mode at temperature 1 (30C). Calculated in production test..</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SOC_ADC_OFFSET_INT</name>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <description>AUX_ADC Temperature Offsets in Absolute Reference Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_REL_OFFSET_TEMP1</name>
              <description>[23:16] SOC_ADC offset in relative reference mode at temperature 1 (30C). Signed 8-bit number. Calculated in production test..</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>[15:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_ABS_OFFSET_TEMP1</name>
              <description>[7:0] SOC_ADC offset in absolute reference mode at temperature 1 (30C). Signed 8-bit number. Calculated in production test..</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SOC_ADC_REF_TRIM_AND_OFFSET_EXT</name>
          <addressOffset>0x36c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_REF_VOLTAGE_TRIM_TEMP1</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xC080</resetValue>
        </register>
        <register>
          <name>AMPCOMP_TH1</name>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HPMRAMP3_LTH</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[17:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HPMRAMP3_HTH</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIASCAP_LPTOHP_OL_CNT</name>
              <description>[9:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HPMRAMP1_TH</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFF7B828E</resetValue>
        </register>
        <register>
          <name>AMPCOMP_TH2</name>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPMUPDATE_LTH</name>
              <description>[31:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[25:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LPMUPDATE_HTM</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[17:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_LPM</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[9:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_HPM</name>
              <description>[7:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x6B8B0303</resetValue>
        </register>
        <register>
          <name>AMPCOMP_CTRL1</name>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:31] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AMPCOMP_REQ_MODE</name>
              <description>[30:30] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[29:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIAS_OFFSET</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIAS_INIT</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP_STEP</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIASCAP_HPTOLP_OL_CNT</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFF483F47</resetValue>
        </register>
        <register>
          <name>ANABYPASS_VALUE2</name>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_HF_IBIASTHERM</name>
              <description>[13:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFFFFC3FF</resetValue>
        </register>
        <register>
          <name>VOLT_TRIM</name>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM_HH</name>
              <description>[28:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[23:21] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM_H</name>
              <description>[20:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[15:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP_H</name>
              <description>[12:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMBOD_H</name>
              <description>[4:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xE0E0E0E0</resetValue>
        </register>
