CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>HASHDATAIN8</name>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <description>HASH Data Input 8
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[287:256]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN9</name>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <description>HASH Data Input 9
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[319:288]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN10</name>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <description>HASH Data Input 10
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[351:320]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN11</name>
          <addressOffset>0x62c</addressOffset>
          <size>32</size>
          <description>HASH Data Input 11
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[383:352]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN12</name>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <description>HASH Data Input 12
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[415:384]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN13</name>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <description>HASH Data Input 13
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[447:416]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN14</name>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <description>HASH Data Input 14
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[479:448]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN15</name>
          <addressOffset>0x63c</addressOffset>
          <size>32</size>
          <description>HASH Data Input 15
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[511:480]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN16</name>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <description>HASH Data Input 16
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[543:512]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN17</name>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <description>HASH Data Input 17
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[575:544]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN18</name>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <description>HASH Data Input 18
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[607:576]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN19</name>
          <addressOffset>0x64c</addressOffset>
          <size>32</size>
          <description>HASH Data Input 19
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[639:608]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN20</name>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <description>HASH Data Input 20
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[671:640]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
