CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>HASHDATAIN21</name>
          <addressOffset>0x654</addressOffset>
          <size>32</size>
          <description>HASH Data Input 21
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[703:672]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN22</name>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <description>HASH Data Input 22
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[735:704]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN23</name>
          <addressOffset>0x65c</addressOffset>
          <size>32</size>
          <description>HASH Data Input 23
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[767:736]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN24</name>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <description>HASH Data Input 24
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[799:768]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN25</name>
          <addressOffset>0x664</addressOffset>
          <size>32</size>
          <description>HASH Data Input 25
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[831:800]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN26</name>
          <addressOffset>0x668</addressOffset>
          <size>32</size>
          <description>HASH Data Input 26
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[863:832]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN27</name>
          <addressOffset>0x66c</addressOffset>
          <size>32</size>
          <description>HASH Data Input 27
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[895:864]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN28</name>
          <addressOffset>0x670</addressOffset>
          <size>32</size>
          <description>HASH Data Input 28
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[923:896]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN29</name>
          <addressOffset>0x674</addressOffset>
          <size>32</size>
          <description>HASH Data Input 29
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[959:924]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN30</name>
          <addressOffset>0x678</addressOffset>
          <size>32</size>
          <description>HASH Data Input 30
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[991:960]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDATAIN31</name>
          <addressOffset>0x67c</addressOffset>
          <size>32</size>
          <description>HASH Data Input 31
The data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>[31:0] HASH_DATA_IN[1023:992]
These registers must be written with the 512-bit or 1024-bit (depending on block size of chosen SHA-2 algorithm) input data. The data lines are connected directly to the data input of the hash module and hence into the engine's internal data buffer. Writing to each of the registers triggers a corresponding 32-bit write enable to the internal buffer.
Note: The host may only write the input data buffer when HASHIOBUFCTRL.RFD_IN  is 1. If the HASHIOBUFCTRL.RFD_IN   is 0, the engine is busy with processing. During processing, it is not allowed to write new input data.
For message lengths larger than a block size, multiple blocks of data are written to this input buffer using a handshake through flags of the HASHIOBUFCTRL register. All blocks except the last are required to be 512 bits (or 1024 bits depending on block size) in size. If the last block is not 512 bits ( or 1024 bits depending on block size) long, only the least significant bits of data must be written, but they must be padded with 0s to the next 32-bit boundary.
Host read operations from these register addresses return 0s.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
