CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>DIVMSW</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>PKA most-significant-word of divide remainder
This register indicates the (32-bit word) address in the PKA RAM where the most significant nonzero 32-bit word of the remainder result for the basic divide and modulo operations is stored. Bits [4:0] are loaded with the bit number of the most-significant nonzero bit in the most-significant nonzero word when MS one control bit is set. For divide, modulo, and MS one reporting, this register is updated when FUNCTION.RUN bit is reset at the end of the operation. For the complex sequencer controlled operations, updating of bits [4:0] of this register with the most-significant bit location of the actual result is done near the end of the operation. The result is meaningful only if no errors were detected and that for ECC operations; this register provides information for the x-coordinate of the result point only.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Ignore on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT_IS_ZERO</name>
              <description>[15:15] The result vector is all zeroes, ignore the address returned in bits [10:0]</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[14:11] Ignore on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MSW_ADDRESS</name>
              <description>[10:0] Address of the most significant nonzero 32-bit word of the remainder result vector in PKA RAM</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x8000</resetValue>
        </register>
        <register>
          <name>SEQCTRL</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>PKA sequencer control and status register
The sequencer is interfaced with the outside world through a single control and status register. With the exception of bit [31], the actual use of bits in the separate sub-fields of this register is determined by the sequencer firmware. This register need only be accessed when the sequencer program is stored in RAM. The reset value of the RESET bit depends upon the option chosen for sequencer program storage.                                                                                                                                                                   NOTE: For Agama the sequencer firmware is executed from ROM.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESET</name>
              <description>[31:31] Option program ROM: Reset value = 0. Read/Write, reset value 0b (ZERO). Writing 1b resets the sequencer, write to 0b to restart operations again. As the reset value is 0b, the sequencer will automatically start operations executing from program ROM. This bit should always be written with zero and ignored when reading this register.

Option Program RAM: Reset value =1. Read/Write, reset value 1b (ONE). When 1b, the sequencer is held in a reset state and the PKA_PROGRAM area is accessible for loading the sequencer program (while the PKA_DATA_RAM is inaccessible), write to 0b to (re)start sequencer operations and disable PKA_PROGRAM area accessibility (also enables the PKA_DATA_RAM accesses). Resetting the sequencer (in order to load other firmware) should only be done when the PKA Engine is not performing any operations (i.e. the FUNCTION.RUN bit should be zero).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED16</name>
              <description>[30:16] Set to zero on write, ignore on read</description>
              <bitWidth>15</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQUENCER_STAT</name>
              <description>[15:8] These read-only bits can be used by the sequencer to communicate status to the outside world. Bit [8] is also used as sequencer interrupt, with the complement of this bit ORed into the FUNCTION.RUN bit. This field should always be written with zeroes and ignored when reading this register.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_CONTROL_STAT</name>
              <description>[7:0] These bits can be used by software to trigger sequencer operations. External logic can set these bits by writing 1b, cannot reset them by writing 0b. The sequencer can reset these bits by writing 0b, cannot set them by writing 1b. Setting the FUNCTION.RUN bit together with a nonzero sequencer operations field automatically sets bit [0] here. This field should always be written with zeroes and ignored when reading this register.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x100</resetValue>
        </register>
        <register>
          <name>OPTIONS</name>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <description>PKA hardware options register
This register provides the host with a means to determine the hardware configuration implemented in this PKA engine, focused on options that have an effect on software interacting with the module.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Ignore on read</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INT_MASKING</name>
              <description>[11:11] Interrupt Masking                                                               0x0:  indicates that the main interrupt output (bit [1] of the interrupts output bus) is the direct complement of the run bit in the PKA_CONTROL register,                                                0x1 : indicates that interrupt masking logic is present for this output.
Note: Reset value is undefined</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PROTECTION_OPTION</name>
              <description>[10:8] Protection Option                                                                0x0: indicates no additional protection against side channel attacks,                                                                             0x1: indicates the SCAP option                                                 0x2: Reserved                                                                    0x3: indicates the PROT option;
Note: Reset value is undefined</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PROGRAM_RAM</name>
              <description>[7:7] Program RAM                                                                   0x1: indicates sequencer program storage in RAM,               0x0: indicates sequencer program storage  in ROM.
Note: Reset value is undefined</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQUENCER_CONFIGURATION</name>
              <description>[6:5] Sequencer Configuration                                                     0x0: Reserved                                                                         0x1 : Indicates a standard sequencer                                  0x2: Reserved                                                                          0x3: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[4:2] Ignore on read</description>
              <bitWidth>3</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PKCP_CONFIGURATION</name>
              <description>[1:0] PKCP Configuration                                                       0x0 : Reserved                                                                        0x1 : Indicates a PKCP with a 16x16 multiplier,                  0x2:  indicates a PKCP with a 32x32 multiplier,                     0x3 : Reserved
Note: Reset value is undefined.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x20</resetValue>
        </register>
        <register>
          <name>FWREV</name>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <description>PKA firmware revision and capabilities register
This register allows the host access to the internal firmware revision number of the PKA Engine for software driver matching and diagnostic purposes. This register also contains a field that encodes the capabilities of the embedded firmware.
This  register is written by the firmware within a few clock cycles after starting up that firmware. The hardware reset value is zero, indicating that the information has not been written yet.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FW_CAPABILITIES</name>
              <description>[31:28] Firmware Capabilities                                                                                                                                                        4-bit binary encoding for the functionality implemented in the firmware.                                                                        0x0: indicates basic ModExp with/without CRT.               0x1: adds Modular Inversion,                                          0x2: value 2 adds Modular Inversion and ECC operations.                                                                       0x3-0xF : Reserved.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR_FW_REVISION</name>
              <description>[27:24] 4-bit binary encoding of the major firmware revision number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR_FW_REVISION</name>
              <description>[23:20] 4-bit binary encoding of the minor firmware revision number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FW_PATCH_LEVEL</name>
              <description>[19:16] 4-bit binary encoding of the firmware patch level, initial release will carry value zero
Patches are used to remove bugs without changing the functionality or interface of a module.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[15:0] Ignore on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x21500000</resetValue>
        </register>
        <register>
          <name>HWREV</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>PKA hardware revision register
This register allows the host access to the hardware revision number of the PKA engine for software driver matching and diagnostic purposes. It is always located at the highest address in the access space of the module and contains an encoding of the EIP number (with its complement as signature) for recognition of the hardware module.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Ignore on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR_HW_REVISION</name>
              <description>[27:24] 4-bit binary encoding of the major hardware revision number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR_HW_REVISION</name>
              <description>[23:20] 4-bit binary encoding of the minor hardware revision number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_PATCH_LEVEL</name>
              <description>[19:16] 4-bit binary encoding of the hardware patch level, initial release will carry value zero
Patches are used to remove bugs without changing the functionality or interface of a module.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPLEMENT_OF_BASIC_EIP_NUMBER</name>
              <description>[15:8] Bit-by-bit logic complement of bits [7:0], EIP-28 gives 0xE3</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BASIC_EIP_NUMBER</name>
              <description>[7:0] 8-bit binary encoding of the EIP number, EIP-28 gives 0x1C</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x151E31C</resetValue>
        </register>
