CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <baseAddress>0x58030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Thor1M Flash sub-system registers, includes the NoWrapper Flash Memory Controller (NW), flash read path, and an integrated Efuse controller and EFUSEROM.</description>
      <registers>
        <register>
          <name>WEPROT_B0_31_0_BY1</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEPROT_B0_31_0_BY1</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>WEPROT_AUX_BY1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WEPROT_B1_ENGR_BY1</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WEPROT_B0_ENGR_BY1</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WEPROT_B1_TRIM_BY1</name>
              <description>[3:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WEPROT_B0_TRIM_BY1</name>
              <description>[2:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WEPROT_B1_FCFG_BY1</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WEPROT_B0_CCFG_BY1</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x3F</resetValue>
        </register>
        <register>
          <name>STAT</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>NW and Efuse Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED15</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STALLSTAT</name>
              <description>[16:16] An ocp1 or ocp3 read stall has occurred.
0 : No stall or stall acknowledged by writing a 1
1 : Stall condition occurred/occurring

This is a read/write-clear status bit. It will reset to 0. It will be set when either an ocp1 or ocp3 read occurs to a bank that is presently undergoing a program or write operation.

An ocp2 write of 1 to this bit will clear the bit. The ocp2 write will take highest priority in the event an ocp1/ocp3 read is occurring concurrently to the ocp2 write.
Clearing the bit should be done only after the ongoing program/erase operation is complete indicating that both banks are free.
If clearing occurs while the stall condition persists, the field may get set back to one.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_BLANK</name>
              <description>[15:15] Efuse scanning detected if fuse ROM is blank:
0 : Not blank
1 : Blank</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSE_TIMEOUT</name>
              <description>[14:14] Efuse scanning resulted in timeout error.
0 : No Timeout error
1 : Timeout Error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SPRS_BYTE_NOT_OK</name>
              <description>[13:13] Efuse scanning resulted in scan chain Sparse byte error.
0 : No Sparse error
1 : Sparse Error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSE_ERRCODE</name>
              <description>[12:8] Same as EFUSEERROR.CODE</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:6] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>[5:4] NW FW_SMSTAT.CMD_IN_PROGRESS bit.
This flag is valid immediately after the operation setting it
0 : Not busy
1 : Busy

