CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>PUMP_TRIM_CFG_0</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:30] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VHVCT_PV</name>
              <description>[29:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VHVCT_PGM</name>
              <description>[19:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VHVCT_ERS</name>
              <description>[9:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xB4C53A</resetValue>
        </register>
        <register>
          <name>EFUSE</name>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED29</name>
              <description>[31:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INSTRUCTION</name>
              <description>[28:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED16</name>
              <description>[23:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DUMPWORD</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EFUSEADDR</name>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BLOCK</name>
              <description>[15:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ROW</name>
              <description>[10:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DATAUPPER</name>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SPARE</name>
              <description>[7:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>P</name>
              <description>[2:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>R</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EEN</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DATALOWER</name>
          <addressOffset>0x100c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EFUSECFG</name>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLEGATING</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[7:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SLAVEPOWER</name>
              <description>[4:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[2:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>GATING</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>EFUSESTAT</name>
          <addressOffset>0x1014</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESETDONE</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>ACC</name>
          <addressOffset>0x1018</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACCUMULATOR</name>
              <description>[23:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>BOUNDARY</name>
          <addressOffset>0x101c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISROW0</name>
              <description>[23:23] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE</name>
              <description>[22:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_SELF_TEST_ERROR</name>
              <description>[21:21] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_INSTRUCTION_INFO</name>
              <description>[20:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_INSTRUCTION_ERROR</name>
              <description>[19:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_AUTOLOAD_ERROR</name>
              <description>[18:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUTENABLE</name>
              <description>[17:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_ECC_SELF_TEST_EN</name>
              <description>[13:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_ECC_OVERRIDE_EN</name>
              <description>[12:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_FDI</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_DIEID_AUTOLOAD_EN</name>
              <description>[10:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_REPAIR_EN</name>
              <description>[9:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_WS_READ_STATES</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUTENABLE</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EFUSEFLAG</name>
          <addressOffset>0x1020</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EFUSEKEY</name>
          <addressOffset>0x1024</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CODE</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EFUSERELEASE</name>
          <addressOffset>0x1028</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ODPYEAR</name>
              <description>[31:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ODPMONTH</name>
              <description>[24:21] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ODPDAY</name>
              <description>[20:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSEYEAR</name>
              <description>[15:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSEMONTH</name>
              <description>[8:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSEDAY</name>
              <description>[4:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EFUSEPINS</name>
          <addressOffset>0x102c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_SELF_TEST_DONE</name>
              <description>[15:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_SELF_TEST_ERROR</name>
              <description>[14:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_ECC_SELF_TEST_EN</name>
              <description>[13:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_INSTRUCTION_INFO</name>
              <description>[12:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_INSTRUCTION_ERROR</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_AUTOLOAD_ERROR</name>
              <description>[10:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_ECC_OVERRIDE_EN</name>
              <description>[9:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_READY</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_FCLRZ</name>
              <description>[7:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_DIEID_AUTOLOAD_EN</name>
              <description>[6:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_REPAIR_EN</name>
              <description>[5:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_WS_READ_STATES</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
