CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMNW</name>
      <baseAddress>0x58032000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description></description>
      <registers>
        <register>
          <name>IIDX</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Interrupt Index Register:
The IIDX register provides the highest priority enabled interrupt index.

PSD compliant register.
Note that it is not recommended to use this register if the system clock is
running at a slower clock frequency than the NoWrapper clock.  If this is the
case, then reading this register may fail to update the RIS register correctly.
The MIS register should be read directly, and a write to ICLR should be used to
clear interrupts when this clock relationship is present.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Indicates which interrupt has fired. 0x0 means no event pending. The priority order is fixed. On each read, only one interrupt is indicated. On a read, the current interrupt (highest priority) is automatically cleared by the hardware and the corresponding interrupt flags in the RIS and MIS are cleared as well. After a read from the CPU (not from the debug interface), the register must be updated with the next highest priority interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONE</name>
                  <value>1</value>
                  <description>DONE Interrupt Pending</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_INTR</name>
                  <value>0</value>
                  <description>No Interrupt Pending</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IMASK</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Interrupt Mask Register:
The IMASK register holds the current interrupt mask settings. Masked interrupts
are read in the MIS register. PSD compliant register.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>[0:0] Interrupt mask for DONE:
0: Interrupt is disabled in MIS register
1: Interrupt is enabled in MIS register</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <value>1</value>
                  <description>Interrupt will request an interrupt service routine and corresponding bit in IPSTANDARD.MIS will be set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <value>0</value>
                  <description>Interrupt is masked out</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Raw Interrupt Status Register:
The RIS register reflects all pending interrupts, regardless of masking.
The RIS register allows the user to implement a poll scheme. A flag set in this
register can be cleared by writing a 1 to the ICLR register bit even if the
corresponding IMASK bit is not enabled. A flag can be set by software by writing
a 1 to the ISET register. Reading the IIDX register will also clear the
corresponding bit in RIS. PSD compliant register.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>[0:0] NoWrapper operation completed.
This interrupt bit is set by firmware or the corresponding bit in the ISET register.
It is cleared by the corresponding bit in in the ICLR register or reading the IIDX register when this interrupt is the highest priority.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Masked Interrupt Status Register:
The MIS register is a bit-wise AND of the contents of the IMASK and RIS
registers. This is kept mainly for ARM compatibility, and has limited use since
 the highest priority interrupt index is returned via the IIDX register.
 PSD
compliant register.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>[0:0] NoWrapper operation completed.
This masked interrupt bit reflects the bitwise AND of the corresponding RIS and IMASK bits.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Masked interrupt occurred</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>0</value>
                  <description>Masked interrupt did not occur</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ISET</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Interrupt Set Register:
The ISET register allows software to write a 1 to set corresponding interrupt.

Safety:
This meets a safety requirement to allow software diagnostics to trigger
interrupts.
PSD compliant register.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>[0:0] 0: No effect
1: Set the DONE interrupt in the RIS register</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <value>1</value>
                  <description>Set IPSTANDARD.RIS bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing a 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICLR</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Interrupt Clear Register.
The ICLR register allows allows software to write a 1 to clear corresponding
interrupt.
PSD compliant register.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>[0:0] 0: No effect
1: Clear the DONE interrupt in the RIS register</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <value>1</value>
                  <description>Clear IPSTANDARD.RIS bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <value>0</value>
                  <description>Writing a 0 has no effect</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVT_MODE</name>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <description>Event mode register. It is used to select whether each line is disabled, in
software mode (software clears the RIS) or in hardware mode (hardware
clears the RIS).</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INT0_CFG</name>
              <description>[1:0] Event line mode select for peripheral event</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <value>2</value>
                  <description>The interrupt or event line is in hardware mode. Hardware should clear the RIS.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE</name>
                  <value>1</value>
                  <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>The interrupt or event line is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>DESC</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>Hardware Version Description Register:
This register identifies the NoWrapper hardware version and feature set used.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODULEID</name>
              <description>[31:16] Module ID</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>65535</value>
                  <description>Highest possible value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Smallest value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FEATUREVER</name>
              <description>[15:12] Feature set</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>15</value>
                  <description>Maximum Value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum Value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTNUM</name>
              <description>[11:8] Instance number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>15</value>
                  <description>Highest possible value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Smallest value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAJREV</name>
              <description>[7:4] Major Revision</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>15</value>
                  <description>Highest possible value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Smallest value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINREV</name>
              <description>[3:0] Minor Revision</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>15</value>
                  <description>Highest possible value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Smallest value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xB400010</resetValue>
        </register>
        <register>
          <name>CMDEXEC</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>Command Execute Register:
Initiates execution of the command specified in the CMDTYPE register.
This register is blocked for writes after being written to 1 and prior to
STATCMD.DONE being set by the NoWrapper hardware.
NoWrapper hardware clears this register after the processing of the command
has completed.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[0:0] Command Execute value
Initiates execution of the command specified in the CMDTYPE register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXECUTE</name>
                  <value>1</value>
                  <description>Command will execute or is executing in NoWrapper</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOEXECUTE</name>
                  <value>0</value>
                  <description>Command will not execute or is not executing in NoWrapper</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CMDTYPE</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>Command Type Register
This register specifies the type of command to be executed by the NoWrapper
hardware.
This register is blocked for writes after CMDEXEC is written to a 1 and
prior to STATCMD.DONE being set by the hardware to indicate that
command execution has completed.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIZE</name>
              <description>[6:4] Command size</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK</name>
                  <value>5</value>
                  <description>Operate on an entire flash bank</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTOR</name>
                  <value>4</value>
                  <description>Operate on a flash sector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTWORD</name>
                  <value>3</value>
                  <description>Operate on 8 flash words</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURWORD</name>
                  <value>2</value>
                  <description>Operate on 4 flash words</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOWORD</name>
                  <value>1</value>
                  <description>Operate on 2 flash words</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEWORD</name>
                  <value>0</value>
                  <description>Operate on 1 flash word</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>COMMAND</name>
              <description>[2:0] Command type</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLANKVERIFY</name>
                  <value>6</value>
                  <description>Blank Verify - Check whether a flash word is in the erased state.
This command may only be used with CMDTYPE.SIZE = ONEWORD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEARSTATUS</name>
                  <value>5</value>
                  <description>Clear Status - Clear status bits in FW_SMSTAT only.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODECHANGE</name>
                  <value>4</value>
                  <description>Mode Change - Perform a mode change only, no other operation.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READVERIFY</name>
                  <value>3</value>
                  <description>Read Verify - Perform a standalone read verify operation.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE</name>
                  <value>2</value>
                  <description>Erase</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROGRAM</name>
                  <value>1</value>
                  <description>Program</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOP</name>
                  <value>0</value>
                  <description>No Operation</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
