CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>CMDCTL</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>Command Control Register
This register configures specific capabilities of the state machine for related to
the execution of a command.
This register is blocked for writes after CMDEXEC is written to a 1 and
prior to STATCMD.DONE being set by the hardware to indicate that
command execution has completed.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED22</name>
              <description>[31:22] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVEREN</name>
              <description>[21:21] Enable invalid data verify.
This checks for 0-&gt;1 transitions in the memory when
a program operation is initiated.  If such a transition is found, the program will
fail with an error without doing any programming.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSERASEDIS</name>
              <description>[20:20] Disable Stair-Step Erase.  If set, the default VHV trim voltage setting will be used
for all erase pulses.
By default, this bit is reset, meaning that the VHV voltage will be stepped during
successive erase pulses.  The step count, step voltage, begin and end voltages
are all hard-wired.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>1</value>
                  <description>Disable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0</value>
                  <description>Enable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERASEMASKDIS</name>
              <description>[19:19] Disable use of erase mask for erase
Bit masking will not be used during erase verify.  If any sectors fail the
verify either before (prever) or after (postver) the operation, then all specified
flash sectors will receive subsequent erase pulse.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>1</value>
                  <description>Disable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0</value>
                  <description>Enable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROGMASKDIS</name>
              <description>[18:18] Disable use of program mask for programming.
Bit masking will not be used during program verify.  If any bits fail the
verify either before (prever) or after (postver) the operation, then all specified
flash entries will receive subsequent program pulse.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>1</value>
                  <description>Disable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0</value>
                  <description>Enable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[17:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDRXLATEOVR</name>
              <description>[16:16] Override hardware address translation of address in CMDADDR from a
system address to a bank address and bank ID.  Use data written to
CMDADDR directly as the bank address.  Use the value written to
CMDCTL.BANKSEL directly as the bank ID.  Use the value written to
CMDCTL.REGIONSEL directly as the region ID.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE</name>
                  <value>1</value>
                  <description>Override</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOVERRIDE</name>
                  <value>0</value>
                  <description>Do not override</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POSTVEREN</name>
              <description>[15:15] Enable verify after program or erase</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREVEREN</name>
              <description>[14:14] Enable verify before program or erase.  For program, bits already programmed
to the requested value will be masked.  For erase, sectors already erased will be
masked.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED13</name>
              <description>[13:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REGIONSEL</name>
              <description>[12:9] Bank Region
A specific region ID can be written to this field to indicate to which region an
operation should be applied if CMDCTL.ADDRXLATEOVR is set.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENGR</name>
                  <value>8</value>
                  <description>Engr Region</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM</name>
                  <value>4</value>
                  <description>Trim Region</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONMAIN</name>
                  <value>2</value>
                  <description>Non-Main Region</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN</name>
                  <value>1</value>
                  <description>Main Region</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANKSEL</name>
              <description>[8:4] Bank Select
A specific Bank ID can be written to this field to indicate to which bank an
operation should be applied if CMDCTL.ADDRXLATEOVR is set.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK4</name>
                  <value>16</value>
                  <description>Bank 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK3</name>
                  <value>8</value>
                  <description>Bank 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK2</name>
                  <value>4</value>
                  <description>Bank 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK1</name>
                  <value>2</value>
                  <description>Bank 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK0</name>
                  <value>1</value>
                  <description>Bank 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODESEL</name>
              <description>[3:0] Mode
This field is only used for the Mode Change command type.  Otherwise, bank
and pump modes are set automaticlly via the NW hardware.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERASEBNK</name>
                  <value>15</value>
                  <description>Erase Bank</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMMW</name>
                  <value>14</value>
                  <description>Program Multiple Word</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASESECT</name>
                  <value>12</value>
                  <description>Erase Sector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASEVER</name>
                  <value>11</value>
                  <description>Erase Verify Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMSW</name>
                  <value>10</value>
                  <description>Program Single Word</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMVER</name>
                  <value>9</value>
                  <description>Program Verify Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG1B</name>
                  <value>7</value>
                  <description>Read Margin 1B Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG0B</name>
                  <value>6</value>
                  <description>Read Margin 0B Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG1</name>
                  <value>4</value>
                  <description>Read Margin 1 Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG0</name>
                  <value>2</value>
                  <description>Read Margin 0 Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <value>0</value>
                  <description>Read Mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xC000</resetValue>
        </register>
        <register>
          <name>CMDADDR</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>Command Address Register:
This register forms the target address of a command.  The use cases are as
follows:
1)For single-word program, this address indicates the flash bank word to be
programmed.
2)For multi-word program, this address indicates the first flash bank address
for the program.  The address will be incremented for further words.
3)For sector erase, this address indicates the sector to be erased.
4)For bank erase, the address indicates the bank to be erased.
5)For read verify, the address indications follow program/erase listed above.
Note the address written to this register will be submitted for translation to the
NoWrapper address translation interface, and the translated address
will be used to access the bank.  However, if the
CMDCTL.ADDRXLATEOVR bit is set, then the address written to this register will
be used directly as the bank address.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Address value</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CMDBYTEN</name>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <description>Command Program Byte Enable Register:
This register forms a per-byte enable for programming data.  For data bytes to
be programmed, a 1 must be written to the corresponding bit in this register.
Normally, all bits are written to 1, allowing program of full flash words.
However, leaving some bits 0 allows programming of 8-bit, 16-bit, 32-bit
or 64-bit portions of a flash word.
In addtion, the read verify command will ignore data bytes read from the flash
in its comparison if the corresponding CMDBYTEN bit is 0.
ECC data bytes are protected by the 1-2 MSB bits in this register, depending on
the presence of ECC and the flash word data width.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
This register is written to all 0 after the completion of all NoWrapper commands.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[15:0] Command Byte Enable value.
A 1-bit per flash word byte value is placed in this register.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>65535</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFF</resetValue>
        </register>
        <register>
          <name>CMDDATAINDEX</name>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <description>Command Program Data Index Register:
When multiple data registers are available for multi-word program, this register
can be written with an index which points to one of the data registers.  When
a write to CMDDATA* is done, the data will be written to the physical
data register indexed by the value in this register.
Up to 8 data registers can be present, so this register can be written with 0x0
to 0x7.  If less than 8 data registers are present, successive MSB bits of this
register are ignored when indexing the CMDDATA* registers.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[1:0] Data register index</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>3</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CMDDATA0</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>Command Data Register 0
This register forms the data for a command.
For DATAWIDTH == 128:This register represents bits 31:0 of flash word data register 0.
For DATAWIDTH == 64:This register represents bits 31:0 of flash word data register 0.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
This register is used to aggregate masking for bits that do not
require additional program pulses during program operations, and will be
written to all 1 after the completion of all NoWrapper commands.

