CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Use cases for the CMDDATA* registers are as follows:
1)Program - These registers contain the data to be programmed.
2)Erase - These registers are not used.
3)Read Verify - These registers contain data to be verified.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] A 32-bit data value is placed in this field.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDDATA1</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>Command Data Register 1
This register forms the data for a command.
For DATAWIDTH == 128:This register represents bits 63:32 of flash word data register 0.
For DATAWIDTH == 64:This register represents bits 63:32 of flash word data register 0.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to CMDSTAT.DONE being set by the NoWrapper
hardware.
This register is used to aggregate masking for bits that do not
require additional program pulses during program operations, and will be
written to all 1 after the completion of all NoWrapper commands.

Use cases for the CMDDATA* registers are as follows:
1)Program - These registers contain the data to be programmed.
2)Erase - These registers are not used.
3)Read Verify - These registers contain data to be verified.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] A 32-bit data value is placed in this field.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDDATA2</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>Command Data Register 2
This register forms the data for a command.
For DATAWIDTH == 128:This register represents bits 95:64 of flash word data register 0.
For DATAWIDTH == 64:This register represents bits 31:0 of flash word data register 1.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
This register is used to aggregate masking for bits that do not
require additional program pulses during program operations, and will be
written to all 1 after the completion of all NoWrapper commands.

Use cases for the CMDDATA* registers are as follows:
1)Program - These registers contain the data to be programmed.
2)Erase - These registers are not used.
3)Read Verify - These registers contain data to be verified.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] A 32-bit data value is placed in this field.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDDATA3</name>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <description>Command Data Register 3
This register forms the data for a command.
For DATAWIDTH == 128:This register represents bits 127:96 of flash word data register 0.
For DATAWIDTH == 64:This register represents bits 63:32 of flash word data register 1.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
This register is used to aggregate masking for bits that do not
require additional program pulses during program operations, and will be
written to all 1 after the completion of all NoWrapper commands.

Use cases for the CMDDATA* registers are as follows:
1)Program - These registers contain the data to be programmed.
2)Erase - These registers are not used.
3)Read Verify - These registers contain data to be verified.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] A 32-bit data value is placed in this field.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDDATA4</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>Command Data Register 4
This register forms the data for a command.
For DATAWIDTH == 128:This register represents bits 31:0 of flash word data register 1.
For DATAWIDTH == 64:This register represents bits 31:0 of flash word data register 2.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
This register is used to aggregate masking for bits that do not
require additional program pulses during program operations, and will be
written to all 1 after the completion of all NoWrapper commands.

