CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Use cases for the CMDDATA* registers are as follows:
1)Program - These registers contain the data to be programmed.
2)Erase - These registers are not used.
3)Read Verify - These registers contain data to be verified.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] A 32-bit data value is placed in this field.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDDATA13</name>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <description>Command Data Register 13

This register forms the data for a command.
For DATAWIDTH == 128:This register represents bits 63:32 of flash word data register 3.
For DATAWIDTH == 64:This register represents bits 63:32 of flash word data register 6.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
This register is used to aggregate masking for bits that do not
require additional program pulses during program operations, and will be
written to all 1 after the completion of all NoWrapper commands.

Use cases for the CMDDATA* registers are as follows:
1)Program - These registers contain the data to be programmed.
2)Erase - These registers are not used.
3)Read Verify - These registers contain data to be verified.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] A 32-bit data value is placed in this field.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDDATA14</name>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <description>Command Data Register 14
This register forms the data for a command.
For DATAWIDTH == 128:This register represents bits 95:64 of flash word data register 3.
For DATAWIDTH == 64:This register represents bits 31:0 of flash word data register 7.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
This register is used to aggregate masking for bits that do not
require additional program pulses during program operations, and will be
written to all 1 after the completion of all NoWrapper commands.

Use cases for the CMDDATA* registers are as follows:
1)Program - These registers contain the data to be programmed.
2)Erase - These registers are not used.
3)Read Verify - These registers contain data to be verified.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] A 32-bit data value is placed in this field.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDDATA15</name>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <description>Command Data Register 15
This register forms the data for a command.
For DATAWIDTH == 128:This register represents bits 127:96 of flash word data register 3.
For DATAWIDTH == 64:This register represents bits 63:32 of flash word data register 7.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
This register is used to aggregate masking for bits that do not
require additional program pulses during program operations, and will be
written to all 1 after the completion of all NoWrapper commands.

Use cases for the CMDDATA* registers are as follows:
1)Program - These registers contain the data to be programmed.
2)Erase - These registers are not used.
3)Read Verify - These registers contain data to be verified.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] A 32-bit data value is placed in this field.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDWEPROTA</name>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <description>Command WriteErase Protect A Register
This register allows the first 32 sectors of the main region to be protected from
program or erase, with 1 bit protecting each sector.  If the main region size is smaller than 32
sectors, then this register provides protection for the whole region.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
In addition, this register is used to aggregate masking for sectors that do not
require additional erase pulses during bank erase operations, and will be
written to all 1 after the completion of all NoWrapper commands.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Each bit protects 1 sector.

bit [0]:When 1, sector 0 of the flash memory will be protected from program
and erase.
bit [1]:When 1, sector 1 of the flash memory will be protected from program
and erase.
:
:
bit [31]:When 1, sector 31 of the flash memory will be protected from program
and erase.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDWEPROTB</name>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <description>Command WriteErase Protect B Register
This register allows main region sectors to be protected from program and
erase.  Each bit corresponds to a group of 8 sectors.
There are 3 cases for how these protect bits are applied:
1. Single-bank system:
    In the case where only a single flash bank is present,
    the first 32 sectors are protected via the CMDWEPROTA register.  Thus, the
    protection give by the bits in CMDWEPROTB begin with sector 32.
2. Multi-bank system, Bank 0:
    When multiple flash banks are present, the first
    32 sectors of bank 0 are protected via the CMDWEPROTA register.  Thus, only
    bits 4 and above of CMDWEPROTB would be applicable to bank 0.  The protection of
    bit 4 and above would begin at sector 32.  Bits 3:0
    of WEPROTB are ignored for bank 0.
3. Multi-bank system, Banks 1-N:
    For banks other than bank 0 in a multi-bank system, CMDWEPROTA has
    no effect, so the bits in CMDWEPROTB will protect these banks starting
    from sector 0.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
In addition, this register is used to aggregate masking for sectors that do not
require additional erase pulses during bank erase operations, and will be
written to all 1 after the completion of all NoWrapper commands.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>[31:0] Each bit protects a group of 8 sectors.  When a bit is 1, the associated 8 sectors
in the flash will be protected from program and erase.  A maximum of 256
sectors can be protected with this register.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4294967295</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CMDWEPROTNM</name>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <description>Command WriteErase Protect Non-Main
 Register
This register allows non-main region region sectors to be protected
from program and erase.  Each bit corresponds to 1 sector.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
In addition, this register is used to aggregate masking for sectors that do not
require additional erase pulses during bank erase operations, and will be
written to all 1 after the completion of all NoWrapper commands.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[0:0] Each bit protects 1 sector.

bit [0]:When 1, sector 0 of the non-main region will be protected from program
and erase.
bit [1]:When 1, sector 1 of the non-main region will be protected from program
and erase.
:
:
bit [31]:When 1, sector 31 of the non-main will be protected from program
and erase.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>1</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>CMDWEPROTTR</name>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <description>Command WriteErase Protect Trim
 Register
This register allows trim region sectors to be protected
from program and erase.  Each bit corresponds to 1 sector.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
In addition, this register is used to aggregate masking for sectors that do not
require additional erase pulses during bank erase operations, and will be
written to all 1 after the completion of all NoWrapper commands.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[0:0] Each bit protects 1 sector.

bit [0]:When 1, sector 0 of the engr region will be protected from program
and erase.
bit [1]:When 1, sector 1 of the engr region will be protected from program
and erase.
:
:
bit [31]:When 1, sector 31 of the engr region will be protected from program
and erase.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>1</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>CMDWEPROTEN</name>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <description>Command WriteErase Protect Engr
 Register
This register allows engr region sectors to be protected
from program and erase.  Each bit corresponds to 1 sector.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.
In addition, this register is used to aggregate masking for sectors that do not
require additional erase pulses during bank erase operations, and will be
written to all 1 after the completion of all NoWrapper commands.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[0:0] Each bit protects 1 sector.

bit [0]:When 1, sector 0 of the engr region will be protected from program
and erase.
bit [1]:When 1, sector 1 of the engr region will be protected from program
and erase.
:
:
bit [31]:When 1, sector 31 of the engr region will be protected from program
and erase.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>1</value>
                  <description>Maximum value of VAL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value of VAL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>CFGCMD</name>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <description>Command Configuration Register
This register configures specific capabilities of the state machine for related to
the execution of a command.
This register is blocked for writes after CMDEXEC is written to a 1 and
prior to STATCMD.DONE being set by the hardware to indicate that
command execution has completed.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WAITSTATE</name>
              <description>[3:0] Wait State setting for program verify, erase verify and read verify</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>15</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2</resetValue>
        </register>
        <register>
          <name>CFGPCNT</name>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <description>Pulse Counter Configuration Register
This register allows further configuration of maximum pulse counts for
program and erase operations.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAXPCNTVAL</name>
              <description>[11:4] Override maximum pulse counter with this value.
If MAXPCNTOVR = 0, then this field is ignored.
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 0, then this value will be used
to override the max pulse count for both program and erase.  Full max value
will be {4'h0, MAXPCNTVAL} .
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 1, then this value will be used
to override the max pulse count for program only.  Full max value will be
{4'h0, MAXPCNTVAL}.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>255</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAXPCNTOVR</name>
              <description>[0:0] Override hard-wired maximum pulse count.  If MAXERSPCNTOVR
is not set, then setting this value alone will override the max pulse count for
both program and erase.  If MAXERSPCNTOVR is set, then this bit will only
control the max pulse count setting for program.
By default, this bit is 0, and a hard-wired max pulse count is used.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE</name>
                  <value>1</value>
                  <description>Use value from MAXPCNTVAL field as maximum puse count</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <value>0</value>
                  <description>Use hard-wired (default) value for maximum pulse count</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
