CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>STATCMD</name>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <description>Command Status Register
This register contains status regarding completion and errors of command
execution.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED13</name>
              <description>[31:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>19</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FAILMISC</name>
              <description>[12:12] Command failed due to error other than write/erase protect violation or verify
error.  This is an extra bit in case a new failure mechanism is added which
requires a status bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFAIL</name>
                  <value>1</value>
                  <description>Fail</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATNOFAIL</name>
                  <value>0</value>
                  <description>No Fail</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAILINVDATA</name>
              <description>[8:8] Program command failed because an attempt was made to program a stored
0 value to a 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFAIL</name>
                  <value>1</value>
                  <description>Fail</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATNOFAIL</name>
                  <value>0</value>
                  <description>No Fail</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAILMODE</name>
              <description>[7:7] Command failed because a bank has been set to a mode other than READ.
Program and Erase commands cannot be initiated unless all banks are in READ
mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFAIL</name>
                  <value>1</value>
                  <description>Fail</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATNOFAIL</name>
                  <value>0</value>
                  <description>No Fail</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAILILLADDR</name>
              <description>[6:6] Command failed due to the use of an illegal address</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFAIL</name>
                  <value>1</value>
                  <description>Fail</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATNOFAIL</name>
                  <value>0</value>
                  <description>No Fail</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAILVERIFY</name>
              <description>[5:5] Command failed due to verify error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFAIL</name>
                  <value>1</value>
                  <description>Fail</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATNOFAIL</name>
                  <value>0</value>
                  <description>No Fail</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAILWEPROT</name>
              <description>[4:4] Command failed due to Write/Erase Protect Sector Violation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFAIL</name>
                  <value>1</value>
                  <description>Fail</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATNOFAIL</name>
                  <value>0</value>
                  <description>No Fail</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CMDINPROGRESS</name>
              <description>[2:2] Command In Progress</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATINPROGRESS</name>
                  <value>1</value>
                  <description>In Progress</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATCOMPLETE</name>
                  <value>0</value>
                  <description>Complete</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDPASS</name>
              <description>[1:1] Command Pass - valid when CMD_DONE field is 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATPASS</name>
                  <value>1</value>
                  <description>Pass</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFAIL</name>
                  <value>0</value>
                  <description>Fail</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDDONE</name>
              <description>[0:0] Command Done</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATDONE</name>
                  <value>1</value>
                  <description>Done</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATNOTDONE</name>
                  <value>0</value>
                  <description>Not Done</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STATADDR</name>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <description>Current Address Counter Value
Read only register giving read access to the state machine current address.
A bank id, region id and address are stored in this register and are incremented as
necessary during execution of a command.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED26</name>
              <description>[31:26] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BANKID</name>
              <description>[25:21] Current Bank ID
A bank indicator is stored in this register which represents the current bank on
which the state  machine is operating.  There is 1 bit per bank.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK4</name>
                  <value>16</value>
                  <description>Bank 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK3</name>
                  <value>8</value>
                  <description>Bank 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK2</name>
                  <value>4</value>
                  <description>Bank 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK1</name>
                  <value>2</value>
                  <description>Bank 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK0</name>
                  <value>1</value>
                  <description>Bank 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGIONID</name>
              <description>[20:16] Current Region ID
A region indicator is stored in this register which represents the current flash
region on which the state  machine is operating.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENGR</name>
                  <value>8</value>
                  <description>Engr Region</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM</name>
                  <value>4</value>
                  <description>Trim Region</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONMAIN</name>
                  <value>2</value>
                  <description>Non-Main Region</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN</name>
                  <value>1</value>
                  <description>Main Region</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANKADDR</name>
              <description>[15:0] Current Bank Address
A bank offset address is stored in this register.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>65535</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x200000</resetValue>
        </register>
        <register>
          <name>STATPCNT</name>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <description>Current Pulse Count Register:
Read only register giving read access to the state machine current pulse count
value for program/erase operations.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PULSECNT</name>
              <description>[11:0] Current Pulse Counter Value</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4095</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STATMODE</name>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <description>Mode Status Register
Indicates any banks which not in READ mode, and it indicates the mode
which the bank(s) are in.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>BANK1TRDY</name>
              <description>[17:17] Bank 1T Ready.
Bank(s) are ready for 1T access.  This is accomplished when the bank and pump
have been trimmed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRUE</name>
                  <value>1</value>
                  <description>Ready</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALSE</name>
                  <value>0</value>
                  <description>Not ready</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK2TRDY</name>
              <description>[16:16] Bank 2T Ready.
Bank(s) are ready for 2T access.  This is accomplished when the pump has
fully driven power rails to the bank(s).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRUE</name>
                  <value>1</value>
                  <description>Ready</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALSE</name>
                  <value>0</value>
                  <description>Not ready</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANKMODE</name>
              <description>[11:8] Indicates mode of bank(s) that are not in READ mode</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERASEBNK</name>
                  <value>15</value>
                  <description>Erase Bank</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMMW</name>
                  <value>14</value>
                  <description>Program Multiple Word</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASESECT</name>
                  <value>12</value>
                  <description>Erase Sector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASEVER</name>
                  <value>11</value>
                  <description>Erase Verify Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMSW</name>
                  <value>10</value>
                  <description>Program Single Word</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMVER</name>
                  <value>9</value>
                  <description>Program Verify Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG1B</name>
                  <value>7</value>
                  <description>Read Margin 1B Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG0B</name>
                  <value>6</value>
                  <description>Read Margin 0B Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG1</name>
                  <value>4</value>
                  <description>Read Margin 1 Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG0</name>
                  <value>2</value>
                  <description>Read Margin 0 Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <value>0</value>
                  <description>Read Mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BANKNOTINRD</name>
              <description>[4:0] Bank not in read mode.
Indicates which banks are not in READ mode.  There is 1 bit per bank.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK4</name>
                  <value>16</value>
                  <description>Bank 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK3</name>
                  <value>8</value>
                  <description>Bank 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK2</name>
                  <value>4</value>
                  <description>Bank 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK1</name>
                  <value>2</value>
                  <description>Bank 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK0</name>
                  <value>1</value>
                  <description>Bank 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GBLINFO0</name>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <description>Global Info 0 Register
Read only register detailing information about sector size and number of banks
present.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>NUMBANKS</name>
              <description>[18:16] Number of banks instantiated
Minimum:1
Maximum:5</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>5</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>1</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECTORSIZE</name>
              <description>[15:0] Sector size in bytes</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOKB</name>
                  <value>2048</value>
                  <description>Sector size is TWOKB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEKB</name>
                  <value>1024</value>
                  <description>Sector size is ONEKB</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x20800</resetValue>
        </register>
