CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>GBLINFO1</name>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <description>Global Info 1 Register
Read only register detailing information about data, ecc and redundant data
widths in bits.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED19</name>
              <description>[31:19] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>13</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REDWIDTH</name>
              <description>[18:16] Redundant data width in bits</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W4BIT</name>
                  <value>4</value>
                  <description>Redundant data width is 4 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W2BIT</name>
                  <value>2</value>
                  <description>Redundant data width is 2 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W0BIT</name>
                  <value>0</value>
                  <description>Redundant data width is 0.  Redundancy/Repair not present.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCWIDTH</name>
              <description>[12:8] ECC data width in bits</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W16BIT</name>
                  <value>16</value>
                  <description>ECC data width is 16 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W8BIT</name>
                  <value>8</value>
                  <description>ECC data width is 8 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W0BIT</name>
                  <value>0</value>
                  <description>ECC data width is 0.  ECC not used.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAWIDTH</name>
              <description>[7:0] Data width in bits</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W128BIT</name>
                  <value>128</value>
                  <description>Data width is 128 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W64BIT</name>
                  <value>64</value>
                  <description>Data width is 64 bits</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x40080</resetValue>
        </register>
        <register>
          <name>GBLINFO2</name>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <description>Global Info 2 Register
Read only register detailing information about the number of data registers
present.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAREGISTERS</name>
              <description>[3:0] Number of data registers present.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>8</value>
                  <description>Maximum value of DATAREGISTERS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>1</value>
                  <description>Minimum value of DATAREGISTERS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x4</resetValue>
        </register>
        <register>
          <name>BANK0INFO0</name>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <description>Bank Info 0 Register for bank 0.
Read only register detailing information about Main region size in the bank.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAINSIZE</name>
              <description>[11:0] Main region size in sectors
Minimum:0x8 (8)
Maximum:0x200 (512)</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <value>512</value>
                  <description>Maximum value of MAINSIZE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <value>8</value>
                  <description>Minimum value of MAINSIZE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x100</resetValue>
        </register>
        <register>
          <name>BANK0INFO1</name>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <description>Bank Info1 Register for bank 0.
Read only register detailing information about Non-Main, Trim, and Engr
region sizes in the bank.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ENGRSIZE</name>
              <description>[23:16] Engr region size in sectors
Minimum:0x0 (0)
Maximum:0x10 (16)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <value>32</value>
                  <description>Maximum value of ENGRSIZE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <value>0</value>
                  <description>Minimum value of ENGRSIZE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMSIZE</name>
              <description>[15:8] Trim region size in sectors
Minimum:0x0 (0)
Maximum:0x10 (16)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <value>32</value>
                  <description>Maximum value of TRIMSIZE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <value>0</value>
                  <description>Minimum value of TRIMSIZE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NONMAINSIZE</name>
              <description>[7:0] Non-main region size in sectors
Minimum:0x0 (0)
Maximum:0x10 (16)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <value>32</value>
                  <description>Maximum value of NONMAINSIZE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <value>0</value>
                  <description>Minimum value of NONMAINSIZE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x10101</resetValue>
        </register>
        <register>
          <name>BANK1INFO0</name>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <description>Bank Info 0 Register for bank 1.
Read only register detailing information about Main region size in the bank.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAINSIZE</name>
              <description>[11:0] Main region size in sectors
Minimum:0x8 (8)
Maximum:0x200 (512)</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <value>512</value>
                  <description>Maximum value of MAINSIZE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <value>8</value>
                  <description>Minimum value of MAINSIZE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x100</resetValue>
        </register>
        <register>
          <name>BANK1INFO1</name>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <description>Bank Info1 Register for bank 1.
Read only register detailing information about Non-Main, Trim, and Engr
region sizes in the bank.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ENGRSIZE</name>
              <description>[23:16] Engr region size in sectors
Minimum:0x0 (0)
Maximum:0x10 (16)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <value>32</value>
                  <description>Maximum value of ENGRSIZE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <value>0</value>
                  <description>Minimum value of ENGRSIZE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMSIZE</name>
              <description>[15:8] Trim region size in sectors</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <value>32</value>
                  <description>Maximum value of TRIMSIZE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <value>0</value>
                  <description>Minimum value of TRIMSIZE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NONMAINSIZE</name>
              <description>[7:0] Non-main region size in sectors</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <value>32</value>
                  <description>Maximum value of NONMAINSIZE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <value>0</value>
                  <description>Minimum value of NONMAINSIZE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x10101</resetValue>
        </register>
        <register>
          <name>DFTEN</name>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <description>DFT Enable Register
Allows control of NoWrapper test features.  When set, DFT* registers in this
aperture open for write access.  When cleared, DFT* registers are read-only.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Enable Test Features</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <value>1</value>
                  <description>Command</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <value>0</value>
                  <description>Command</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
