CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>DFTCMDCTL</name>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <description>DFT Command Control Register
This register configures specific capabilities for test.
This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTBMUXSEL</name>
              <description>[31:28] DTB Mux Select
This field will form the select for the primary DTB mux.  This mux selects up to
16 sets of 32-bit fields of internal signals to be present to the 32-bit DTB output.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>15</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED21</name>
              <description>[27:21] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STOPVERONFAIL</name>
              <description>[20:20] Stop read verify on fail.  If this bit is set, read verify will halt when the first verify
fail is detected.  If command is program or erase, another program or erase
pulse will be executed.  If command is read verify, comand will terminate.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODDROWINVDATA</name>
              <description>[18:18] Invert data at odd row addresses for program or verify.  The LSB of the row
address is bit [4] of the bank address.  This bit only applies when pattern data
is used; i.e. the DATAPATEN bit is set.  It will have no effect if CMDDATA is used.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVERT</name>
                  <value>1</value>
                  <description>Use inverted data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <value>0</value>
                  <description>Use true data</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODDWORDINVDATA</name>
              <description>[17:17] Invert data at odd bank addresses for program or verify. This bit only applies
when pattern data is used; i.e. the DATAPATEN bit is set.  It will have no effect
if CMDDATA is used.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVERT</name>
                  <value>1</value>
                  <description>Use inverted data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <value>0</value>
                  <description>Use true data</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALWAYSINVDATA</name>
              <description>[16:16] Invert data always for program or verify.  This bit only applies when pattern data
is used; i.e. the DATAPATEN bit is set.  It will have no effect if CMDDATA is used.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVERT</name>
                  <value>1</value>
                  <description>Use inverted data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <value>0</value>
                  <description>Use true data</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAPATSEL</name>
              <description>[15:13] Select data pattern.  Valid when DATAPATEN bit is set to 1.  Overrides CMDDATA
registers for program or verify.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGCHKBRD</name>
                  <value>2</value>
                  <description>Set to logical checkerboard (0x01010101...)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL1</name>
                  <value>1</value>
                  <description>Set to all 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL0</name>
                  <value>0</value>
                  <description>Set to all 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAPATEN</name>
              <description>[12:12] Enable data pattern.  Data pattern select in DATAPATSEL field will override data
from CMDDATA registers for use as program or verify data.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[11:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PULSECNTLDDIS</name>
              <description>[9:9] Override pulse counter enable.
When set, the state machine pulse counter will not be loaded when a
command is initiated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>1</value>
                  <description>Disable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0</value>
                  <description>Enable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRCNTLDDIS</name>
              <description>[8:8] Override address counter enable.
When set, the state machine address counter will not be loaded when a
command is initiated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>1</value>
                  <description>Disable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0</value>
                  <description>Enable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[7:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REDMATCHFORCE</name>
              <description>[5:5] Force redundancy match.  If set to 1, repair configuration encoded in the flash
bank trim will be forced for every access.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REDMATCHDIS</name>
              <description>[4:4] Disable redundancy matching.  Any repair configuration encoded into the
bank trim bits is disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>1</value>
                  <description>Disable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0</value>
                  <description>Enable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AMX2TDIS</name>
              <description>[2:2] 2T address mux disable control. When set to 1 2T address shifting is
disabled.  This bit should only be enabled for reads.  Indeterminate behavior
will result if this bit is set during program/erase.  Furthermore, only reads done
via a READVERIFY command will be guaranteed to work properly.  Reads via
the FBAP port are not guaranteed to operate.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>1</value>
                  <description>Disable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0</value>
                  <description>Enable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE2TEN</name>
              <description>[1:1] Force 2T Enable - Force 2T access to regions that are designated as 1T.  Regions
designated as 2T will still be accessed as 2T.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE1TEN</name>
              <description>[0:0] Force 1T Enable - Force 1T access to regions that are designated as 2T.  Regions
designated as 1T will still be accessed as 1T.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
