CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>DFTTIMERCTL</name>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <description>DFT Timer Control Register
This allows some configuration of timing values for various phases of flash
operations for test.  These time values are hard-coded for functional execution.
This register is only writable when DFT.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED31</name>
              <description>[31:31] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMERCLOCKOVR</name>
              <description>[30:28] Override Timer clock frequency using an ICG-based clock divide mechanism.
To divide the timer clock, pulses can be skipped based on settings in this field.
By default, this field is 0, which corresponds to no division on the timer clock.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDEBY8</name>
                  <value>7</value>
                  <description>Divide timer clock by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDEBY7</name>
                  <value>6</value>
                  <description>Divide timer clock by 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDEBY6</name>
                  <value>5</value>
                  <description>Divide timer clock by 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDEBY5</name>
                  <value>4</value>
                  <description>Divide timer clock by 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDEBY4</name>
                  <value>3</value>
                  <description>Divide timer clock by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDEBY3</name>
                  <value>2</value>
                  <description>Divide timer clock by 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDEBY2</name>
                  <value>1</value>
                  <description>Divide timer clock by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NODIVIDE</name>
                  <value>0</value>
                  <description>No divide on timer clock.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEPULSETIMEVAL</name>
              <description>[27:12] Program/Erase Pulse Time Value
If operation is a program, this value gets loaded into bits [15:0] of the timer
when the PEPULSETIMEVALOVR field is set to 1.
If operation is an erase, this value gets loaded into bits [19:4] of the timer
when the PEPULSETIMEVALOVR field is set to 1.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>65535</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>1</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[11:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PEPULSETIMEOVR</name>
              <description>[8:8] Override Program/Erase Pulse Time
If set, this will force the program or erase pulse time to be overridden with the
value in the PEPULSETIMEVAL field.  If not set, then a hard-coded value will be
used for this pulse time.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE</name>
                  <value>1</value>
                  <description>Use value from the PE_PULSE_TIME field for time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READMODETIME</name>
              <description>[7:7] Read Mode Change Time</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOXFUNCTIONAL</name>
                  <value>1</value>
                  <description>Use 2x the hard-wired (functional) time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEVHOLDTIME</name>
              <description>[6:6] Program/Erase Verify Hold Time</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOXFUNCTIONAL</name>
                  <value>1</value>
                  <description>Use 2x the hard-wired (functional) time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEVSETUPTIME</name>
              <description>[5:5] Program/Erase Verify Setup Time</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOXFUNCTIONAL</name>
                  <value>1</value>
                  <description>Use 2x the hard-wired (functional) time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEVMODETIME</name>
              <description>[4:4] Program/Erase Verify Mode Change Time</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOXFUNCTIONAL</name>
                  <value>1</value>
                  <description>Use 2x the hard-wired (functional) time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEHOLDTIME</name>
              <description>[3:3] Program/Erase Hold Time</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOXFUNCTIONAL</name>
                  <value>1</value>
                  <description>Use 2x the hard-wired (functional) time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPVWORDLINETIME</name>
              <description>[2:2] Program and Program Verify Wordline Switching Time</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOXFUNCTIONAL</name>
                  <value>1</value>
                  <description>Use 2x the hard-wired (functional) time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVHVSETUPTIME</name>
              <description>[1:1] Program VHV Setup Time</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOXFUNCTIONAL</name>
                  <value>1</value>
                  <description>Use 2x the hard-wired (functional) time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PESETUPTIME</name>
              <description>[0:0] Program/Erase Setup Time</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWOXFUNCTIONAL</name>
                  <value>1</value>
                  <description>Use 2x the hard-wired (functional) time value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNCTIONAL</name>
                  <value>0</value>
                  <description>Use hard-wired (Functional) timer value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DFTEXECZCTL</name>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <description>DFT EXECUTEZ control register.  This register allows direct control of the
EXECUTEZ to bank and pump for test.
This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EXEZ_OVR</name>
              <description>[1:1] Override value to be applied to EXECUTEZ</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <value>1</value>
                  <description>Set EXECUTEZ to 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <value>0</value>
                  <description>Set EXECUTEZ to 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXEZOVREN</name>
              <description>[0:0] Enable override of EXECUTEZ
Note that when this bit is set, NoWrapper has control of the bank pins.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2</resetValue>
        </register>
        <register>
          <name>DFTPCLKTESTCTL</name>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <description>DFT Pump Clock Test Control Register.  This register controls hardware features
that allow the pump clock to be characterized for trim development.
This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Enable the state machine which sequences measurement of pump clock
frequency.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DFTPCLKTESTSTAT</name>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <description>DFT Pump Clock Test Status Register.  This register shows status reported by the
hardware features that allow the pump clock to be characterized for trim
development.
This register is only writable when DFTEN.ENABLE is set.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLOCKCNT</name>
              <description>[15:4] Indicates the core clock count captured during the pump clock measurement.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>4095</value>
                  <description>Maximum count value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum count value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>[0:0] Indicates that a pump clock measurement is in progress.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPROGRESS</name>
                  <value>1</value>
                  <description>Indicates test in progress</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE</name>
                  <value>0</value>
                  <description>Indicates test complete</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DFTDATARED0</name>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <description>DFT Redundancy Data Register 0
This register is used when testing the redundant columns in the flash.  It acts
as an extension of the CMDDATA* registers.  The bits in this register correspond
to flash data word register 0.
In addition, this register is used to aggregate masking for bits that do not
require additional program pulses during program operations.  The original
data written to this register will be lost during program command execution.

Use cases for this register are as follows:
1)Program - Contains the data to be programmed.
2)Erase - Not used.
3)Read Verify - Contains data to be verified.

This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[3:0] Data for redundant bits</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>DFTDATARED1</name>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <description>DFT Redundancy Data Register 1
This register is used when testing the redundant columns in the flash.  It acts
as an extension of the CMDDATA* registers.  The bits in this register correspond
to flash data word register 1.
In addition, this register is used to aggregate masking for bits that do not
require additional program pulses during program operations.  The original
data written to this register will be lost during program command execution.

Use cases for this register are as follows:
1)Program - Contains the data to be programmed.
2)Erase - Not used.
3)Read Verify - Contains data to be verified.

This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[3:0] Data for redundant bits</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>DFTDATARED2</name>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <description>DFT Redundancy Data Register 2
This register is used when testing the redundant columns in the flash.  It acts
as an extension of the CMDDATA* registers.  The bits in this register correspond
to flash data word register 2.
In addition, this register is used to aggregate masking for bits that do not
require additional program pulses during program operations.  The original
data written to this register will be lost during program command execution.

Use cases for this register are as follows:
1)Program - Contains the data to be programmed.
2)Erase - Not used.
3)Read Verify - Contains data to be verified.

