CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[3:0] Data for redundant bits</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>DFTDATARED3</name>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <description>DFT Redundancy Data Register 3
This register is used when testing the redundant columns in the flash.  It acts
as an extension of the CMDDATA* registers.  The bits in this register correspond
to flash data word register 3.
In addition, this register is used to aggregate masking for bits that do not
require additional program pulses during program operations.  The original
data written to this register will be lost during program command execution.

Use cases for this register are as follows:
1)Program - Contains the data to be programmed.
2)Erase - Not used.
3)Read Verify - Contains data to be verified.

This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <description>[3:0] Data for redundant bits</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>DFTPUMPCTL</name>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <description>DFT Pump Control Register
This allows some configuration of pump parameters during test.
This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED19</name>
              <description>[31:19] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>13</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IREFEVCTL</name>
              <description>[18:16] IREFEV control IREFVRD, REFTC, IREFCONST, IREFCCOR blocks in IREFEV</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CONFIGPMP</name>
              <description>[15:12] Pump configuration control. LP, HP operation</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[11:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SSEN</name>
              <description>[9:9] Dither control for oscillator
Enumeration:
0: Disable Dither
1: Enable Dither</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Enable</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                  <description>Disable</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUMPCLKEN</name>
              <description>[8:8] Allows direct control of the pump oscillator which is used to generate pumpclk.
Normally, enable/disable of pumpclk is under NoWrapper state machine
control.  This bit allows system to enable the clock independently.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>1</value>
                  <description>Force pump clock oscillator to be enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWCTL</name>
                  <value>0</value>
                  <description>Allow pump clock oscillator to be controlled by hardware.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TCR</name>
              <description>[6:0] TCR test mode to be applied to the pump</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>127</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1000</resetValue>
        </register>
        <register>
          <name>DFTBANKCTL</name>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <description>DFT Bank Control Register
This allows some configuration of bank parameters during test.
This register is only writable when DFTEN.ENABLE is set.
This register is blocked for writes after a 1 is written to the CMDEXEC
register and prior to STATCMD.DONE being set by the NoWrapper
hardware.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEZ</name>
              <description>[8:8] When set, TEZ is asserted to the flash banks.  Which banks get the asserted
signal is determined by the BANKSELECT field in CMDCTL.
0x0 Do no assert TEZ
0x1 Assert TEZ</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEGATE</name>
                  <value>1</value>
                  <description>Do not assert TEZ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERT</name>
                  <value>0</value>
                  <description>Assert TEZ</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TCR</name>
              <description>[6:0] TCR test mode to be applied to the bank</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <value>127</value>
                  <description>Maximum value</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM</name>
                  <value>0</value>
                  <description>Minimum value</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x100</resetValue>
        </register>
