CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SRAM_MMR</name>
      <baseAddress>0x58035000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>General Purpose RAM</description>
      <registers>
        <register>
          <name>PER_CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Parity Error Control
Parity error check controls</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_DISABLE</name>
              <description>[8:8] Parity Status Disable

0: A parity error will update PER_CHK.PER_ADDR field
1: Parity error does not update PER_CHK.PER_ADDR field</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PER_DEBUG_ENABLE</name>
              <description>[0:0] Parity Error Debug Enable

0: Normal operation
1: An address offset can be written to PER_DBG.PER_DEBUG_ADDR and parity errors will be generated on reads from within this offset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PER_CHK</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Parity Error Check
Parity error check results</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_ADDR</name>
              <description>[23:0] Parity Error Address Offset
Returns the last address offset which resulted in a parity error during an SRAM read. The address offset returned is always the word-aligned address that contains the location with the parity error. For parity faults on non word-aligned accesses, CPU_SCS:BFAR.ADDRESS will hold the address of the location that resulted in parity error.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PER_DBG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Parity Error Debug
Parity error check debug address setting</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_DEBUG_ADDR</name>
              <description>[23:0] Debug Parity Error Address Offset
When PER_CTL.PER_DEBUG is 1, this field is used to set a parity debug address offset. The address offset must be a word-aligned address. Writes within this address offset will force incorrect parity bits to be stored together with the data written. The following reads within this same address offset will thus result in parity errors to be generated.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MEM_CTL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Memory Control
Controls memory initialization</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEM_SEL</name>
              <description>[31:8] Memory Instance Select

This field is used to enable/disable initialization of each SRAM instance when triggered using MEM_CTL.MEM_CLR_EN. Each bit corresponds to the respective SRAM instance.

bit[x]:
0: Initialization of instance x is disabled
1: Initialization of instance x is enabled</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_BUSY</name>
              <description>[1:1] Memory Busy status

0: Memory accepts transfers
1: Memory controller is busy during initialization. Read and write transfers are not performed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_CLR_EN</name>
              <description>[0:0] Memory Contents Initialization enable

Writing 1 to MEM_CLR_EN will start memory initialization. The contents of all byte locations will be initialized to 0x00. MEM_BUSY will be 1 until memory initialization has completed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MEM_STA</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Memory Status
Controls memory initialization</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEM_STA</name>
              <description>[31:8] Memory Instance Status

This field gives the current status of each SRAM instance. When an instance is being initialized the corresponding bit is set to 1, 0 otherwise.

bit[x]:
0 : Instance x is in normal mode
1 : Instance x is getting initialized</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
