CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PRCM</name>
      <baseAddress>0x58082000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Power, Reset and Clock Management</description>
      <registers>
        <register>
          <name>INFRCLKDIVR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Infrastructure Clock Division Factor For Run Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RATIO</name>
              <description>[1:0] Division rate for clocks driving modules in the MCU_AON domain when system CPU is in run mode. Division ratio affects both infrastructure clock and perbusull clock.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV32</name>
                  <value>3</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <value>2</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>1</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <value>0</value>
                  <description>Divide by 1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>INFRCLKDIVS</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Infrastructure Clock Division Factor For Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RATIO</name>
              <description>[1:0] Division rate for clocks driving modules in the MCU_AON domain when system CPU is in sleep mode. Division ratio affects both infrastructure clock and perbusull clock.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV32</name>
                  <value>3</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <value>2</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>1</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <value>0</value>
                  <description>Divide by 1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>INFRCLKDIVDS</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Infrastructure Clock Division Factor For DeepSleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RATIO</name>
              <description>[1:0] Division rate for clocks driving modules in the MCU_AON domain when system CPU is in deepsleep mode. Division ratio affects both infrastructure clock and perbusull clock.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV32</name>
                  <value>3</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <value>2</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>1</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <value>0</value>
                  <description>Divide by 1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VDCTL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>MCU Voltage Domain Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPARE1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ULDO</name>
              <description>[0:0] Request PMCTL to switch to uLDO.

0: No request
1: Assert request when possible

The bit will have no effect before the following requirements are met:
1. PDCTL1.CPU_ON = 0
2. PDCTL1.VIMS_MODE = x0
3. SECDMACLKGDS.DMA_CLK_EN = 0 and S.CRYPTO_CLK_EN] = 0 and  SECDMACLKGR.DMA_AM_CLK_EN = 0 (Note: Settings must be loaded with CLKLOADCTL.LOAD)
4. SECDMACLKGDS.CRYPTO_CLK_EN = 0 and  SECDMACLKGR.CRYPTO_AM_CLK_EN = 0 (Note: Settings must be loaded with CLKLOADCTL.LOAD)
5. I2SCLKGDS.CLK_EN = 0 and I2SCLKGR.AM_CLK_EN = 0 (Note: Settings must be loaded with CLKLOADCTL.LOAD)
6. RFC do no request access to BUS
7. System CPU in deepsleep</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLKLOADCTL</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Load PRCM Settings To CLKCTRL Power Domain</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LOAD_DONE</name>
              <description>[1:1] Status of LOAD.
Will be cleared to 0 when any of the registers requiring a LOAD is written to, and be set to 1 when a LOAD is done.
Note that writing no change to a register will result in the LOAD_DONE being cleared.

0 : One or more registers have been write accessed after last LOAD
1 : No registers are write accessed after last LOAD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>[0:0] 0: No action
1: Load settings to CLKCTRL. Bit is HW cleared.

Multiple changes to settings may be done before LOAD is written once so all changes takes place at the same time. LOAD can also be done after single setting updates.

