CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: Disable clock
1: Enable clock

Can be forced on by AM_CLK_EN

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <value>8</value>
                  <description>Enable clock for GPT3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <value>4</value>
                  <description>Enable clock for GPT2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <value>2</value>
                  <description>Enable clock for GPT1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <value>1</value>
                  <description>Enable clock for GPT0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPTCLKGS</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>GPT Clock Gate For Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] Each bit below has the following meaning:

0: Disable clock
1: Enable clock

Can be forced on by GPTCLKGR.AM_CLK_EN

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <value>8</value>
                  <description>Enable clock for GPT3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <value>4</value>
                  <description>Enable clock for GPT2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <value>2</value>
                  <description>Enable clock for GPT1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <value>1</value>
                  <description>Enable clock for GPT0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPTCLKGDS</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>GPT Clock Gate For Deep Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] Each bit below has the following meaning:

0: Disable clock
1: Enable clock

Can be forced on by GPTCLKGR.AM_CLK_EN

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <value>8</value>
                  <description>Enable clock for GPT3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <value>4</value>
                  <description>Enable clock for GPT2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <value>2</value>
                  <description>Enable clock for GPT1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <value>1</value>
                  <description>Enable clock for GPT0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2CCLKGR</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>I2C Clock Gate For Run And All Modes</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>[31:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[9:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

