CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Overrides CLK_EN,  I2CCLKGS.CLK_EN and  I2CCLKGDS.CLK_EN when enabled.

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C1</name>
                  <value>2</value>
                  <description>Enable clock for I2C1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <value>1</value>
                  <description>Enable clock for I2C0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C1</name>
                  <value>2</value>
                  <description>Enable clock for I2C1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <value>1</value>
                  <description>Enable clock for I2C0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2CCLKGS</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>I2C Clock Gate For Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by I2CCLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C1</name>
                  <value>2</value>
                  <description>Enable clock for I2C1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <value>1</value>
                  <description>Enable clock for I2C0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2CCLKGDS</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>I2C Clock Gate For Deep Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by I2CCLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C1</name>
                  <value>2</value>
                  <description>Enable clock for I2C1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0</name>
                  <value>1</value>
                  <description>Enable clock for I2C0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UARTCLKGR</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>UART Clock Gate For Run And All Modes</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[11:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

