CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Overrides CLK_EN,  UARTCLKGS.CLK_EN and  UARTCLKGDS.CLK_EN when enabled.

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART3</name>
                  <value>8</value>
                  <description>Enable clock for UART3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2</name>
                  <value>4</value>
                  <description>Enable clock for UART2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1</name>
                  <value>2</value>
                  <description>Enable clock for UART1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[7:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] 0: Disable clock
1: Enable clock

Can be forced on by AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART3</name>
                  <value>8</value>
                  <description>Enable clock for UART3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2</name>
                  <value>4</value>
                  <description>Enable clock for UART2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1</name>
                  <value>2</value>
                  <description>Enable clock for UART1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UARTCLKGS</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>UART Clock Gate For Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] 0: Disable clock
1: Enable clock

Can be forced on by UARTCLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART3</name>
                  <value>8</value>
                  <description>Enable clock for UART3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2</name>
                  <value>4</value>
                  <description>Enable clock for UART2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1</name>
                  <value>2</value>
                  <description>Enable clock for UART1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UARTCLKGDS</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>UART Clock Gate For Deep Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] 0: Disable clock
1: Enable clock

Can be forced on by UARTCLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART3</name>
                  <value>8</value>
                  <description>Enable clock for UART3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2</name>
                  <value>4</value>
                  <description>Enable clock for UART2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1</name>
                  <value>2</value>
                  <description>Enable clock for UART1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SPICLKGR</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>SPI Clock Gate For Run And All Modes</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[11:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

