CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Overrides CLK_EN,  SPICLKGS.CLK_EN and  SPICLKGDS.CLK_EN when enabled.

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3</name>
                  <value>8</value>
                  <description>Enable clock for SPI3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2</name>
                  <value>4</value>
                  <description>Enable clock for SPI2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1</name>
                  <value>2</value>
                  <description>Enable clock for SPI1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <value>1</value>
                  <description>Enable clock for SPI0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[7:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] 0: Disable clock
1: Enable clock

Can be forced on by AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3</name>
                  <value>8</value>
                  <description>Enable clock for SPI3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2</name>
                  <value>4</value>
                  <description>Enable clock for SPI2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1</name>
                  <value>2</value>
                  <description>Enable clock for SPI1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <value>1</value>
                  <description>Enable clock for SPI0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SPICLKGS</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>SPI Clock Gate For Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] 0: Disable clock
1: Enable clock

Can be forced on by SPICLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3</name>
                  <value>8</value>
                  <description>Enable clock for SPI3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2</name>
                  <value>4</value>
                  <description>Enable clock for SPI2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1</name>
                  <value>2</value>
                  <description>Enable clock for SPI1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <value>1</value>
                  <description>Enable clock for SPI0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SPICLKGDS</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>SPI Clock Gate For Deep Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] 0: Disable clock
1: Enable clock

Can be forced on by SPICLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI3</name>
                  <value>8</value>
                  <description>Enable clock for SPI3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2</name>
                  <value>4</value>
                  <description>Enable clock for SPI2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1</name>
                  <value>2</value>
                  <description>Enable clock for SPI1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <value>1</value>
                  <description>Enable clock for SPI0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2SCLKGR</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>I2S Clock Gate For Run And All Modes</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[8:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

Overrides CLK_EN,  I2SCLKGS.CLK_EN and  I2SCLKGDS.CLK_EN when enabled.
SYSBUS clock will always run when enabled

