CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0RFC</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0SERIAL</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>SERIAL Power Domain Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.SERIAL_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0PERIPH</name>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <description>PERIPH Power Domain Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.PERIPH_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL1</name>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <description>Power Domain Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VIMS_MODE</name>
              <description>[4:3] 00: VIMS power domain is only powered when CPU power domain is powered.
01: VIMS power domain is powered whenever the BUS power domain is powered.
1X: Block power up of VIMS power domain at next wake up. This mode only has effect when VIMS power domain is not powered. Used for Autonomous RF Core.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[2:2] 0: RFC power domain powered off if also PDCTL0.RFC_ON = 0 1: RFC power domain powered on  Bit shall be used by RFC in autonomous mode but there is no HW restrictions from system CPU to access the bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>[1:1] 0: Causes a power down of the CPU power domain when system CPU indicates it is idle.
1: Initiates power-on of the CPU power domain.

This bit is automatically set by a WIC power-on event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xA</resetValue>
        </register>
        <register>
          <name>PDCTL1CPU</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>CPU Power Domain Direct Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.CPU_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDCTL1RFC</name>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Direct Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL1VIMS</name>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <description>VIMS Mode Direct Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:0] This is an alias for PDCTL1.VIMS_MODE</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>Power Manager Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BUS_ON</name>
              <description>[4:4] 0: BUS domain not accessible
1: BUS domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VIMS_ON</name>
              <description>[3:3] 0: VIMS domain not accessible
1: VIMS domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[2:2] 0: RFC domain not accessible
1: RFC domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>[1:1] 0: CPU and BUS domain not accessible
1: CPU and BUS domains are both currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1A</resetValue>
        </register>
        <register>
          <name>PDSTAT1BUS</name>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <description>BUS Power Domain Direct Read Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.BUS_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1RFC</name>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Direct Read Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT1CPU</name>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <description>CPU Power Domain Direct Read Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.CPU_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1VIMS</name>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <description>VIMS Mode Direct Read Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.VIMS_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>RFCBITS</name>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <description>Control To RFC</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>READ</name>
              <description>[31:0] Control bits for RFC. The RF core CPE processor will automatically check this register when it boots, and it can be used to immediately instruct CPE to perform some tasks at its start-up. The supported functionality is ROM-defined and may vary. See the technical reference manual for more details.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFCMODESEL</name>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <description>Selected RFC Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CURR</name>
              <description>[2:0] Selects the set of commands that the RFC will accept. Only modes permitted by RFCMODEHWOPT.AVAIL are writable. See the technical reference manual for details.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <value>7</value>
                  <description>Select Mode 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <value>6</value>
                  <description>Select Mode 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <value>5</value>
                  <description>Select Mode 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <value>4</value>
                  <description>Select Mode 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <value>3</value>
                  <description>Select Mode 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <value>2</value>
                  <description>Select Mode 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <value>1</value>
                  <description>Select Mode 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <value>0</value>
                  <description>Select Mode 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFCMODEHWOPT</name>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <description>Allowed RFC Modes</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AVAIL</name>
              <description>[7:0] Permitted RFC modes. More than one mode can be permitted.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <value>128</value>
                  <description>Mode 7 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <value>64</value>
                  <description>Mode 6 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <value>32</value>
                  <description>Mode 5 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <value>16</value>
                  <description>Mode 4 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <value>8</value>
                  <description>Mode 3 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <value>4</value>
                  <description>Mode 2 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <value>2</value>
                  <description>Mode 1 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <value>1</value>
                  <description>Mode 0 permitted</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWRPROFSTAT</name>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <description>Power Profiler Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[7:0] SW can use these bits to timestamp the application. These bits are also available through the testtap and can thus be used by the emulator to profile in real time.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>MCUSRAMCFG</name>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <description>MCU SRAM configuration</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PARITY_EN</name>
              <description>[6:6] Parity enable

