CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_PMCTL</name>
      <baseAddress>0x58090000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>This component control the Power Management controller residing in the AON domain.

Note: This module is only supporting 32 bit Read Write access from MCU</description>
      <registers>
        <register>
          <name>AUXSCECLK</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>AUX SCE Clock Management

This register contains bitfields that are relevant for setting up the clock to the AUX domain.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PD_SRC</name>
              <description>[8:8] Selects the clock source for the AUX domain when AUX is in powerdown mode.
Note: Switching the clock source is guaranteed to be glitch-free</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>1</value>
                  <description>LF clock (SCLK_LF )</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <value>0</value>
                  <description>No clock</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SRC</name>
              <description>[0:0] Selects the clock source for the AUX domain when AUX is in active mode.
Note: Switching the clock source is guaranteed to be glitch-free</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCLK_MF</name>
                  <value>1</value>
                  <description>MF Clock (SCLK_MF)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_HFDIV2</name>
                  <value>0</value>
                  <description>HF Clock divided by 2 (SCLK_HFDIV2)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RAMCFG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>RAM Configuration

This register contains power management related configuration for the SRAM  in the MCU and AUX  domain.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED18</name>
              <description>[31:18] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AUX_SRAM_PWR_OFF</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_SRAM_RET_EN</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[15:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BUS_SRAM_RET_EN</name>
              <description>[3:0] MCU SRAM is partitioned into 8  banks . This register controls which of the banks that has retention during MCU Bus domain power off</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RET_FULL</name>
                  <value>15</value>
                  <description>Retention on for all banks BANK[0]: BANK[1]: BANK[2]: BANK[3]:BANK[4]: BANK[5]: BANK[6]: BANK[7] + PARITY_BANK retained</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL3</name>
                  <value>7</value>
                  <description>Retention on for BANK[0]: BANK[1]: BANK[2]: BANK[3]:BANK[4]: BANK[5] + PARITY_BANK retained</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL2</name>
                  <value>3</value>
                  <description>Retention on for BANK[0]: BANK[1]: BANK[2]: BANK[3]:BANK[4] + PARITY_BANK retained</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL1</name>
                  <value>1</value>
                  <description>Retention on for BANK[0]: BANK[1]: BANK[2]: BANK[3] + PARITY_BANK retained</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_NONE</name>
                  <value>0</value>
                  <description>Retention is disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1000F</resetValue>
        </register>
        <register>
          <name>PWRCTL</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Power Management Control

This register controls bitfields for setting low level power management features such as selection of  regulator for VDDR supply and control of IO ring where certain segments can be enabled / disabled.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC_ACTIVE</name>
              <description>[2:2] Select to use DCDC regulator for VDDR in active mode

0: Use GLDO for regulation of VDDR in active mode.
1: Use DCDC for regulation of VDDR in active mode.

DCDC_EN must also be set for DCDC to be used as regulator for VDDR in active mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_REG_MODE</name>
              <description>[1:1] Status of source for VDDRsupply:

0: DCDC or GLDO are generating VDDR
1: DCDC and GLDO are bypassed and an external regulator supplies VDDR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_EN</name>
              <description>[0:0] Select to use DCDC regulator during recharge of VDDR

0: Use GLDO for recharge of VDDR
1: Use DCDC for recharge of VDDR

