CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
The register is updated prior to every recharge period with a shift left, and bit 0 is updated with the last VDDR sample.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_USED_PER</name>
              <description>[15:0] Shows the maximum number of 32kHz periods that have separated two recharge cycles and VDDR still was above VDDR_OK threshold when the latter recharge started. This register can be used as an indication of the leakage current during standby.

This bitfield is cleared to 0 when writing this register.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OSCCFG</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Oscillator Configuration

This register sets the period for Amplitude compensation requests sent to the oscillator control system. The amplitude compensations is only applicable when XOSC_HF is running in low power mode.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_M</name>
              <description>[7:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PER_E</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESETCTL</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Reset Management

This register contains bitfields related to system reset such as reset source and reset request  and control of brown out resets.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYSRESET</name>
              <description>[31:31] Cold reset register. Writing 1 to this bitfield will reset the entire chip and cause boot code to run again.

0: No effect
1: Generate system reset. Appears as SYSRESET in RESET_SRC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED26</name>
              <description>[30:26] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_DET_1_CLR</name>
              <description>[25:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>BOOT_DET_0_CLR</name>
              <description>[24:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED18</name>
              <description>[23:18] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_DET_1_SET</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>BOOT_DET_0_SET</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>WU_FROM_SD</name>
              <description>[15:15] A Wakeup from SHUTDOWN on an IO event has occurred, or a wakeup from SHUTDOWN has occurred as a result of the debugger being attached.. (TCK pin being forced low)

Please refer to IOC:IOCFGn.WU_CFG for configuring the IO's as wakeup sources.

0: Wakeup occurred from cold reset or brown out as seen in RESET_SRC
1: A wakeup has occurred from SHUTDOWN

Note: This flag will be cleared when SLEEPCTL.IO_PAD_SLEEP_DIS is asserted.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_WU_FROM_SD</name>
              <description>[14:14] A wakeup from SHUTDOWN on an IO event has occurred

Please refer to IOC:IOCFGn.WU_CFG for configuring the IO's as wakeup sources.

0: The wakeup did not occur from SHUTDOWN on an IO event
1: A wakeup from SHUTDOWN occurred from an IO event

