CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
The case where WU_FROM_SD is asserted but this bitfield is not asserted will only occur in a debug session. The boot code will not proceed with wakeup from SHUTDOWN procedure until this bitfield is asserted as well.

Note: This flag will be cleared when  SLEEPCTL.IO_PAD_SLEEP_DIS is asserted.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_DET_1</name>
              <description>[13:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_DET_0</name>
              <description>[12:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[11:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_LOSS_EN</name>
              <description>[5:5] Controls reset generation in case SCLK_LF, SCLK_MF or SCLK_HF is lost when clock loss detection is enabled by [ANATOP_MMAP:DDI_0_OSC:CTL0.CLK_LOSS_EN]

0: Clock loss is ignored
1: Clock loss generates system reset

Note: Clock loss reset generation must be disabled when changing clock source for   SCLK_LF. Failure to do so may result in a spurious system reset. Clock loss reset generation is controlled by [ANATOP_MMAP:DDI_0_OSC:CTL0.CLK_LOSS_EN]</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WARM_RESET</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_SRC</name>
              <description>[3:1] Shows the root cause of the last system reset. More than the reported reset source can have been active during the last system reset but only the root cause is reported.

The capture feature is not rearmed until all off the possible reset sources have been released and the result has been copied to AON_PMCTL. During the copy and rearm process it is one 2MHz period in which and eventual new system reset will be reported as Power on reset regardless of the root cause.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WARMRESET</name>
                  <value>7</value>
                  <description>Software reset via PRCM warm reset request</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRESET</name>
                  <value>6</value>
                  <description>Software reset via SYSRESET or hardware power management timeout detection.

Note: The hardware power management timeout circuit is always enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_LOSS</name>
                  <value>5</value>
                  <description>SCLK_LF, SCLK_MF or SCLK_HF clock loss detect</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDR_LOSS</name>
                  <value>4</value>
                  <description>Brown out detect on VDDR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDS_LOSS</name>
                  <value>2</value>
                  <description>Brown out detect on VDDS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN_RESET</name>
                  <value>1</value>
                  <description>Reset pin</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_ON</name>
                  <value>0</value>
                  <description>Power on reset</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1C0</resetValue>
        </register>
        <register>
          <name>SLEEPCTL</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Sleep Control

This register is used to unfreeze the IO pad ring after waking up from SHUTDOWN</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IO_PAD_SLEEP_DIS</name>
              <description>[0:0] Controls the I/O pad sleep mode. The boot code will set this bitfield automatically unless waking up from a SHUTDOWN ( RESETCTL.WU_FROM_SD is set).

0: I/O pad sleep mode is enabled, meaning all outputs and pad configurations are latched. Inputs are transparent if pad is configured as input before IO_PAD_SLEEP_DIS is set to 1
1: I/O pad sleep mode is disabled

Application software must reconfigure the state for all IO's before setting this bitfield upon waking up from a SHUTDOWN to avoid glitches on pins.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>JTAGCFG</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>JTAG Configuration

This register contains control for configuration of the JTAG domain. This includes permissions for each TAP.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>JTAG_PD_FORCE_ON</name>
              <description>[8:8] Controls JTAG Power domain power state:

0: Controlled exclusively by debug subsystem. (JTAG Power domain will be powered off unless a debugger is attached)
1: JTAG Power Domain is forced on, independent of debug subsystem.

Note: The reset value causes JTAG Power domain to be powered on by default. Software must clear this bit to turn off the JTAG Power domain</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x100</resetValue>
        </register>
        <register>
          <name>JTAGUSERCODE</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>JTAG USERCODE

Boot code copies the JTAG USERCODE to this register from where it is forwarded to the debug subsystem.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER_CODE</name>
              <description>[31:0] 32-bit JTAG USERCODE register feeding main JTAG TAP
Note: This field can be locked by LOCKCFG.LOCK</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xB99A02F</resetValue>
        </register>
        <register>
          <name>WDTLOAD</name>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <description>Configuration
Load Value register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOAD</name>
              <description>[31:0] This register is the 32-bit interval value used by the 32-bit counter. When this register is written, the value is immediately loaded and the counter is restarted to count down from the new value. If this register is loaded with 0x0000.0000, a reset is immediately generated. Read from this register will return the current value of the counter</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>WDTTEST</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>Test Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STALLEN</name>
              <description>[0:0] WDT Stall Enable

0:  The WDT timer continues counting if the CPU is stopped with a debugger.
1:  If the CPU is stopped with a debugger, the WDT stops counting. Once the CPU is restarted, the WDT resumes counting.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>WDTLOCK</name>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <description>Lock</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOCK</name>
              <description>[31:0] WDT Lock: A write of the value 0x1ACC.E551 unlocks the watchdog registers for write access. A write of any other value reapplies the lock, preventing any register updates

A read of this register returns the following values:

0x0000.0000: Unlocked
0x0000.0001:  Locked</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
