CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG7</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Vector Configuration 7

AUX_SCE wakeup vector 7 configuration</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 7.

Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSYNCRATE</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Event Synchronization Rate

Configure synchronization rate for certain events to the synchronous AUX event bus.

You must select SCE rate when AUX_SCE uses the event. You must select AUX bus rate when system CPU uses the event.

SCE rate equals rate configured in AON_PMCTL:AUXSCECLK. AUX bus rate equals SCE rate, or SCLK_HF divided by two when MCU domain is active.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AUX_COMPA_SYNC_RATE</name>
              <description>[2:2] Select synchronization rate for AUX_EVCTL:EVSTAT2.AUX_COMPA event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPB_SYNC_RATE</name>
              <description>[1:1] Select synchronization rate for AUX_EVCTL:EVSTAT2.AUX_COMPB event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TIMER2_SYNC_RATE</name>
              <description>[0:0] Select synchronization rate for:
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PEROPRATE</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Peripheral Operational Rate

