CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
Some AUX peripherals are operated at either SCE or at AUX bus rate.

You must select SCE rate when AUX_SCE uses such peripheral or an event produced by it. You must select AUX bus rate when system CPU uses such peripheral.

SCE rate equals rate configured in AON_PMCTL:AUXSCECLK. AUX bus rate equals SCE rate, or SCLK_HF divided by 2 when MCU domain is active.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ANAIF_DAC_OP_RATE</name>
              <description>[3:3] Select operational rate for AUX_ANAIF DAC sample clock state machine.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER01_OP_RATE</name>
              <description>[2:2] Select operational rate for AUX_TIMER01.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIM_OP_RATE</name>
              <description>[1:1] Select operational rate for AUX_SPIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAC_OP_RATE</name>
              <description>[0:0] Select operational rate for AUX_MAC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCCLKCTL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>ADC Clock Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>[1:1] Clock acknowledgement.

0: ADC clock is disabled.
1: ADC clock is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] ADC clock request.

0: Disable ADC clock.
1: Enable ADC clock.

Only modify REQ when equal to ACK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TDCCLKCTL</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>TDC Counter Clock Control

Controls if the AUX_TDC counter clock source is enabled.

These are the recommended steps to configure and request the counter clock:

- Ensure that REQ=0 and ACK=0.
- Configure clock source in DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL.
- Read DDI_0_OSC:CTL0 to avoid a race condition between previous step and next step.
- Set REQ=1 to request the clock.
- If DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL=RCOSC_HF (24 or 48 MHz), wait until ACK=1.
- If DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL=XOSC_HF, wait until ACK=1 and DDI_0_OSC:STAT2.XOSC_HF_FREQGOOD=1.

After these steps ACK stays high until REQ=0. It is hence not recommended to reconfigure DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL when ACK=1. In this case, there will be no indication of when the new clock source selection is ready.

These are the recommended steps to stop the counter clock:

