CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
System CPU must not access this register. Instead, system CPU must access AON_RTC:SEC.VALUE directly.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC</name>
              <description>[15:0] Bits 15:0 in AON_RTC:SEC.VALUE.

Follow this procedure to get the correct value:
- Do two dummy reads of SEC.
- Then read SEC until two consecutive reads are equal.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCSUBSEC</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>Real Time Counter Sub-Second

System CPU must not access this register. Instead, system CPU must access AON_RTC:SUBSEC.VALUE directly.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SUBSEC</name>
              <description>[15:0] Bits 31:16 in AON_RTC:SUBSEC.VALUE.

Follow this procedure to get the correct value:
- Do two dummy reads SUBSEC.
- Then read SUBSEC until two consecutive reads are equal.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCEVCLR</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>AON_RTC Event Clear

Request to clear events:
- AON_RTC:EVFLAGS.CH2.
- AON_RTC:EVFLAGS.CH2 delayed version.
- AUX_EVCTL:EVSTAT2.AON_RTC_CH2.
- AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_CH2_EV_CLR</name>
              <description>[0:0] Clear events from AON_RTC channel 2.

0: No effect.
1: Clear events from AON_RTC channel 2.

Keep RTC_CH2_EV_CLR high until AUX_EVCTL:EVSTAT2.AON_RTC_CH2 and AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY are 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>BATMONBAT</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>AON_BATMON Battery Voltage Value

Read access to AON_BATMON:BAT. System CPU must not access this register. Instead, system CPU must access AON_BATMON:BAT directly. AON_BATMON:BAT updates during VDDR recharge or active operational mode.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INT</name>
              <description>[10:8] See AON_BATMON:BAT.INT.

Follow this procedure to get the correct value:
- Do two dummy reads of INT.
- Then read INT until two consecutive reads are equal.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>[7:0] See AON_BATMON:BAT.FRAC.

Follow this procedure to get the correct value:
- Do two dummy reads of FRAC.
- Then read FRAC until two consecutive reads are equal.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>BATMONTEMP</name>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <description>AON_BATMON Temperature Value

Read access to AON_BATMON:TEMP. System CPU must not access this register. Instead, system CPU must access AON_BATMON:TEMP directly. AON_BATMON:TEMP updates during VDDR recharge or active operational mode.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SIGN</name>
              <description>[15:11] Sign extension of INT.

Follow this procedure to get the correct value:
- Do two dummy reads of SIGN.
- Then read SIGN until two consecutive reads are equal.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INT</name>
              <description>[10:2] See AON_BATMON:TEMP.INT.

Follow this procedure to get the correct value:
- Do two dummy reads of INT.
- Then read INT until two consecutive reads are equal.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>[1:0] See AON_BATMON:TEMP.FRAC.

Follow this procedure to get the correct value:
- Do two dummy reads of FRAC.
- Then read FRAC until two consecutive reads are equal.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TIMERHALT</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>Timer Halt

