CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
AUX_SCE is allowed to update bits in half-word given by ADDR according to this bit mask.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>NONSECDDIACC1</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Non-Secure DDI Access 1

When system is in secure state, AUX_SCE is allowed to update a predefined DDI half-word using SET or CLR access. Configuration will determine if AUX_SCE can read the same half-word. An access to a non-allowed register will suspend the AUX_SCE when system state is secure.

If ADDR field in two or more NONSECDDIACC registers are equal, the MASK and RD_EN from the highest numbered register will be used.

Examples:

Half-word with address of 0 corresponds to DDI_0_OSC:CTL0  bit range [15:0].
Half-word with address of 1 corresponds to DDI_0_OSC:CTL0  bit range [31:16].
…
Half-word with address of 34 corresponds to DDI_0_OSC:STAT2  bit range [15:0].
Half-word with address of 35 corresponds to DDI_0_OSC:STAT2  bit range [31:16].</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED23</name>
              <description>[31:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_EN</name>
              <description>[22:22] Read Enable

0: AUX_SCE is not allowed to read DDI half-word given by ADDR.
1: AUX_SCE is allowed to read DDI half-word given by ADDR.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>[21:16] Address

AUX_SCE is allowed to update this DDI half-word using SET or CLR access.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_MASK</name>
              <description>[15:0] Mask

AUX_SCE is allowed to update bits in half-word given by ADDR according to this bit mask.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>NONSECDDIACC2</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Non-Secure DDI Access 2

When system is in secure state, AUX_SCE is allowed to update a predefined DDI half-word using SET or CLR access. Configuration will determine if AUX_SCE can read the same half-word. An access to a non-allowed register will suspend the AUX_SCE when system state is secure.

If ADDR field in two or more NONSECDDIACC registers are equal, the MASK and RD_EN from the highest numbered register will be used.

Examples:

Half-word with address of 0 corresponds to DDI_0_OSC:CTL0  bit range [15:0].
Half-word with address of 1 corresponds to DDI_0_OSC:CTL0  bit range [31:16].
…
Half-word with address of 34 corresponds to DDI_0_OSC:STAT2  bit range [15:0].
Half-word with address of 35 corresponds to DDI_0_OSC:STAT2  bit range [31:16].</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED23</name>
              <description>[31:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_EN</name>
              <description>[22:22] Read Enable

0: AUX_SCE is not allowed to read DDI half-word given by ADDR.
1: AUX_SCE is allowed to read DDI half-word given by ADDR.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>[21:16] Address

AUX_SCE is allowed to update this DDI half-word using SET or CLR access.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_MASK</name>
              <description>[15:0] Mask

AUX_SCE is allowed to update bits in half-word given by ADDR according to this bit mask.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>NONSECDDIACC3</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Non-Secure DDI Access 3

When system is in secure state, AUX_SCE is allowed to update a predefined DDI half-word using SET or CLR access. Configuration will determine if AUX_SCE can read the same half-word. An access to a non-allowed register will suspend the AUX_SCE when system state is secure.

If ADDR field in two or more NONSECDDIACC registers are equal, the MASK and RD_EN from the highest numbered register will be used.

Examples:

Half-word with address of 0 corresponds to DDI_0_OSC:CTL0  bit range [15:0].
Half-word with address of 1 corresponds to DDI_0_OSC:CTL0  bit range [31:16].
…
Half-word with address of 34 corresponds to DDI_0_OSC:STAT2  bit range [15:0].
Half-word with address of 35 corresponds to DDI_0_OSC:STAT2  bit range [31:16].</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED23</name>
              <description>[31:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_EN</name>
              <description>[22:22] Read Enable

0: AUX_SCE is not allowed to read DDI half-word given by ADDR.
1: AUX_SCE is allowed to read DDI half-word given by ADDR.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>[21:16] Address

AUX_SCE is allowed to update this DDI half-word using SET or CLR access.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_MASK</name>
              <description>[15:0] Mask

AUX_SCE is allowed to update bits in half-word given by ADDR according to this bit mask.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
