CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_ITM</name>
      <baseAddress>0xE0000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Instrumentation Trace Macrocell (ITM)</description>
      <registers>
        <register>
          <name>STIM0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM2</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM3</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM4</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM5</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM6</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM7</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM8</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM9</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM10</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM11</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM12</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM13</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM14</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM15</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM16</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
