CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>STIM17</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM18</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM19</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM20</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM21</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM22</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM23</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM24</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM25</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM26</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM27</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM28</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM29</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM30</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM31</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>Provides the interface for generating Instrumentation packets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLED</name>
              <description>[1:1] Indicates whether the Stimulus Port is enabled or disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOREADY</name>
              <description>[0:0] Indicates whether the Stimulus Port can accept data</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TER0</name>
          <addressOffset>0xe00</addressOffset>
          <size>32</size>
          <description>Provide an individual enable bit for each ITM_STIM register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIMENA</name>
              <description>[31:0] For STIMENA[m] in ITM_TER*n, controls whether ITM_STIM(32*n + m) is enabled</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TPR</name>
          <addressOffset>0xe40</addressOffset>
          <size>32</size>
          <description>Controls which stimulus ports can be accessed by unprivileged code</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRIVMASK</name>
              <description>[31:0] For PRIVMASK[m], defines the access permissions of ITM_STIM Stimulus Ports 8m to 8m+7 inclusive</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
