CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>TCR</name>
          <addressOffset>0xe80</addressOffset>
          <size>32</size>
          <description>Configures and controls transfers through the ITM interface</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>[23:23] Indicates whether the ITM is currently processing events</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TraceBusID</name>
              <description>[22:16] Identifier for multi-source trace stream formatting. If multi-source trace is in use, the debugger must write a unique non-zero trace ID value to this field</description>
              <bitWidth>7</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>GTSFREQ</name>
              <description>[11:10] Defines how often the ITM generates a global timestamp, based on the global timestamp clock frequency, or disables generation of global timestamps</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TSPrescale</name>
              <description>[9:8] Local timestamp prescaler, used with the trace packet reference clock</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[7:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>STALLENA</name>
              <description>[5:5] Stall the PE to guarantee delivery of Data Trace packets.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SWOENA</name>
              <description>[4:4] Enables asynchronous clocking of the timestamp counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENA</name>
              <description>[3:3] Enables forwarding of hardware event packet from the DWT unit to the ITM for output to the TPIU</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCENA</name>
              <description>[2:2] Enables Synchronization packet transmission for a synchronous TPIU</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENA</name>
              <description>[1:1] Enables Local timestamp generation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ITMENA</name>
              <description>[0:0] Enables the ITM</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>INT_ATREADY</name>
          <addressOffset>0xef0</addressOffset>
          <size>32</size>
          <description>Integration Mode: Read ATB Ready</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AFVALID</name>
              <description>[1:1] A read of this bit returns the value of AFVALID</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ATREADY</name>
              <description>[0:0] A read of this bit returns the value of ATREADY</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>INT_ATVALID</name>
          <addressOffset>0xef8</addressOffset>
          <size>32</size>
          <description>Integration Mode: Write ATB Valid</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AFREADY</name>
              <description>[1:1] A write to this bit gives the value of AFREADY</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>ATREADY</name>
              <description>[0:0] A write to this bit gives the value of ATVALID</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ITCTRL</name>
          <addressOffset>0xf00</addressOffset>
          <size>32</size>
          <description>Integration Mode Control Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IME</name>
              <description>[0:0] Integration mode enable bit - The possible values are:  0 - The trace unit is not in integration mode. 1 - The trace unit is in integration mode. This mode enables: A debug agent to perform topology detection. SoC test software to perform integration testing.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DEVARCH</name>
          <addressOffset>0xfbc</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARCHITECT</name>
              <description>[31:21] Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRESENT</name>
              <description>[20:20] Defines that the DEVARCH register is present</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>[19:16] Defines the architecture revision of the component</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHVER</name>
              <description>[15:12] Defines the architecture version of the component</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHPART</name>
              <description>[11:0] Defines the architecture of the component</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DEVTYPE</name>
          <addressOffset>0xfcc</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SUB</name>
              <description>[7:4] Component sub-type</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>[3:0] Component major type</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR4</name>
          <addressOffset>0xfd0</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_2</name>
              <description>[3:0] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR5</name>
          <addressOffset>0xfd4</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR6</name>
          <addressOffset>0xfd8</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR7</name>
          <addressOffset>0xfdc</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR0</name>
          <addressOffset>0xfe0</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_0</name>
              <description>[7:0] See CoreSight Architecture Specification</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR1</name>
          <addressOffset>0xfe4</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_0</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_1</name>
              <description>[3:0] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR2</name>
          <addressOffset>0xfe8</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>JEDEC</name>
              <description>[3:3] See CoreSight Architecture Specification</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_1</name>
              <description>[2:0] See CoreSight Architecture Specification</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR3</name>
          <addressOffset>0xfec</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REVAND</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CMOD</name>
              <description>[3:0] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CIDR0</name>
          <addressOffset>0xff0</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_0</name>
              <description>[7:0] See CoreSight Architecture Specification</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CIDR1</name>
          <addressOffset>0xff4</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLASS</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_1</name>
              <description>[3:0] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CIDR2</name>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_2</name>
              <description>[7:0] See CoreSight Architecture Specification</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
