CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>CIDR3</name>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the ITM</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_3</name>
              <description>[7:0] See CoreSight Architecture Specification</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_DWT</name>
      <baseAddress>0xE0001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Data watchpoint and Trace (DWT)</description>
      <registers>
        <register>
          <name>CTRL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Provides configuration and status information for the DWT unit, and used to control features of the unit</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>NUMCOMP</name>
              <description>[31:28] Number of DWT comparators implemented</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>NOTRCPKT</name>
              <description>[27:27] Indicates whether the implementation does not support trace</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>NOEXTTRIG</name>
              <description>[26:26] Reserved, RAZ</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>NOCYCCNT</name>
              <description>[25:25] Indicates whether the implementation does not include a cycle counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>NOPRFCNT</name>
              <description>[24:24] Indicates whether the implementation does not include the profiling counters</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CYCDISS</name>
              <description>[23:23] Controls whether the cycle counter is disabled in Secure state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CYCEVTENA</name>
              <description>[22:22] Enables Event Counter packet generation on POSTCNT underflow</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FOLDEVTENA</name>
              <description>[21:21] Enables DWT_FOLDCNT counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LSUEVTENA</name>
              <description>[20:20] Enables DWT_LSUCNT counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEPEVTENA</name>
              <description>[19:19] Enable DWT_SLEEPCNT counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EXCEVTENA</name>
              <description>[18:18] Enables DWT_EXCCNT counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CPIEVTENA</name>
              <description>[17:17] Enables DWT_CPICNT counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTTRCENA</name>
              <description>[16:16] Enables generation of Exception Trace packets</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED13</name>
              <description>[15:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PCSAMPLENA</name>
              <description>[12:12] Enables use of POSTCNT counter as a timer for Periodic PC Sample packet generation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCTAP</name>
              <description>[11:10] Selects the position of the synchronization packet counter tap on the CYCCNT counter. This determines the Synchronization packet rate</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CYCTAP</name>
              <description>[9:9] Selects the position of the POSTCNT tap on the CYCCNT counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>POSTINIT</name>
              <description>[8:5] Initial value for the POSTCNT counter</description>
              <bitWidth>4</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>POSTPRESET</name>
              <description>[4:1] Reload value for the POSTCNT counter</description>
              <bitWidth>4</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CYCCNTENA</name>
              <description>[0:0] Enables CYCCNT</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CYCCNT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Shows or sets the value of the processor cycle counter, CYCCNT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CYCCNT</name>
              <description>[31:0] Increments one on each processor clock cycle when DWT_CTRL.CYCCNTENA == 1 and DEMCR.TRCENA == 1. On overflow, CYCCNT wraps to zero</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CPICNT</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>CPI Count Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CPICNT</name>
              <description>[7:0] Counts one on each cycle when all of the following are true:
- DWT_CTRL.CPIEVTENA == 1 and DEMCR.TRCENA == 1.
- No instruction is executed.
- No load-store operation is in progress, see DWT_LSUCNT.
- No exception-entry or exception-exit operation is in progress, see DWT_EXCCNT.
- The PE is not in a power saving mode, see DWT_SLEEPCNT.
- Either SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-secure state and NoninvasiveDebugAllowed() == TRUE.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EXCCNT</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Counts the total cycles spent in exception processing</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EXCCNT</name>
              <description>[7:0] Counts one on each cycle when all of the following are true:
 - DWT_CTRL.EXCEVTENA == 1 and DEMCR.TRCENA == 1.
 - No instruction is executed, see DWT_CPICNT.
 - An exception-entry or exception-exit related operation is in progress.
 - Either SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the operation is set to Non-secure and NoninvasiveDebugAllowed() == TRUE.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SLEEPCNT</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Sleep Count Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEPCNT</name>
              <description>[7:0] Counts one on each cycle when all of the following are true:
- DWT_CTRL.SLEEPEVTENA == 1 and DEMCR.TRCENA == 1.
- No instruction is executed, see DWT_CPICNT.
- No load-store operation is in progress, see DWT_LSUCNT.
- No exception-entry or exception-exit operation is in progress, see DWT_EXCCNT.
- The PE is in a power saving mode.
- Either SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-secure state and NoninvasiveDebugAllowed() == TRUE.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LSUCNT</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Increments on the additional cycles required to execute all load or store instructions</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LSUCNT</name>
              <description>[7:0] Counts one on each cycle when all of the following are true:
 - DWT_CTRL.LSUEVTENA == 1 and DEMCR.TRCENA == 1.
 - No instruction is executed, see DWT_CPICNT.
 - No exception-entry or exception-exit operation is in progress, see DWT_EXCCNT.
 - A load-store operation is in progress.
 - Either SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the operation is set to Non-secure and NoninvasiveDebugAllowed() == TRUE.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FOLDCNT</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Increments on the additional cycles required to execute all load or store instructions</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FOLDCNT</name>
              <description>[7:0] Counts on each cycle when all of the following are true:
 - DWT_CTRL.FOLDEVTENA == 1 and DEMCR.TRCENA == 1.
 - At least two instructions are executed, see DWT_CPICNT.
 - Either SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-secure state and NoninvasiveDebugAllowed() == TRUE.
 The counter is incremented by the number of instructions executed, minus one</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PCSR</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Program Counter Sample Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>EIASAMPLE</name>
              <description>[31:0] The possible values of this field are:
0xFFFFFFFF
  One of the following is true:
  - The PE is halted in Debug state.
  - The Security Extension is implemented, the sampled instruction was executed in Secure state, and SecureNoninvasiveDebugAllowed() == FALSE.
  - NoninvasiveDebugAllowed() == FALSE.
  - DEMCR.TRCENA == 0.
  - The address of a recently-executed instruction is not available.
Not 0xFFFFFFFF
  Instruction address of a recently executed instruction. Bit [0] of the sample instruction address is 0.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP0</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Provides a reference value for use by watchpoint comparator 0</description>
          <access>read-write</access>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FUNCTION0</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Controls the operation of watchpoint comparator 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ID</name>
              <description>[31:27] Identifies the capabilities for MATCH for comparator *n</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED25</name>
              <description>[26:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>[24:24] Set to 1 when the comparator matches</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[23:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>[11:10] Defines the size of the object being watched for by Data Value and Data Address comparators</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[9:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>[5:4] Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>[3:0] Controls the type of match generated by this comparator</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP1</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Provides a reference value for use by watchpoint comparator 1</description>
          <access>read-write</access>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FUNCTION1</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Controls the operation of watchpoint comparator 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ID</name>
              <description>[31:27] Identifies the capabilities for MATCH for comparator *n</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED25</name>
              <description>[26:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>[24:24] Set to 1 when the comparator matches</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[23:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>[11:10] Defines the size of the object being watched for by Data Value and Data Address comparators</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[9:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>[5:4] Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>[3:0] Controls the type of match generated by this comparator</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP2</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Provides a reference value for use by watchpoint comparator 2</description>
          <access>read-write</access>
          <resetValue>0</resetValue>
        </register>
