CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>FUNCTION2</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Controls the operation of watchpoint comparator 2</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ID</name>
              <description>[31:27] Identifies the capabilities for MATCH for comparator *n</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED25</name>
              <description>[26:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>[24:24] Set to 1 when the comparator matches</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[23:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>[11:10] Defines the size of the object being watched for by Data Value and Data Address comparators</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[9:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>[5:4] Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>[3:0] Controls the type of match generated by this comparator</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP3</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Provides a reference value for use by watchpoint comparator 3</description>
          <access>read-write</access>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FUNCTION3</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Controls the operation of watchpoint comparator 3</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ID</name>
              <description>[31:27] Identifies the capabilities for MATCH for comparator *n</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED25</name>
              <description>[26:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>[24:24] Set to 1 when the comparator matches</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[23:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>[11:10] Defines the size of the object being watched for by Data Value and Data Address comparators</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[9:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>[5:4] Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>[3:0] Controls the type of match generated by this comparator</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DEVARCH</name>
          <addressOffset>0xfbc</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARCHITECT</name>
              <description>[31:21] Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRESENT</name>
              <description>[20:20] Defines that the DEVARCH register is present</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>[19:16] Defines the architecture revision of the component</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHVER</name>
              <description>[15:12] Defines the architecture version of the component</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHPART</name>
              <description>[11:0] Defines the architecture of the component</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DEVTYPE</name>
          <addressOffset>0xfcc</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SUB</name>
              <description>[7:4] Component sub-type</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>[3:0] Component major type</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR4</name>
          <addressOffset>0xfd0</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_2</name>
              <description>[3:0] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR5</name>
          <addressOffset>0xfd4</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR6</name>
          <addressOffset>0xfd8</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR7</name>
          <addressOffset>0xfdc</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR0</name>
          <addressOffset>0xfe0</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_0</name>
              <description>[7:0] See CoreSight Architecture Specification</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR1</name>
          <addressOffset>0xfe4</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_0</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_1</name>
              <description>[3:0] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR2</name>
          <addressOffset>0xfe8</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>JEDEC</name>
              <description>[3:3] See CoreSight Architecture Specification</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_1</name>
              <description>[2:0] See CoreSight Architecture Specification</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PIDR3</name>
          <addressOffset>0xfec</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REVAND</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CMOD</name>
              <description>[3:0] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CIDR0</name>
          <addressOffset>0xff0</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_0</name>
              <description>[7:0] See CoreSight Architecture Specification</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CIDR1</name>
          <addressOffset>0xff4</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLASS</name>
              <description>[7:4] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_1</name>
              <description>[3:0] See CoreSight Architecture Specification</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CIDR2</name>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_2</name>
              <description>[7:0] See CoreSight Architecture Specification</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CIDR3</name>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <description>Provides CoreSight discovery information for the DWT</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_3</name>
              <description>[7:0] See CoreSight Architecture Specification</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
