CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_ICB</name>
      <baseAddress>0xE000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Implementation Control Block (ICB)</description>
      <registers>
        <register>
          <name>ICTR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Provides information about the interrupt controller</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INTLINESNUM</name>
              <description>[3:0] Indicates the number of the highest implemented register in each of the NVIC control register sets, or in the case of NVIC_IPR*n, 4xINTLINESNUM</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACTLR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Provides IMPLEMENTATION DEFINED configuration and control options</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED30</name>
              <description>[31:30] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTEXCLALL</name>
              <description>[29:29] External Exclusives Allowed with no MPU</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED13</name>
              <description>[28:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISITMATBFLUSH</name>
              <description>[12:12] Disable ATB Flush</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[11:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPEXCODIS</name>
              <description>[10:10] Disable FPU exception outputs</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DISOOFP</name>
              <description>[9:9] Disable out-of-order FP instruction completion</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[8:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISFOLD</name>
              <description>[2:2] Disable dual-issue.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DISMCYCINT</name>
              <description>[0:0] Disable dual-issue.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_SYSTICK</name>
      <baseAddress>0xE000E010</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's System Timer (SYSTICK)</description>
      <registers>
        <register>
          <name>CSR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Controls the SysTick timer and provides status data `FTSSS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>COUNTFLAG</name>
              <description>[16:16] Indicates whether the counter has counted to zero since the last read of this register</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[15:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>13</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKSOURCE</name>
              <description>[2:2] Indicates the SysTick clock source</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TICKINT</name>
              <description>[1:1] Indicates whether counting to 0 causes the status of the SysTick exception to change to pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Indicates the enabled status of the SysTick counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RVR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Provides access SysTick timer counter reload value `FTSSS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RELOAD</name>
              <description>[23:0] The value to load into the SYST_CVR `FTSSS when the counter reaches 0</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CVR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Reads or clears the SysTick timer current counter value `FTSSS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CURRENT</name>
              <description>[23:0] Writing any value clears the SysTick timer counter `FTSSS to zero</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CALIB</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Reads the SysTick timer calibration value and parameters `FTSSS</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>NOREF</name>
              <description>[31:31] Indicates whether the IMPLEMENTATION DEFINED reference clock is implemented</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SKEW</name>
              <description>[30:30] Indicates whether the 10ms calibration value is exact</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[29:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TENMS</name>
              <description>[23:0] Optionally, holds a reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors. If this field is zero, the calibration value is not known</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
