CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_NVIC</name>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC00</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Nested Vectored Interrupt Controller (NVIC)</description>
      <registers>
        <register>
          <name>ISER0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Enables or reads the enabled state of each group of 32 interrupts</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SETENA</name>
              <description>[31:0] For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n + m is enabled</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ISER1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Enables or reads the enabled state of each group of 32 interrupts</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SETENA</name>
              <description>[15:0] For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n + m is enabled</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICER0</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Clears or reads the enabled state of each group of 32 interrupts</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>[31:0] For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n + m is enabled</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICER1</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Clears or reads the enabled state of each group of 32 interrupts</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLRENA</name>
              <description>[15:0] For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n + m is enabled</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ISPR0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>Enables or reads the pending state of each group of 32 interrupts</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>[31:0] For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n + m is pending</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ISPR1</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>Enables or reads the pending state of each group of 32 interrupts</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SETPEND</name>
              <description>[15:0] For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n + m is pending</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICPR0</name>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <description>Clears or reads the pending state of each group of 32 interrupts</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>[31:0] For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n + m is pending</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICPR1</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>Clears or reads the pending state of each group of 32 interrupts</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLRPEND</name>
              <description>[15:0] For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n + m is pending</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IABR0</name>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <description>For each group of 32 interrupts, shows the active state of each interrupt</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>[31:0] For ACTIVE[m] in NVIC_IABR*n, indicates the active state for interrupt 32*n+m</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IABR1</name>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <description>For each group of 32 interrupts, shows the active state of each interrupt</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>[15:0] For ACTIVE[m] in NVIC_IABR*n, indicates the active state for interrupt 32*n+m</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ITNS0</name>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <description>For each group of 32 interrupts, determines whether each interrupt targets Non-secure or Secure state</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ITNS</name>
              <description>[31:0] For ITNS[m] in NVIC_ITNS*n, the target Security state for interrupt 32*n+m</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ITNS1</name>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <description>For each group of 32 interrupts, determines whether each interrupt targets Non-secure or Secure state</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ITNS</name>
              <description>[15:0] For ITNS[m] in NVIC_ITNS*n, the target Security state for interrupt 32*n+m</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR0</name>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*0, the priority of interrupt number 4*0+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*0, the priority of interrupt number 4*0+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*0, the priority of interrupt number 4*0+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*0, the priority of interrupt number 4*0+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR1</name>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*1, the priority of interrupt number 4*1+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*1, the priority of interrupt number 4*1+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*1, the priority of interrupt number 4*1+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*1, the priority of interrupt number 4*1+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR2</name>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*2, the priority of interrupt number 4*2+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*2, the priority of interrupt number 4*2+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*2, the priority of interrupt number 4*2+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*2, the priority of interrupt number 4*2+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR3</name>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*3, the priority of interrupt number 4*3+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*3, the priority of interrupt number 4*3+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*3, the priority of interrupt number 4*3+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*3, the priority of interrupt number 4*3+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR4</name>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*4, the priority of interrupt number 4*4+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*4, the priority of interrupt number 4*4+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*4, the priority of interrupt number 4*4+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*4, the priority of interrupt number 4*4+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR5</name>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*5, the priority of interrupt number 4*5+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*5, the priority of interrupt number 4*5+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*5, the priority of interrupt number 4*5+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*5, the priority of interrupt number 4*5+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR6</name>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*6, the priority of interrupt number 4*6+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*6, the priority of interrupt number 4*6+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*6, the priority of interrupt number 4*6+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*6, the priority of interrupt number 4*6+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
