CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>IPR7</name>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*7, the priority of interrupt number 4*7+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*7, the priority of interrupt number 4*7+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*7, the priority of interrupt number 4*7+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*7, the priority of interrupt number 4*7+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR8</name>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*8, the priority of interrupt number 4*8+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*8, the priority of interrupt number 4*8+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*8, the priority of interrupt number 4*8+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*8, the priority of interrupt number 4*8+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR9</name>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*9, the priority of interrupt number 4*9+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*9, the priority of interrupt number 4*9+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*9, the priority of interrupt number 4*9+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*9, the priority of interrupt number 4*9+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR10</name>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*10, the priority of interrupt number 4*10+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*10, the priority of interrupt number 4*10+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*10, the priority of interrupt number 4*10+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*10, the priority of interrupt number 4*10+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IPR11</name>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <description>Sets or reads interrupt priorities</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>[31:24] For register NVIC_IPR*11, the priority of interrupt number 4*11+3, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>[23:16] For register NVIC_IPR*11, the priority of interrupt number 4*11+2, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>[15:8] For register NVIC_IPR*11, the priority of interrupt number 4*11+1, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>[7:0] For register NVIC_IPR*11, the priority of interrupt number 4*11+0, or is RES0 if the PE does not implement this interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
