CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_SCB</name>
      <baseAddress>0xE000ED00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's System Control Block (SCB)</description>
      <registers>
        <register>
          <name>CPUID</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>CPUID Base
This register determines the ID number of the processor core, the version number of the processor core and the implementation details of the processor core.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>[31:24] Implementor code.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>[23:20] Implementation defined variant number.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CONSTANT</name>
              <description>[19:16] Reads as 0xF</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PARTNO</name>
              <description>[15:4] Number of processor within family.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>[3:0] Implementation defined revision number.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x410FD214</resetValue>
        </register>
        <register>
          <name>ICSR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Interrupt Control State
This register is used to set a pending Non-Maskable Interrupt (NMI), set or clear a pending SVC, set or clear a pending SysTick, check for pending exceptions, check the vector number of the highest priority pended exception, and check the vector number of the active exception.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>NMIPENDSET</name>
              <description>[31:31] Set pending NMI bit. Setting this bit pends and activates an NMI. Because NMI is the highest-priority interrupt, it takes effect as soon as it registers.

0: No action
1: Set pending NMI</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDNMICLR</name>
              <description>[30:30] Pend NMI clear. Allows the NMI exception pending state to be cleared.
0x0 No effect.
0x1 Clear pending status.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>[29:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSVSET</name>
              <description>[28:28] Set pending pendSV bit.

0: No action
1: Set pending PendSV</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSVCLR</name>
              <description>[27:27] Clear pending pendSV bit

0: No action
1: Clear pending pendSV</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>PENDSTSET</name>
              <description>[26:26] Set a pending SysTick bit.

0: No action
1: Set pending SysTick</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>[25:25] Clear pending SysTick bit

0: No action
1: Clear pending SysTick</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>STTNS</name>
              <description>[24:24] SysTick Targets Non-secure. Controls whether in a single SysTick implementation, the SysTick is Secure or
Non-secure.

0x0 SysTick is Secure.
0x1 SysTick is Non-secure.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ISRPREEMPT</name>
              <description>[23:23] This field can only be used at debug time. It indicates that a pending interrupt is to be taken in the next running cycle. If DHCSR.C_MASKINTS= 0, the interrupt is serviced.

0: A pending exception is not serviced.
1: A pending exception is serviced on exit from the debug halt state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ISRPENDING</name>
              <description>[22:22] Interrupt pending flag. Excludes NMI and faults.

0x0: Interrupt not pending
0x1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED21</name>
              <description>[21:21] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VECTPENDING</name>
              <description>[20:12] Pending ISR number field. This field contains the interrupt number of the highest priority pending ISR.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RETTOBASE</name>
              <description>[11:11] Indicates whether there are preempted active exceptions:

0: There are preempted active exceptions to execute
1: There are no active exceptions, or the currently-executing exception is the only active exception.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[10:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VECTACTIVE</name>
              <description>[8:0] Active ISR number field. Reset clears this field.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VTOR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Vector Table Offset
This register is used to relocated the vector table base address. The vector table base offset determines the offset from the bottom of the memory map. The two most significant bits and the seven least significant bits of the vector table base offset must be 0. The portion of vector table base offset that is allowed to change is TBLOFF.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>TBLOFF</name>
              <description>[31:7] Bits 31 down to 7 of the vector table base offset.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[6:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AIRCR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Application Interrupt/Reset Control
This register is used to determine data endianness, clear all active state information for debug or to recover from a hard failure, execute a system reset, alter the priority grouping position (binary point).</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>VECTKEY</name>
              <description>[31:16] Register key. Writing to this register (AIRCR) requires 0x05FA in VECTKEY. Otherwise the write value is ignored. Read always returns 0xFA05.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDIANESS</name>
              <description>[15:15] Data endianness bit</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIG</name>
                  <value>1</value>
                  <description>Big endian</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LITTLE</name>
                  <value>0</value>
                  <description>Little endian</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIS</name>
              <description>[14:14] Prioritize Secure exceptions. The value of this bit defines whether Secure exception priority boosting is
enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BFHFNMINS</name>
              <description>[13:13] BusFault, HardFault, and NMI Non-secure enable. The value of this bit defines whether BusFault and NMI
exceptions are Non-secure, and whether exceptions target the Non-secure HardFault exception
0x0 BusFault, HardFault, and NMI are Secure.
0x1 BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[12:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRIGROUP</name>
              <description>[10:8] Interrupt priority grouping field. This field is a binary point position indicator for creating subpriorities for exceptions that share the same pre-emption level. It divides the PRI_n field in the Interrupt Priority Registers (NVIC_IPR0, NVIC_IPR1,..., and  NVIC_IPR8) into a pre-emption level and a subpriority level. The binary point is a left-of value. This means that the PRIGROUP value represents a point starting at the left of the Least Significant Bit (LSB). The lowest value might not be 0 depending on the number of bits allocated for priorities, and implementation choices.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[7:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSRESETREQS</name>
              <description>[3:3] System reset request Secure only. The value of this bit defines whether the SYSRESETREQ bit is functional
for Non-secure use</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSRESETREQ</name>
              <description>[2:2] Requests a warm reset. Setting this bit does not prevent Halting Debug from running.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>VECTCLRACTIVE</name>
              <description>[1:1] Clears all active state information for active NMI, fault, and interrupts.  It is the responsibility of the application to reinitialize the stack. This bit is for returning to a known state during debug. The bit self-clears. IPSR is not cleared by this operation. So, if used by an application, it must only be used at the base level of activation, or within a system handler whose active bit can be set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0xFA050000</resetValue>
        </register>
        <register>
          <name>SCR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>System Control
This register is used for power-management functions, i.e., signaling to the system when the processor can enter a low power state, controlling how the processor enters and exits low power states.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SEVONPEND</name>
              <description>[4:4] Send Event on Pending bit:

0: Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded
1: Enabled events and all interrupts, including disabled interrupts, can wakeup the processor.

When an event or interrupt enters pending state, the event signal wakes up the processor from WFE. If
the processor is not waiting for an event, the event is registered and affects the next WFE.
The processor also wakes up on execution of an SEV instruction.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPDEEPS</name>
              <description>[3:3] Sleep deep secure. This field controls whether the SLEEPDEEP bit is only accessible from the Secure state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>[2:2] Controls whether the processor uses sleep or deep sleep as its low power mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <value>1</value>
                  <description>Deep sleep</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <value>0</value>
                  <description>Sleep</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPONEXIT</name>
              <description>[1:1] Sleep on exit when returning from Handler mode to Thread mode. Enables interrupt driven applications to avoid returning to empty main application.

0: Do not sleep when returning to thread mode
1: Sleep on ISR exit</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CCR</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Configuration Control
This register is used to enable NMI, HardFault and FAULTMASK to ignore bus fault, trap divide by zero and unaligned accesses, enable user access to the Software Trigger Interrupt Register (STIR), control entry to Thread Mode.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>[31:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[9:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BFHFNMIGN</name>
              <description>[8:8] Enables handlers with priority -1 or -2 to ignore data BusFaults caused by load and store instructions. This applies to the HardFault, NMI, and FAULTMASK escalated handlers:

0: Data BusFaults caused by load and store instructions cause a lock-up
1: Data BusFaults caused by load and store instructions are ignored.

Set this bit to 1 only when the handler and its data are in absolutely safe memory. The normal use
of this bit is to probe system devices and bridges to detect problems.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[7:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV_0_TRP</name>
              <description>[4:4] Enables faulting or halting when the processor executes an SDIV or UDIV instruction with a divisor of 0:

0: Do not trap divide by 0. In this mode, a divide by zero returns a quotient of 0.
1: Trap divide by 0. The relevant Usage Fault Status Register bit is CFSR.DIVBYZERO.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>UNALIGN_TRP</name>
              <description>[3:3] Enables unaligned access traps:

0: Do not trap unaligned halfword and word accesses
1: Trap unaligned halfword and word accesses. The relevant Usage Fault Status Register bit is CFSR.UNALIGNED.

If this bit is set to 1, an unaligned access generates a UsageFault.
Unaligned LDM, STM, LDRD, and STRD instructions always fault regardless of the value in UNALIGN_TRP.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[2:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>USERSETMPEND</name>
              <description>[1:1] Enables unprivileged software access to STIR:

0: User code is not allowed to write to the Software Trigger Interrupt register (STIR).
1: User code can write the Software Trigger Interrupt register (STIR) to trigger (pend) a Main exception, which is associated with the Main stack pointer.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
