CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
        <register>
          <name>SHPR1</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>System Handlers 4-7 Priority
This register is used to prioritize the following system handlers: Memory manage, Bus fault, and Usage fault. System Handlers are a special class of exception handler that can have their priority set to any of the priority levels. Most can be masked on (enabled) or off (disabled). When disabled, the fault is always treated as a Hard Fault.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_7</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_6</name>
              <description>[23:16] Priority of system handler 6. UsageFault</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_5</name>
              <description>[15:8] Priority of system handler 5: BusFault</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4</name>
              <description>[7:0] Priority of system handler 4: MemManage</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SHPR2</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>System Handlers 8-11 Priority
This register is used to prioritize the SVC handler. System Handlers are a special class of exception handler that can have their priority set to any of the priority levels. Most can be masked on (enabled) or off (disabled). When disabled, the fault is always treated as a Hard Fault.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_11</name>
              <description>[31:24] Priority of system handler 11. SVCall</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[23:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SHPR3</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>System Handlers 12-15 Priority
This register is used to prioritize the following system handlers: SysTick, PendSV and Debug Monitor. System Handlers are a special class of exception handler that can have their priority set to any of the priority levels. Most can be masked on (enabled) or off (disabled). When disabled, the fault is always treated as a Hard Fault.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_15</name>
              <description>[31:24] Priority of system handler 15. SysTick exception</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_14</name>
              <description>[23:16] Priority of system handler 14. Pend SV</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>[15:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_12</name>
              <description>[7:0] Priority of system handler 12. Debug Monitor</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SHCSR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>System Handler Control and State
This register is used to enable or disable the system handlers, determine the pending status of bus fault, mem manage fault, and SVC, determine the active status of the system handlers. If a fault condition occurs while its fault handler is disabled, the fault escalates to a Hard Fault.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED22</name>
              <description>[31:22] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HARDFAULTPENDED</name>
              <description>[21:21] SecureFault exception pended state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PENDING</name>
                  <value>1</value>
                  <description>Exception is pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTPENDING</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECUREFAULTPENDED</name>
              <description>[20:20] SecureFault exception pended state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PENDING</name>
                  <value>1</value>
                  <description>Exception is pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTPENDING</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECUREFAULTENA</name>
              <description>[19:19] SecureFault exception enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Exception enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Exception disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USGFAULTENA</name>
              <description>[18:18] Usage fault system handler enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Exception enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Exception disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSFAULTENA</name>
              <description>[17:17] Bus fault system handler enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Exception enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Exception disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMFAULTENA</name>
              <description>[16:16] MemManage fault system handler enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Exception enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Exception disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVCALLPENDED</name>
              <description>[15:15] SVCall pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PENDING</name>
                  <value>1</value>
                  <description>Exception is pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTPENDING</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSFAULTPENDED</name>
              <description>[14:14] BusFault pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PENDING</name>
                  <value>1</value>
                  <description>Exception is pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTPENDING</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMFAULTPENDED</name>
              <description>[13:13] MemManage exception pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PENDING</name>
                  <value>1</value>
                  <description>Exception is pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTPENDING</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USGFAULTPENDED</name>
              <description>[12:12] Usage fault pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PENDING</name>
                  <value>1</value>
                  <description>Exception is pending.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTPENDING</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSTICKACT</name>
              <description>[11:11] SysTick active flag.

0x0: Not active
0x1: Active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PENDSVACT</name>
              <description>[10:10] PendSV active

0x0: Not active
0x1: Active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[9:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MONITORACT</name>
              <description>[8:8] Debug monitor active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVCALLACT</name>
              <description>[7:7] SVCall active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[6:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>NMIACT</name>
              <description>[5:5] NMI exception active state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECUREFAULTACT</name>
              <description>[4:4] SecureFault exception active state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USGFAULTACT</name>
              <description>[3:3] UsageFault exception active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HARDFAULTACT</name>
              <description>[2:2] HardFault exception active state. Indicates and allows limited modification of the active state of the HardFault exception for the selected Security state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSFAULTACT</name>
              <description>[1:1] BusFault exception active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMFAULTACT</name>
              <description>[0:0] MemManage exception active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <value>1</value>
                  <description>Exception is active</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <value>0</value>
                  <description>Exception is not active</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
