CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0x0: Not supported
0x2: Two-stack support</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURITY</name>
              <description>[7:4] Security. Identifies whether the Security Extension is implemented</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[3:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x210</resetValue>
        </register>
        <register>
          <name>ID_DFR0</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Debug Feature 0
This register provides a high level view of the debug system. Further details are provided in the debug infrastructure itself.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MICROCONTROLLER_DEBUG_MODEL</name>
              <description>[23:20] Microcontroller Debug Model - memory mapped

0x0: Not supported
0x1: Microcontroller debug v1 (ITMv1 and DWTv1)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[19:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x100000</resetValue>
        </register>
        <register>
          <name>ID_AFR0</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Auxiliary Feature 0
This register provides some freedom for implementation defined features to be registered. Not used in Cortex-M.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ID_MMFR0</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Memory Model Feature 0
General information on the memory model and memory management support.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x100030</resetValue>
        </register>
        <register>
          <name>ID_MMFR1</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Memory Model Feature 1
General information on the memory model and memory management support.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ID_MMFR2</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Memory Model Feature 2
General information on the memory model and memory management support.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WAIT_FOR_INTERRUPT_STALLING</name>
              <description>[27:24] wait for interrupt stalling

0x0: Not supported
0x1: Wait for interrupt supported</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[23:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1000000</resetValue>
        </register>
        <register>
          <name>ID_MMFR3</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Memory Model Feature 3
General information on the memory model and memory management support.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ID_ISAR0</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>ISA Feature 0
Information on the instruction set attributes register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1101110</resetValue>
        </register>
        <register>
          <name>ID_ISAR1</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>ISA Feature 1
Information on the instruction set attributes register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x2112000</resetValue>
        </register>
        <register>
          <name>ID_ISAR2</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>ISA Feature 2
Information on the instruction set attributes register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x21232231</resetValue>
        </register>
        <register>
          <name>ID_ISAR3</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>ISA Feature 3
Information on the instruction set attributes register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1111131</resetValue>
        </register>
        <register>
          <name>ID_ISAR4</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>ISA Feature 4
Information on the instruction set attributes register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1310132</resetValue>
        </register>
