CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_MPU</name>
      <baseAddress>0xE000ED90</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Memory Protection Unit (MPU)</description>
      <registers>
        <register>
          <name>TYPE</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>The MPU Type Register indicates how many regions the MPU supports</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DREGION</name>
              <description>[15:8] Number of regions supported by the MPU</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SEPARATE</name>
              <description>[0:0] Indicates support for separate instructions and data address regions</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x800</resetValue>
        </register>
        <register>
          <name>CTRL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Enables the MPU and, when the MPU is enabled, controls whether the default memory map is enabled as a background region for privileged accesses, and whether the MPU is enabled for HardFaults, NMIs, and exception handlers when FAULTMASK is set to 1</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRIVDEFENA</name>
              <description>[2:2] Controls whether the default memory map is enabled for privileged software</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HFNMIENA</name>
              <description>[1:1] Controls whether handlers executing with priority less than 0 access memory with the MPU enabled or disabled. This applies to HardFaults, NMIs, and exception handlers when FAULTMASK is set to 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Enables the MPU</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RNR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Selects the region currently accessed by MPU_RBAR and MPU_RLAR</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REGION</name>
              <description>[7:0] Indicates the memory region accessed by MPU_RBAR and MPU_RLAR</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RBAR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Provides indirect read and write access to the base address of the currently selected MPU region</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASE</name>
              <description>[31:5] Contains bits [31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SH</name>
              <description>[4:3] Defines the Shareability domain of this region for Normal memory</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AP</name>
              <description>[2:1] Defines the access permissions for this region</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XN</name>
              <description>[0:0] Defines whether code can be executed from this region</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RLAR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Provides indirect read and write access to the limit address of the currently selected MPU region</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LIMIT</name>
              <description>[31:5] Contains bits [31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[4:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ATTRINDX</name>
              <description>[3:1] Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Region enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RBAR_A1</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Provides indirect read and write access to the base address of the MPU region selected by MPU_RNR[7:2]:(1[1:0])</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASE</name>
              <description>[31:5] Contains bits [31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SH</name>
              <description>[4:3] Defines the Shareability domain of this region for Normal memory</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AP</name>
              <description>[2:1] Defines the access permissions for this region</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XN</name>
              <description>[0:0] Defines whether code can be executed from this region</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RLAR_A1</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Provides indirect read and write access to the limit address of the currently selected MPU region selected by MPU_RNR[7:2]:(1[1:0])</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LIMIT</name>
              <description>[31:5] Contains bits [31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[4:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ATTRINDX</name>
              <description>[3:1] Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Region enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RBAR_A2</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Provides indirect read and write access to the base address of the MPU region selected by MPU_RNR[7:2]:(2[1:0])</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASE</name>
              <description>[31:5] Contains bits [31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SH</name>
              <description>[4:3] Defines the Shareability domain of this region for Normal memory</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AP</name>
              <description>[2:1] Defines the access permissions for this region</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XN</name>
              <description>[0:0] Defines whether code can be executed from this region</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RLAR_A2</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Provides indirect read and write access to the limit address of the currently selected MPU region selected by MPU_RNR[7:2]:(2[1:0])</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LIMIT</name>
              <description>[31:5] Contains bits [31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[4:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ATTRINDX</name>
              <description>[3:1] Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Region enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RBAR_A3</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Provides indirect read and write access to the base address of the MPU region selected by MPU_RNR[7:2]:(3[1:0])</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASE</name>
              <description>[31:5] Contains bits [31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SH</name>
              <description>[4:3] Defines the Shareability domain of this region for Normal memory</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AP</name>
              <description>[2:1] Defines the access permissions for this region</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>XN</name>
              <description>[0:0] Defines whether code can be executed from this region</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RLAR_A3</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Provides indirect read and write access to the limit address of the currently selected MPU region selected by MPU_RNR[7:2]:(3[1:0])</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LIMIT</name>
              <description>[31:5] Contains bits [31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[4:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ATTRINDX</name>
              <description>[3:1] Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Region enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MAIR0</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Along with MPU_MAIR1, provides the memory attribute encodings corresponding to the AttrIndex values</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ATTR3</name>
              <description>[31:24] Memory attribute encoding for MPU regions with an AttrIndex of 3</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>[23:16] Memory attribute encoding for MPU regions with an AttrIndex of 2</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR1</name>
              <description>[15:8] Memory attribute encoding for MPU regions with an AttrIndex of 1</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR0</name>
              <description>[7:0] Memory attribute encoding for MPU regions with an AttrIndex of 0</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MAIR1</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Along with MPU_MAIR0, provides the memory attribute encodings corresponding to the AttrIndex values</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ATTR7</name>
              <description>[31:24] Memory attribute encoding for MPU regions with an AttrIndex of 7</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR6</name>
              <description>[23:16] Memory attribute encoding for MPU regions with an AttrIndex of 6</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR5</name>
              <description>[15:8] Memory attribute encoding for MPU regions with an AttrIndex of 5</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR4</name>
              <description>[7:0] Memory attribute encoding for MPU regions with an AttrIndex of 4</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
