CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_DCB</name>
      <baseAddress>0xE000EDE0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Debug Control Block</description>
      <registers>
        <register>
          <name>DHCSR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Controls halting debug</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED27</name>
              <description>[31:27] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>S_RESTART_ST</name>
              <description>[26:26] Indicates the PE has processed a request to clear DHCSR.C_HALT to 0. That is, either a write to DHCSR that clears DHCSR.C_HALT from 1 to 0, or an External Restart Request</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>S_RESET_ST</name>
              <description>[25:25] Indicates whether the PE has been reset since the last read of the DHCSR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>S_RETIRE_ST</name>
              <description>[24:24] Set to 1 every time the PE retires one of more instructions</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED21</name>
              <description>[23:21] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>S_SDE</name>
              <description>[20:20] Indicates whether Secure invasive debug is allowed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>S_LOCKUP</name>
              <description>[19:19] Indicates whether the PE is in Lockup state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>S_SLEEP</name>
              <description>[18:18] Indicates whether the PE is sleeping</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>S_HALT</name>
              <description>[17:17] Indicates whether the PE is in Debug state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DBGKEY</name>
              <description>[31:16] A debugger must write 0xA05F to this field to enable write access to the remaining bits, otherwise the PE ignores the write access</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[15:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>C_SNAPSTALL</name>
              <description>[5:5] Allow imprecise entry to Debug state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[4:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>C_MASKINTS</name>
              <description>[3:3] When debug is enabled, the debugger can write to this bit to mask PendSV, SysTick and external configurable interrupts</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>C_STEP</name>
              <description>[2:2] Enable single instruction step</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>C_HALT</name>
              <description>[1:1] PE enter Debug state halt request</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>C_DEBUGEN</name>
              <description>[0:0] Enable Halting debug</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DCRSR</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>With the DCRDR, provides debug access to the general-purpose registers, special-purpose registers, and the FP extension registers. A write to the DCRSR specifies the register to transfer, whether the transfer is a read or write, and starts the transfer</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REGWnR</name>
              <description>[16:16] Specifies the access type for the transfer</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[15:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REGSEL</name>
              <description>[6:0] Specifies the general-purpose register, special-purpose register, or FP register to transfer</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DCRDR</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>With the DCRSR, provides debug access to the general-purpose registers, special-purpose registers, and the FP Extension registers. If the Main Extension is implemented, it can also be used for message passing between an external debugger and a debug agent running on the PE</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGTMP</name>
              <description>[31:0] Provides debug access for reading and writing the general-purpose registers, special-purpose registers, and Floating-point Extension registers</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DEMCR</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Manages vector catch behavior and DebugMonitor handling when debugging</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCENA</name>
              <description>[24:24] Global enable for all DWT and ITM features</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED21</name>
              <description>[23:21] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SDME</name>
              <description>[20:20] Indicates whether the DebugMonitor targets the Secure or the Non-secure state and whether debug events are allowed in Secure state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MON_REQ</name>
              <description>[19:19] DebugMonitor semaphore bit</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MON_STEP</name>
              <description>[18:18] Enable DebugMonitor stepping</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MON_PEND</name>
              <description>[17:17] Sets or clears the pending state of the DebugMonitor exception</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MON_EN</name>
              <description>[16:16] Enable the DebugMonitor exception</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VC_SFERR</name>
              <description>[11:11] SecureFault exception halting debug vector catch enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VC_HARDERR</name>
              <description>[10:10] HardFault exception halting debug vector catch enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_INTERR</name>
              <description>[9:9] Enable halting debug vector catch for faults during exception entry and return</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VC_BUSERR</name>
              <description>[8:8] BusFault exception halting debug vector catch enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VC_STATERR</name>
              <description>[7:7] Enable halting debug trap on a UsageFault exception caused by a state information error, for example an Undefined Instruction exception</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VC_CHKERR</name>
              <description>[6:6] Enable halting debug trap on a UsageFault exception caused by a checking error, for example an alignment check error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VC_NOCPERR</name>
              <description>[5:5] Enable halting debug trap on a UsageFault caused by an access to a coprocessor</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VC_MMERR</name>
              <description>[4:4] Enable halting debug trap on a MemManage exception</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VC_CORERESET</name>
              <description>[0:0] Enable Reset Vector Catch. This causes a warm reset to halt a running system</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DAUTHCTRL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>This register allows the external authentication interface to be
overridden from software.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INTSPNIDEN</name>
              <description>[3:3] Internal Secure non-invasive debug enable. Overrides the external Secure non-invasive debug authentication interface</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPNIDENSEL</name>
              <description>[2:2] Secure non-invasive debug enable select. Selects between DAUTHCTRL and the external authentication interface for control of Secure non-invasive debug</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSPIDEN</name>
              <description>[1:1] Internal Secure invasive debug enable. Overrides the external Secure invasive debug authentication Interfaces.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIDENSEL</name>
              <description>[0:0] Secure invasive debug enable select. Selects between DAUTHCTRL and the external authentication interface for control of Secure invasive debug.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DSCSR</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Provides control and status information for Secure debug</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED18</name>
              <description>[31:18] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CDSKEY</name>
              <description>[17:17] Writes to the CDS bit are ignored unless CDSKEY is concurrently written to zero</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CDS</name>
              <description>[16:16] This field indicates the current Security state of the processor</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[15:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SBRSEL</name>
              <description>[1:1] If SBRSELEN is 1 this bit selects whether the Non-secure or the Secure version of the memory-mapped Banked registers are accessible to the debugger</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SBRSELEN</name>
              <description>[0:0] Controls whether the SBRSEL field or the current Security state of the processor selects which version of the memory-mapped Banked registers are accessed to the debugger</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
