CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_SIG</name>
      <baseAddress>0xE000EF00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Software Interrupt Generator (SIG)</description>
      <registers>
        <register>
          <name>STIR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Provides a mechanism for software to generate an interrupt</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INTID</name>
              <description>[8:0] Indicates the interrupt to be pended. The value written is (ExceptionNumber - 16)</description>
              <bitWidth>9</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_FPU</name>
      <baseAddress>0xE000EF30</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Floating Point Unit (FPU)</description>
      <registers>
        <register>
          <name>FPCCR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Holds control data for the Floating-point extension</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASPEN</name>
              <description>[31:31] When this bit is set to 1, execution of a floating-point instruction sets the CONTROL.FPCA bit to 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPEN</name>
              <description>[30:30] Enables lazy context save of floating-point state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPENS</name>
              <description>[29:29] This bit controls whether the LSPEN bit is writeable from the Non-secure state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRONRET</name>
              <description>[28:28] Clear floating-point caller saved registers on exception return</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRONRETS</name>
              <description>[27:27] This bit controls whether the CLRONRET bit is writeable from the Non-secure state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TS</name>
              <description>[26:26] Treat floating-point registers as Secure enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[25:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>UFRDY</name>
              <description>[10:10] Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the UsageFault exception to pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIMVIOL</name>
              <description>[9:9] This bit is banked between the Security states and indicates whether the floating-point context violates the stack pointer limit that was active when lazy state preservation was activated. SPLIMVIOL modifies the lazy floating-point state preservation behavior</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MONRDY</name>
              <description>[8:8] Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the DebugMonitor exception to pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SFRDY</name>
              <description>[7:7] Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the SecureFault exception to pending. This bit is only present in the Secure version of the register, and behaves as RAZ/WI when accessed from the Non-secure state</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BFRDY</name>
              <description>[6:6] Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the BusFault exception to pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>MMRDY</name>
              <description>[5:5] Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the MemManage exception to pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>HFRDY</name>
              <description>[4:4] Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the HardFault exception to pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>THREAD</name>
              <description>[3:3] Indicates the PE mode when it allocated the floating-point stack frame</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>S</name>
              <description>[2:2] Security status of the floating-point context. This bit is only present in the Secure version of the register, and behaves as RAZ/WI when accessed from the Non-secure state. This bit is updated whenever lazy state preservation is activated, or when a floating-point instruction is executed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>USER</name>
              <description>[1:1] Indicates the privilege level of the software executing when the PE allocated the floating-point stack frame</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPACT</name>
              <description>[0:0] Indicates whether lazy preservation of the floating-point state is active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FPCAR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Holds the location of the unpopulated floating-point register space allocated on an exception stack frame</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>[31:3] The location of the unpopulated floating-point register space allocated on an exception stack frame</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[2:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FPDSCR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Holds the default values for the floating-point status control data that the PE assigns to the FPSCR when it creates a new floating-point context</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED27</name>
              <description>[31:27] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AHP</name>
              <description>[26:26] Default value for FPSCR.AHP</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DN</name>
              <description>[25:25] Default value for FPSCR.DN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>FZ</name>
              <description>[24:24] Default value for FPSCR.FZ</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RMode</name>
              <description>[23:22] Default value for FPSCR.RMode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[21:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MVFR0</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Describes the features provided by the Floating-point Extension</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FPRound</name>
              <description>[31:28] Indicates the rounding modes supported by the FP Extension</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[27:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPSqrt</name>
              <description>[23:20] Indicates the support for FP square root operations</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPDivide</name>
              <description>[19:16] Indicates the support for FP divide operations</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPDP</name>
              <description>[11:8] Indicates support for FP double-precision operations</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPSP</name>
              <description>[7:4] Indicates support for FP single-precision operations</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SIMDReg</name>
              <description>[3:0] Indicates size of FP register file</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MVFR1</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Describes the features provided by the Floating-point Extension</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FMAC</name>
              <description>[31:28] Indicates whether the FP Extension implements the fused multiply accumulate instructions</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPHP</name>
              <description>[27:24] Indicates whether the FP Extension implements half-precision FP conversion instructions</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>[23:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPDNaN</name>
              <description>[7:4] Indicates whether the FP hardware implementation supports NaN propagation</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPFtZ</name>
              <description>[3:0] Indicates whether subnormals are always flushed-to-zero</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MVFR2</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Describes the features provided by the Floating-point Extension</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FPMisc</name>
              <description>[7:4] Indicates support for miscellaneous FP features</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[3:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
