CoolNamesAllTaken/adsbee/firmware/adsbee_1421/ti/cc13x4_cc26x4.svd
0: Continuous formatting disabled
1: Continuous formatting enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x142</resetValue>
        </register>
        <register>
          <name>PSCR</name>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <description>Formatter Synchronization Counter</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PSCOUNT</name>
              <description>[4:0] Periodic Synchronization Count. Determines the reload value of the Periodic Synchronization Counter. The reload value takes effect the next time the counter reaches zero. Reads from this register return the reload value programmed into this register

0b00000 Synchronization disabled.
0b00111 128 bytes.
0b01000 256 bytes.
0b11111 2^31 bytes.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLAIMMASK</name>
          <addressOffset>0xfa0</addressOffset>
          <size>32</size>
          <description>Claim Tag Mask</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLAIMMASK</name>
              <description>[31:0] This register forms one half of the Claim Tag value. When reading this register returns the number of bits that can be set (each bit is considered separately):

0: This claim tag bit is not implemented
1: This claim tag bit is implemented

The behavior when writing to this register is described in CLAIMSET.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>CLAIMSET</name>
          <addressOffset>0xfa0</addressOffset>
          <size>32</size>
          <description>Claim Tag Set</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLAIMSET</name>
              <description>[31:0] This register forms one half of the Claim Tag value. Writing to this location allows individual bits to be set (each bit is considered separately):

0: No effect
1: Set this bit in the claim tag

The behavior when reading from this location is described in CLAIMMASK.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>CLAIMTAG</name>
          <addressOffset>0xfa4</addressOffset>
          <size>32</size>
          <description>Current Claim Tag</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLAIMTAG</name>
              <description>[31:0] This register forms one half of the Claim Tag value. Reading this register returns the current Claim Tag value.
Reading CLAIMMASK determines how many bits from this register must be used.

The behavior when writing to this register is described in CLAIMCLR.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <addressOffset>0xfa4</addressOffset>
          <size>32</size>
          <description>Claim Tag Clear</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLAIMCLR</name>
              <description>[31:0] This register forms one half of the Claim Tag value. Writing to this location enables individual bits to be cleared (each bit is considered separately):

0: No effect
1: Clear this bit in the claim tag.

The behavior when reading from this location is described in CLAIMTAG.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DEVID</name>
          <addressOffset>0xfc8</addressOffset>
          <size>32</size>
          <description>Device ID</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DEVID</name>
              <description>[31:0] This field returns: 0xCA1 if there is an ETM present. 0xCA0 if there is no ETM present.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xCA0</resetValue>
        </register>
        <register>
          <name>DEVTYPE</name>
          <addressOffset>0xfcc</addressOffset>
          <size>32</size>
          <description>The Device Type Identification</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SUBTYPE</name>
              <description>[7:4] Identifies the classification of the debug component</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJORTYPE</name>
              <description>[3:0] Indicates this device is a trace sink and specifically a TPIU</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x11</resetValue>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>